{
    "ticker": "ABBV",
    "total_news": 13,
    "average_sentiment": -0.04546504446233694,
    "weighted_average_sentiment": -0.13560127532857397,
    "average_daily_sentiments": [
        0,
        -0.01730150682851672,
        -0.46700031589716673,
        -0.4184277302119881,
        0.3710786293571194,
        0.905250727199018,
        0.032782373018562794
    ],
    "news": [
        {
            "id": "868183b1-c359-3a35-b5cc-6734aa1e04fe",
            "summary": "What should investors do when stocks are tanking over the short term?  Three Motley Fool contributors think they've found great dividend stocks to own for the long term that pay you to wait for better days.  Here's why they picked AbbVie (NYSE: ABBV), Amgen (NASDAQ: AMGN), and Eli Lilly (NYSE: LLY).",
            "date": "2025-04-06T10:44:00Z",
            "sentiment-score": 0.032782373018562794
        },
        {
            "id": "d1cb0740-8475-3724-b6e2-f9a3e981d0ec",
            "summary": "AbbVie (NYSE:ABBV) has been actively advancing its oncology portfolio with recent presentations at the AACR Annual Meeting, showcasing developments like ABBV-969 and ABBV-514, both highlighting innovation in cancer treatment. This aligns with AbbVie's upward price move of 4% over the last quarter, despite wider market volatility from tariff uncertainties that saw the Dow Jones drop over 900 points on certain days. As other sectors of the market faced declines, AbbVie's focus on new product...",
            "date": "2025-04-07T17:31:57Z",
            "sentiment-score": 0.905250727199018
        },
        {
            "id": "d17ed308-767e-3b8c-8cea-9c5ccb103d9e",
            "summary": "Investing.com -- Goldman Sachs initiated coverage on several large-cap pharmaceutical companies, taking a cautious stance on Bristol-Myers Squibb (NYSE:BMY), Pfizer (NYSE:PFE), and AbbVie (NYSE:ABBV), while upgrading Eli Lilly (NYSE:LLY) to a Buy on strong growth prospects in obesity treatments.",
            "date": "2025-04-08T13:08:17Z",
            "sentiment-score": 0.7730456702411175
        },
        {
            "id": "06370ec1-8cea-3a5c-98d7-332c0bdbd272",
            "summary": "Style Box ETF report for SCHD",
            "date": "2025-04-08T10:20:08Z",
            "sentiment-score": -0.004320250824093819
        },
        {
            "id": "d1663805-ea7c-3180-a1b8-f2d4941ac61e",
            "summary": "European Commission approves ABBV's Rinvoq for its eighth indication, giant cell arteritis.",
            "date": "2025-04-08T13:15:00Z",
            "sentiment-score": 0.34451046865433455
        },
        {
            "id": "5cab3809-b66e-3faa-ba7a-e4d34635f17e",
            "summary": "With equity markets in shambles due to President Donald Trump's trade policies, now might be as good a time as any to invest in excellent dividend stocks.  With that said, let's consider two top dividend stocks that should navigate the current storm relatively well and continue performing long after: AbbVie (NYSE: ABBV) and Gilead Sciences (NASDAQ: GILD).  AbbVie went public in 2013, splitting from its former parent company, Abbott Laboratories.",
            "date": "2025-04-09T11:00:00Z",
            "sentiment-score": 0.1848419620655477
        },
        {
            "id": "d18be501-4723-301f-a723-fa4766c0f052",
            "summary": "The authorisation was based on data from the multicentre Phase III SELECT-GCA trial.",
            "date": "2025-04-09T09:01:48Z",
            "sentiment-score": 0.024851927999407053
        },
        {
            "id": "be7d1b24-7c1e-38ff-91b2-281ea7807568",
            "summary": "Big pharmaceutical names plowed lower Wednesday after Trump on Tuesday said that tariffs would take direct aim at drug imports.",
            "date": "2025-04-09T13:08:24Z",
            "sentiment-score": -0.9341345755383372
        },
        {
            "id": "f171bfb7-94e2-3b98-bde2-9d5add357a5c",
            "summary": "Stocks in drugmakers sold off globally after President Trump said tariffs on pharmaceutical imports will be unveiled shortly, signaling the industry could be next in line amid a trade war that is causing market turmoil.  AbbVie, Eli Lilly, Johnson & Johnson, Merck and Pfizer all fell at least 2% Wednesday morning.  Denmark's Novo Nordisk, Switzerland's Novartis and the U.K.'s AstraZeneca and GSK also fell 2% or more in the U.S.",
            "date": "2025-04-09T13:51:17Z",
            "sentiment-score": -0.9492702353745699
        },
        {
            "id": "f8fa3801-3898-3a0e-adf5-510b4d831d64",
            "summary": "EU approves expanded use of ABBV's Rinvoq and AZN's Imfinzi and Enhertu. NVS set to invest $23B to boost U.S. manufacturing.",
            "date": "2025-04-11T15:47:00Z",
            "sentiment-score": 0.8833163687959313
        },
        {
            "id": "831eb40b-3af7-3c9a-9946-a44f5602e5e9",
            "summary": "ClearBridge Investments, an investment management company, released its “ClearBridge Growth Strategy” first quarter 2025 investor letter. A copy of the letter can be downloaded here. First quarter of 2025 witnessed sharp equities sell off due to the shift out of mega caps. There was a relative outperformance of mid cap growth stocks over large and […]",
            "date": "2025-04-11T14:16:18Z",
            "sentiment-score": -0.9179193824529648
        },
        {
            "id": "5788e167-ba2e-3f2d-8e9e-4bfb72e0e2c1",
            "summary": "Pharma stocks tumbled Thursday after the Trump administration said the delay for reciprocal tariffs doesn't apply to sector-specific tariffs.",
            "date": "2025-04-10T16:58:23Z",
            "sentiment-score": -0.9471217887476087
        },
        {
            "id": "dd87f1e5-d7ce-308c-95c9-ebad75f67e23",
            "summary": "Zacks.com users have recently been watching AbbVie (ABBV) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.",
            "date": "2025-04-10T13:00:16Z",
            "sentiment-score": 0.013121156953275204
        }
    ]
}