{
    "ticker": "ABBV",
    "total_news": 15,
    "average_sentiment": -0.10279004617283742,
    "weighted_average_sentiment": -0.07136115652098451,
    "average_daily_sentiments": [
        -0.4184277302119881,
        0.3710786293571194,
        0.905250727199018,
        0.032782373018562794,
        -0.4399591976155837,
        0,
        -0.1998437223955989
    ],
    "news": [
        {
            "id": "b0cf2081-f718-3185-954d-691dc27fe873",
            "summary": "AbbVie on Thursday cut its 2025 adjusted profit forecast as the drugmaker expects to incur $248 million in acquisition expenses related to milestone payments as well as research and development costs. The company has been focusing on expanding its pipeline since its blockbuster arthritis drug, Humira, lost patent protection in 2023. To that end, the company bought neuroscience drug developer Cerevel Therapeutics, cancer drug developer ImmunoGen and Alzheimer's therapy developer Aliada in 2024 through deals worth over $20 billion in total.",
            "date": "2025-04-03T20:34:48Z",
            "sentiment-score": -0.8636397495865822
        },
        {
            "id": "7ffe3f1a-9127-3a8a-adaf-a7b54ae24a5f",
            "summary": "\"Buy and hold\" is a simple strategy for investors, but it can be a hard one to stick to in actual practice.  Not every long-term investment will turn out that way, but investing a modest amount of money in growth stocks and letting it sit can be your best financial move.  Retirees on the lookout for some reliable dividend stocks can find plenty of attractive buying opportunities in the markets today.",
            "date": "2025-04-03T13:00:00Z",
            "sentiment-score": 0.055264237336814404
        },
        {
            "id": "d3857ca5-41bd-3a65-926d-0f7210842491",
            "summary": "In the closing of the recent trading day, AbbVie (ABBV) stood at $201.64, denoting a -1.73% change from the preceding trading day.",
            "date": "2025-04-03T21:45:15Z",
            "sentiment-score": 0.20884434506297112
        },
        {
            "id": "38e5c5c8-57d9-3b7a-88ec-e4a4c84f7823",
            "summary": "The major averages were sharply lower again near noon, continuing yesterday’s post-tariff slide. China has retaliated with additional tariffs of 34% on all U.S. goods a day after the Trump administration imposed its own sweeping levies. Meanwhile, the latest U.S. jobs data show that nonfarm payrolls rose by a higher-than-forecast 228,000 jobs, though the unemployment rate has ticked higher. Looking to commodities, oil prices are sharply lower due to a planned output increase promised by OPEC+ as",
            "date": "2025-04-05T16:10:32Z",
            "sentiment-score": -0.7312252093106508
        },
        {
            "id": "54620c9e-fe6e-33da-8af1-89e53c20fe49",
            "summary": "This stands to reason, as nearly every stage of drug development and marketing is resource- and capital-intensive, and as a result, cash can be in short supply.  Let's take a look at two outliers with dividend policies that have looked especially attractive lately -- pharmaceutical companies Amgen (NASDAQ: AMGN) and AbbVie (NYSE: ABBV).  Amgen's involvement in the high-demand obesity drugs race has attracted attention recently, but the pharmaceutical sector star has been on the radar of clever investors for years.",
            "date": "2025-04-05T12:30:00Z",
            "sentiment-score": 0.06398462876677513
        },
        {
            "id": "516d69ec-7f0f-378e-9208-aad16329b587",
            "summary": "(Bloomberg) -- Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersLocal Governments Vie for Fired Federal WorkersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesWhat Would ‘Transportation Abundance’ Look Like?Hochul Says Trump’s Tariffs Are Already Hurting New York EconomyWhen US President Donald Trump slapped bigger-than-expected tariffs on imports from around the world, Americans lamented pending prices hikes for Champagne, Parmesan and Ferra",
            "date": "2025-04-05T04:00:02Z",
            "sentiment-score": -0.6526370123028755
        },
        {
            "id": "868183b1-c359-3a35-b5cc-6734aa1e04fe",
            "summary": "What should investors do when stocks are tanking over the short term?  Three Motley Fool contributors think they've found great dividend stocks to own for the long term that pay you to wait for better days.  Here's why they picked AbbVie (NYSE: ABBV), Amgen (NASDAQ: AMGN), and Eli Lilly (NYSE: LLY).",
            "date": "2025-04-06T10:44:00Z",
            "sentiment-score": 0.032782373018562794
        },
        {
            "id": "d1cb0740-8475-3724-b6e2-f9a3e981d0ec",
            "summary": "AbbVie (NYSE:ABBV) has been actively advancing its oncology portfolio with recent presentations at the AACR Annual Meeting, showcasing developments like ABBV-969 and ABBV-514, both highlighting innovation in cancer treatment. This aligns with AbbVie's upward price move of 4% over the last quarter, despite wider market volatility from tariff uncertainties that saw the Dow Jones drop over 900 points on certain days. As other sectors of the market faced declines, AbbVie's focus on new product...",
            "date": "2025-04-07T17:31:57Z",
            "sentiment-score": 0.905250727199018
        },
        {
            "id": "d17ed308-767e-3b8c-8cea-9c5ccb103d9e",
            "summary": "Investing.com -- Goldman Sachs initiated coverage on several large-cap pharmaceutical companies, taking a cautious stance on Bristol-Myers Squibb (NYSE:BMY), Pfizer (NYSE:PFE), and AbbVie (NYSE:ABBV), while upgrading Eli Lilly (NYSE:LLY) to a Buy on strong growth prospects in obesity treatments.",
            "date": "2025-04-08T13:08:17Z",
            "sentiment-score": 0.7730456702411175
        },
        {
            "id": "06370ec1-8cea-3a5c-98d7-332c0bdbd272",
            "summary": "Style Box ETF report for SCHD",
            "date": "2025-04-08T10:20:08Z",
            "sentiment-score": -0.004320250824093819
        },
        {
            "id": "d1663805-ea7c-3180-a1b8-f2d4941ac61e",
            "summary": "European Commission approves ABBV's Rinvoq for its eighth indication, giant cell arteritis.",
            "date": "2025-04-08T13:15:00Z",
            "sentiment-score": 0.34451046865433455
        },
        {
            "id": "5cab3809-b66e-3faa-ba7a-e4d34635f17e",
            "summary": "With equity markets in shambles due to President Donald Trump's trade policies, now might be as good a time as any to invest in excellent dividend stocks.  With that said, let's consider two top dividend stocks that should navigate the current storm relatively well and continue performing long after: AbbVie (NYSE: ABBV) and Gilead Sciences (NASDAQ: GILD).  AbbVie went public in 2013, splitting from its former parent company, Abbott Laboratories.",
            "date": "2025-04-09T11:00:00Z",
            "sentiment-score": 0.1848419620655477
        },
        {
            "id": "d18be501-4723-301f-a723-fa4766c0f052",
            "summary": "The authorisation was based on data from the multicentre Phase III SELECT-GCA trial.",
            "date": "2025-04-09T09:01:48Z",
            "sentiment-score": 0.024851927999407053
        },
        {
            "id": "be7d1b24-7c1e-38ff-91b2-281ea7807568",
            "summary": "Big pharmaceutical names plowed lower Wednesday after Trump on Tuesday said that tariffs would take direct aim at drug imports.",
            "date": "2025-04-09T13:08:24Z",
            "sentiment-score": -0.9341345755383372
        },
        {
            "id": "f171bfb7-94e2-3b98-bde2-9d5add357a5c",
            "summary": "Stocks in drugmakers sold off globally after President Trump said tariffs on pharmaceutical imports will be unveiled shortly, signaling the industry could be next in line amid a trade war that is causing market turmoil.  AbbVie, Eli Lilly, Johnson & Johnson, Merck and Pfizer all fell at least 2% Wednesday morning.  Denmark's Novo Nordisk, Switzerland's Novartis and the U.K.'s AstraZeneca and GSK also fell 2% or more in the U.S.",
            "date": "2025-04-09T13:51:17Z",
            "sentiment-score": -0.9492702353745699
        }
    ]
}