{
    "ticker": "ADBE",
    "total_news": 11,
    "average_sentiment": -0.11138409608975053,
    "weighted_average_sentiment": -0.08011627800062027,
    "average_daily_sentiments": [
        0.019990837201476097,
        0.024182995160420735,
        0,
        -0.8873764700256288,
        0.03410588367842138,
        -0.051058804616332054,
        -0.14918045746162534
    ],
    "news": [
        {
            "id": "6155b2e5-fb5b-347d-a61a-97fd52eadc6f",
            "summary": "Investing.com -- The latest wave of U.S. tariffs rattled markets, hitting software stocks with declines ranging from low single digits to more than 10% in smaller-cap names. But according to Bernstein, the reaction may be more panic than substance.",
            "date": "2025-04-06T10:30:05Z",
            "sentiment-score": -0.9272495387122035
        },
        {
            "id": "40d659be-6b39-34de-b229-900fd8f92605",
            "summary": "Key Insights The projected fair value for Adobe is US$620 based on 2 Stage Free Cash Flow to Equity Adobe is estimated...",
            "date": "2025-04-06T11:00:10Z",
            "sentiment-score": 0.05495477234944701
        },
        {
            "id": "684c930d-1475-3adc-b013-ae604c056ebc",
            "summary": "Amid hype over artificial intelligence, the best AI stocks generate revenue or get a strategic edge from the fast evolving technology.",
            "date": "2025-04-06T13:35:48Z",
            "sentiment-score": 0.4247533939778805
        },
        {
            "id": "6427c233-bc55-370a-957e-381de51b87e8",
            "summary": "We recently published a list of 10 Best High-Risk Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Adobe Inc. (NASDAQ:ADBE) stands against other best high-risk stocks to buy according to billionaires. Investors often retreat into safer assets during volatility when the global markets move towards […]",
            "date": "2025-04-07T12:04:06Z",
            "sentiment-score": -0.051058804616332054
        },
        {
            "id": "1bb6dbe8-7110-3f41-bc11-20dea600b102",
            "summary": "Recently, Zacks.com users have been paying close attention to Adobe (ADBE). This makes it worthwhile to examine what the stock has in store.",
            "date": "2025-04-08T13:00:13Z",
            "sentiment-score": 0.050723903346806765
        },
        {
            "id": "319b0951-5e23-3fe6-bf70-9e4d4d447548",
            "summary": "We recently published a list of 10 Best Stocks to Buy According to Billionaire Steve Cohen. In this article, we are going to take a look at where Adobe Inc. (NASDAQ:ADBE) stands against other best stocks to buy according to billionaire Steve Cohen. Steve Cohen, a prominent figure in the world of hedge funds, is […]",
            "date": "2025-04-08T18:52:43Z",
            "sentiment-score": 0.01748786401003599
        },
        {
            "id": "699896f5-b0f9-37cc-b9bf-86499f18fcf6",
            "summary": "Adobe (NasdaqGS:ADBE) has extended its partnership with Monotype Imaging Inc., enhancing Adobe Creative Cloud with over 2,800 high-quality fonts, likely boosting user satisfaction and brand consistency. Despite this positive development, Adobe's stock fell 11.27% over the past week, a move that mirrors the broader market downturn amid rising U.S.-China trade tensions and sweeping tariffs announced by the Trump administration. While the integration of new AI tools in Adobe's Premiere Pro and...",
            "date": "2025-04-09T17:49:04Z",
            "sentiment-score": -0.8873764700256288
        },
        {
            "id": "8b2b4071-c2ff-317b-a972-e48259779f55",
            "summary": "We recently published a list of the 13 NASDAQ Stocks with the Highest Upside Potential. In this article, we are going to take a look at where Adobe Inc. (NASDAQ:ADBE) stands against other NASDAQ stocks with high upside potential. On April 7, Dan Ives of Wedbush Securities joined CNBC’s ‘Squawk on the Street’ to discuss […]",
            "date": "2025-04-12T13:04:01Z",
            "sentiment-score": 0.019990837201476097
        },
        {
            "id": "a2cb9f5c-186a-3c70-be98-3c2ef61b76c7",
            "summary": "Adobe (ADBE) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues.",
            "date": "2025-04-11T15:30:06Z",
            "sentiment-score": 0.007105730473995209
        },
        {
            "id": "37c496d3-60cb-3d47-a0bc-fe50fe9c0024",
            "summary": "We recently published a list of Long-Term Stock Portfolio: 15 Best Stocks for 15 Years. In this article, we are going to take a look at where Adobe Inc. (NASDAQ:ADBE) stands against other best stocks for 15 years. Russell Investments believes that 3 features are defining the market outlook for 2025. These include the elevated level […]",
            "date": "2025-04-11T15:10:52Z",
            "sentiment-score": 0.04145402833819389
        },
        {
            "id": "3ffb7638-473f-31bd-bec0-5697d01533d8",
            "summary": "Wall Street is overwhelmingly bullish on the stocks in this article, with price targets suggesting significant upside potential. However, it’s worth remembering that analysts rarely issue sell ratings, partly because their firms often seek other business from the same companies they cover.",
            "date": "2025-04-11T13:02:31Z",
            "sentiment-score": 0.023989226669073105
        }
    ]
}