{
    "ticker": "AMD",
    "total_news": 31,
    "average_sentiment": -0.19578885452281083,
    "weighted_average_sentiment": -0.07708398746592657,
    "average_daily_sentiments": [
        0.33428423882772523,
        0.09762590130170186,
        0.01800470892339945,
        0.025223687873221934,
        -0.8216633654923903,
        0.10991550935432315,
        -0.35135877784341574
    ],
    "news": [
        {
            "id": "1e01e888-b205-3de4-98db-fe1e0efd3042",
            "summary": "Although recent stock market volatility has pushed down prices for many stocks, the artificial intelligence (AI) sector remains a compelling investment, with the tremendous transformative potential it brings to many industries.  A newcomer to the AI space is the recent initial public offering (IPO) CoreWeave (NASDAQ: CRWV).  The company went public on March 28, and AI semiconductor powerhouse Nvidia was among those that bought shares.",
            "date": "2025-04-06T13:13:00Z",
            "sentiment-score": 0.12456437107175589
        },
        {
            "id": "e6bd04b1-f4b1-3c93-9a7d-4850b52b0d3b",
            "summary": "Advanced Micro Devices (NasdaqGS:AMD) recently unveiled its 5th Gen AMD EPYC™ processors, significantly boosting Oracle Cloud Infrastructure's performance, as well as expanding its x86 embedded processor portfolio. Despite these announcements, the company's share price decreased by 15% over the past month. This decline occurs amid a broader tech sector downturn, with the Nasdaq entering bear market territory following heightened volatility due to a trade war with China. The tech-heavy index...",
            "date": "2025-04-06T17:24:34Z",
            "sentiment-score": -0.8272819267585874
        },
        {
            "id": "05065dcb-6562-36d2-9987-68d74a60ecee",
            "summary": "We recently published a list of 10 Best High-Risk Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against other best high-risk stocks to buy according to billionaires. Investors often retreat into safer assets during volatility when the global markets […]",
            "date": "2025-04-07T12:04:58Z",
            "sentiment-score": -0.02286102995276451
        },
        {
            "id": "1fbda66c-00fe-3414-9a89-9721e1e5b9c2",
            "summary": "Articul8 has introduced A8-SupplyChain, a groundbreaking domain-specific Generative AI model designed to optimize supply chain, manufacturing, and industrial process operations. Leveraging autonomous reasoning and real-time decision-making capabilities, A8-SupplyChain surpasses the limitations of general-purpose language models by effectively handling complex industrial systems and translating technical documentation into actionable procedures. This innovation is incorporated into Articul8's...",
            "date": "2025-04-07T11:07:32Z",
            "sentiment-score": 0.2426920486614108
        },
        {
            "id": "d3008a37-3c76-3952-ac04-7cdf1319a657",
            "summary": "AMD Downgraded After 50% Drop, Analysts Cite Intense Intel Competition",
            "date": "2025-04-08T13:41:02Z",
            "sentiment-score": -0.9340506624430418
        },
        {
            "id": "0ba88920-9a0b-3cc5-ae1f-e782d6edf1ec",
            "summary": "Advanced Micro Devices risks falling behind as competition in the server and PC markets ramps up, say analysts at KeyBanc.",
            "date": "2025-04-08T11:58:00Z",
            "sentiment-score": -0.9214718919247389
        },
        {
            "id": "d04c8aa2-b455-3e19-bfa9-c625fc917b3e",
            "summary": "To say that the stock market has been volatile lately doesn't do the situation justice.  The S&P 500 (SNPINDEX: ^GSPC) and several other major market indexes recently fell by more than 10% over a two-day period in response to President Trump's surprisingly high tariff rates.  The S&P 500 is now 18% below its February high, and with a 23% drop, the Nasdaq Composite (NASDAQINDEX: ^IXIC) is now firmly in bear market territory.",
            "date": "2025-04-08T09:41:00Z",
            "sentiment-score": -0.9554864298552275
        },
        {
            "id": "a0916ed0-a4d0-499c-bc29-27930b793194",
            "summary": "AMD stock catches a downgrade as Trump tariff fears spread throughout markets.",
            "date": "2025-04-08T15:01:08Z",
            "sentiment-score": -0.9439758956432343
        },
        {
            "id": "7da8a01d-fad2-32fd-882c-1c7d3318df35",
            "summary": "Advanced Micro (AMD) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
            "date": "2025-04-08T13:00:11Z",
            "sentiment-score": 0.01741153746843338
        },
        {
            "id": "6bc90c4b-d3c0-3e1c-a612-2ab8136478e2",
            "summary": "Advanced Micro Devices (AMD) is facing concerns over the sustainability of its China artificial inte",
            "date": "2025-04-08T15:09:27Z",
            "sentiment-score": -0.8696793001145124
        },
        {
            "id": "528648df-73c9-3624-bf89-a42b5ef83245",
            "summary": "Despite opening the day solidly in the green, Advanced Micro Devices (NASDAQ: AMD) stock is now moving lower in Tuesday's trading.  In addition to fading recovery momentum, AMD stock is getting dragged lower by an analyst rating downgrade.",
            "date": "2025-04-08T17:55:55Z",
            "sentiment-score": -0.9566718246787786
        },
        {
            "id": "a1dc4441-e837-3e78-9d7d-262de6f777d3",
            "summary": "Semiconductor stocks face diverging paths as AI, tariffs, and China shape short-term risks and opportunities",
            "date": "2025-04-08T18:43:30Z",
            "sentiment-score": -0.8781515061855316
        },
        {
            "id": "1bfd73b6-bde4-3e87-80ce-3da7710533a3",
            "summary": "Tech stocks were lower late Tuesday afternoon, with the Technology Select Sector SPDR Fund (XLK) fal",
            "date": "2025-04-08T19:56:43Z",
            "sentiment-score": -0.9528943160548806
        },
        {
            "id": "11698a51-725b-4821-a4b0-4a131cc5bafe",
            "summary": "The latest investor updates on stocks that are trending on Wednesday.",
            "date": "2025-04-09T09:32:54Z",
            "sentiment-score": -0.023303923197090626
        },
        {
            "id": "24fd0879-2406-35f7-8780-40c845c906ba",
            "summary": "Nvidia has been an incredible growth stock, and it's been a bit of an anomaly -- no other stock within the index has come close to generating the same types of returns over the past decade.  Below, I'll look at who is in the second spot, and how close its returns are to Nvidia's.  The second-best-performing stock on the S&P 500 over the past decade is none other than Nvidia's rival Advanced Micro Devices (NASDAQ: AMD), more commonly referred to as AMD.",
            "date": "2025-04-09T09:25:00Z",
            "sentiment-score": 0.07315155118703842
        },
        {
            "id": "594a6375-5af9-3f8e-a1c2-b504c8b50221",
            "summary": "Nvidia has emerged as one of the most valuable companies in the world thanks to the AI movement, but the company's long-term growth looks questionable.",
            "date": "2025-04-09T01:00:00Z",
            "sentiment-score": 0.36346644535660744
        },
        {
            "id": "d8d8a4ac-f969-3810-ac4c-7197a2af8828",
            "summary": "LPL Financial Holdings Inc. has appointed Vaughn Harvey as the executive vice president and chief data and artificial intelligence (AI) officer, marking a significant move in its AI strategy. With over 25 years of experience in AI-driven digital transformations, Harvey will spearhead LPL’s data and AI initiatives, enhancing digital transformation across the organization. This appointment comes as LPL Financial aims to advance its offerings in artificial intelligence through programs like AI...",
            "date": "2025-04-09T11:38:02Z",
            "sentiment-score": 0.23279514256864786
        },
        {
            "id": "9eeeb70a-4a36-3460-aa56-174cd3b4e291",
            "summary": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today’s research calls that investors need to know, as compiled by The Fly. Top 5 Upgrades: Melius Research upgraded Dollar General (DG) to Buy from Hold with a $110 price target. While the company had its own “self-inflicted” challenges and competitive challenges over the last 12 months, the firm believes it likely will benefit from a worsening macro environment and a lack of tariff exposure",
            "date": "2025-04-09T13:35:20Z",
            "sentiment-score": 0.8677340056747198
        },
        {
            "id": "d511be81-e5bb-36d0-a2a2-0683bd1427de",
            "summary": "(Bloomberg) -- Short sellers, or traders who wager on share price declines, are up $159 billion in paper profits over just six trading days after an escalating trade war sent the US stock market plummeting down more than 10%. The biggest market drawdown since 2022 on President Donald Trump’s pronouncement of sweeping worldwide tariffs made bets against an exchange traded fund tracking the S&P 500 Index, known as SPY, the most profitable short bet in that timeframe, according to data from S3 Part",
            "date": "2025-04-09T13:11:31Z",
            "sentiment-score": -0.8850987674668431
        },
        {
            "id": "38332cb6-375c-3d3f-866e-110979b991dc",
            "summary": "Wall Street is overwhelmingly bullish on the stocks in this article, with price targets suggesting significant upside potential. However, it’s worth remembering that analysts rarely issue sell ratings, partly because their firms often seek other business from the same companies they cover.",
            "date": "2025-04-09T13:03:04Z",
            "sentiment-score": 0.023989226669073105
        },
        {
            "id": "25f664d0-33d6-38be-a87e-e6fb4f506fb3",
            "summary": "Brad Smith takes a closer look at the top stories as part of today's Market Minute. Trump Media & Technology Group (DJT) stock gains as US President Trump tells markets to \"be cool,\" saying it's \"a great time to buy.\" Advanced Micro Devices (AMD) gains amid a broader tech rally despite TD Cowen analysts cutting the company's price target to $100 from $135. Bernstein analysts downgrade Ford (F) to Sell from Hold, citing the impact of tariffs. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-09T16:25:19Z",
            "sentiment-score": -0.4509441778063774
        },
        {
            "id": "80340c6b-720d-3b9f-a08c-ff5198febb77",
            "summary": "We recently published a list of the 13 NASDAQ Stocks with the Highest Upside Potential. In this article, we are going to take a look at where Advanced Micro Devices Inc. (NASDAQ:AMD) stands against other NASDAQ stocks with high upside potential. On April 7, Dan Ives of Wedbush Securities joined CNBC’s ‘Squawk on the Street’ […]",
            "date": "2025-04-12T12:36:39Z",
            "sentiment-score": 0.016380677931010723
        },
        {
            "id": "b502e2ba-615e-3f24-a436-b7d998599e13",
            "summary": "Advanced Micro Devices (AMD) is knocking on Nvidia’s (NVDA) door. Last week, the plucky semiconductor challenger announced the completion of its $4.9 billion acquisition of ZT Systems for its expertise in systems and rack-level design. The goal is to accelerate the design and deployment of AMD-powered AI infrastructure. This market is currently dominated by NVIDIA and is expected to exceed $1 trillion within a few years. While the acquisition leverages the existing strengths of AMD and represent",
            "date": "2025-04-12T12:02:11Z",
            "sentiment-score": 0.4512791968882084
        },
        {
            "id": "9d30078d-d806-3594-b42e-3ea2e8fd235f",
            "summary": "Palantir Technologies (NASDAQ: PLTR) stock has returned 910% since the inception of the artificial intelligence boom in late 2022, and the company is currently worth $200 billion.  Aaron Rakers at Wells Fargo recently maintained his AMD forecast at $140 per share.  It also implies a market value of $227 billion.",
            "date": "2025-04-12T07:01:00Z",
            "sentiment-score": 0.5351928416639566
        },
        {
            "id": "7b82f1ff-5474-3908-8d04-64d3ddc25d0f",
            "summary": "AMD and Google Cloud Join Forces on High-Performance VMs",
            "date": "2025-04-11T18:14:12Z",
            "sentiment-score": 0.621498255059123
        },
        {
            "id": "bc3080d9-e21a-3a9d-aa97-b6cbd2b71615",
            "summary": "We recently published a list of Top 10 Stocks in Ken Griffin’s Portfolio to Buy According to Analysts. In this article, we are going to take a look at where Advanced Micro Devices Inc. (NASDAQ:AMD) stands against other top stocks in Ken Griffin’s portfolio to buy according to analysts. Ken Griffin is one billionaire investor […]",
            "date": "2025-04-11T16:21:35Z",
            "sentiment-score": 0.008138302713632584
        },
        {
            "id": "f0fd0ab9-4759-394e-b77b-ffc87b545907",
            "summary": "AMD has introduced the 5th Gen AMD EPYC processors, which are now powering Google Cloud's new C4D and H4D virtual machines (VMs). These VMs offer significant enhancements in performance, scalability, and efficiency, specifically tailored for demanding cloud workloads including AI and high-performance computing (HPC). The C4D instances, fueled by AMD's \"Zen 5\" architecture, show up to 80% higher throughput per vCPU, catering to general-purpose and AI inferencing tasks, while the H4D instances...",
            "date": "2025-04-11T11:37:37Z",
            "sentiment-score": 0.8210128284990788
        },
        {
            "id": "f26fc7ef-a3ee-31be-93bd-7e468137473e",
            "summary": "NVIDIA, Palantir Technologies, Advanced Micro Devices, Microsoft and Amazon.com are included in this Analyst Blog.",
            "date": "2025-04-11T10:44:00Z",
            "sentiment-score": -0.001529434695839882
        },
        {
            "id": "dfec68c3-b4bc-3f27-8c92-09c6f1cf6530",
            "summary": "The chipmaking giant has a new CEO, but it still faces existential challenges.",
            "date": "2025-04-11T08:14:00Z",
            "sentiment-score": -0.7460732385516167
        },
        {
            "id": "418de7f6-2355-3680-ad2b-bcb065ef9093",
            "summary": "The stock market is off to a rough start to 2025.  It's never fun to see the value of your portfolio dwindle, and there's never any certainty about when a period of market volatility will end.  Buying top AI stocks at their now-lower prices could be the smartest move you make this year.",
            "date": "2025-04-11T08:08:00Z",
            "sentiment-score": -0.11729130521416664
        },
        {
            "id": "a75a6e2e-6cb2-3100-9522-56f83da688ff",
            "summary": "We recently published a list of Top 12 Tech Stocks to Buy According to Billionaire Ken Fisher. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against other top tech stocks to buy according to Billionaire Ken Fisher. Under the umbrella of Fisher Asset Management, Billionaire […]",
            "date": "2025-04-10T21:45:19Z",
            "sentiment-score": 0.01800470892339945
        }
    ]
}