{
    "ticker": "AMZN",
    "total_news": 86,
    "average_sentiment": -0.20323963585677882,
    "weighted_average_sentiment": -0.16385693002305227,
    "average_daily_sentiments": [
        -0.12876428147921196,
        0.6124281762167811,
        0,
        -0.31258068019119295,
        -0.2505818950677557,
        -0.08068314982721439,
        -0.2600580216385424
    ],
    "news": [
        {
            "id": "db861d86-c4bf-3aa8-81ea-ebd3cb1d7b28",
            "summary": "Robust fundamentals and AWS growth set the stage for long-term upside",
            "date": "2025-04-06T10:50:49Z",
            "sentiment-score": 0.8298536818474531
        },
        {
            "id": "f03a4ecc-72b0-3cf5-919f-ecf3ef8ff1c6",
            "summary": "Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week.",
            "date": "2025-04-06T10:30:06Z",
            "sentiment-score": -0.013598552905023098
        },
        {
            "id": "474116d6-1404-3cf8-91ce-fc93c1c0448e",
            "summary": "Most people don't think of these companies as AI businesses, but when you dig deeper, few companies stand to benefit as much from the AI revolution as these two Buffett stocks.  Few companies are as directly exposed to rising demand for AI than Amazon (NASDAQ: AMZN).  To understand why this is, zoom out and look at how the AI industry functions.",
            "date": "2025-04-06T10:25:00Z",
            "sentiment-score": 0.015640107914805412
        },
        {
            "id": "44cd9282-3f0a-37f2-aff1-c5c37f68f775",
            "summary": "Amazon and Costco could still beat the market over the next two decades.",
            "date": "2025-04-06T09:25:00Z",
            "sentiment-score": 0.7810969608835876
        },
        {
            "id": "b24842dd-be18-3a4e-8878-cf154e864d0a",
            "summary": "The markets were already on edge with concerns regarding tariffs, and President Donald Trump's \"Liberation Day\" tariff announcement sent them over the edge.  While there could be some continued market pain, the sell-off has also brought some top growth stocks down to attractive levels.  One growth stock now down 25% to start buying right now is Amazon (NASDAQ: AMZN).",
            "date": "2025-04-06T08:19:00Z",
            "sentiment-score": -0.9527965737506747
        },
        {
            "id": "0b48cb58-f3be-3ed6-b7e2-bad8bdbe9fcf",
            "summary": "Stocks plunged on Thursday in response to President Donald Trump's \"reciprocal tariffs.\"  While the president had telegraphed his desire for punitive tariffs to try to balance the trade deficit the U.S. has with much of the world, investors were taken aback by their size.  China has long served as a scapegoat for Trump so perhaps it's not a surprise that goods imported from China will now face a 54% tariff, which includes a 20% rate the president imposed earlier.",
            "date": "2025-04-05T22:51:00Z",
            "sentiment-score": -0.9037384567782283
        },
        {
            "id": "060632b2-3236-3c79-a547-55d6f37f04f8",
            "summary": "The recent market sell-off has opened the door for some good buying opportunities in growth stocks.  Down just over 20% from its highs, Amazon (NASDAQ: AMZN) is trading at one of its lowest valuations in its history with a trailing price-to-earnings ratio (P/E) of around 34.  The company's cloud computing business, Amazon Web Services (AWS), has been its biggest growth driver, as the company helps customers create and deploy their own artificial intelligence (AI) models and apps on its platform through the help of its Bedrock and SageMaker services.",
            "date": "2025-04-05T22:14:00Z",
            "sentiment-score": -0.6977205984294415
        },
        {
            "id": "84205b4e-13e8-3e63-9c5a-5121379e3472",
            "summary": "Warren Buffett has built a fortune for Berkshire Hathaway shareholders.  Buffett's success at buying stocks of great businesses and holding them for the long term has inspired many investors to follow his style.  Berkshire held a stock portfolio worth $271 billion at the end of 2024.",
            "date": "2025-04-05T22:03:00Z",
            "sentiment-score": 0.06053810706362128
        },
        {
            "id": "67128573-4a47-3672-a647-d96d0c9139f3",
            "summary": "Following President Donald Trump's \"Liberation Day\" tariff announcement, stocks plummeted as fears escalated regarding a potential global trade war and how it could impact the global economy.  While there certainly could be more pressure on stocks in the coming weeks depending on how this all plays out, it also has created some solid entry points for several top tech stocks where investors can start to at least dip their toes into the stocks.  Let's look at three bargain tech stocks investors can consider buying now.",
            "date": "2025-04-06T14:15:00Z",
            "sentiment-score": 0.11708620563149452
        },
        {
            "id": "51dec9ad-1fda-30e7-bb95-d2a9ed173118",
            "summary": "Amazon.com (NasdaqGS:AMZN) saw a significant share price decline of 11% over the past week, amidst a turbulent market roiled by intensified tariff concerns initiated by President Trump's recent announcements. Despite Amazon's bid to acquire TikTok grabbing headlines, market dynamics were largely overshadowed by broader economic fears as the Nasdaq entered bear market territory. The market plunged by 9.4% with tariffs contributing substantially to investors' unease, affecting various sectors...",
            "date": "2025-04-06T17:15:59Z",
            "sentiment-score": -0.9506238275207579
        },
        {
            "id": "48083cd1-adf0-35b7-b204-8522863eabfe",
            "summary": "President Donald Trump's trade wars are creating significant uncertainty, while many fear that a recession might be coming -- something else that could send the stock market in the wrong direction.  The Nasdaq Composite and S&P 500 have both recently hit correction territory -- defined as a 10% drop from their most recent highs.  Predicting these things is hard, but a bear market is a real possibility.",
            "date": "2025-04-06T19:15:00Z",
            "sentiment-score": -0.9493129979819059
        },
        {
            "id": "271ab754-5aaf-3c9f-bd1b-8332e8b81dce",
            "summary": "This past week, President Donald Trump announced his full plan for tariffs on imports -- a list of duties varying by country that could make a wide range of goods pricier for U.S. companies and consumers.  The concern for investors is that these higher prices will weigh on corporate earnings in two ways.  First, higher prices will hurt consumers' buying power, leaving them with less to spend on discretionary items.",
            "date": "2025-04-06T21:15:00Z",
            "sentiment-score": -0.9057961963117123
        },
        {
            "id": "36e4b58b-1540-3185-bd15-80246e6bab5d",
            "summary": "Growth-driven exchange-traded funds (ETFs) -- like the Vanguard Growth ETF (NYSEMKT: VUG) -- have significantly outperformed the S&P 500.  With just a 0.04% expense ratio, the Vanguard Growth ETF is a great way to achieve exposure without racking up high fees.  The Vanguard Growth ETF made an all-time high in December and nearly broke through to a new high in February.",
            "date": "2025-04-07T12:30:00Z",
            "sentiment-score": 0.8830670528113842
        },
        {
            "id": "f37cb019-8d31-3cae-a73f-1cd0ef4aa1b0",
            "summary": "The iconic growth investor made some interesting moves during Friday's market pullback.",
            "date": "2025-04-07T11:30:00Z",
            "sentiment-score": 0.5003594290465117
        },
        {
            "id": "34e9a6c4-79f2-3066-9a00-88981d7cb99a",
            "summary": "Amazon (NASDAQ: AMZN) hasn't been immune to the marketwide sell-off seen lately.  To add another layer of complexity, Amazon management also launched a bid to buy TikTok from ByteDance.  There are lots of moving pieces with Amazon stock, making it an incredibly complex investment.",
            "date": "2025-04-07T10:30:00Z",
            "sentiment-score": -0.009365681558847427
        },
        {
            "id": "e2c6e143-427e-3ba3-b56d-5c01bae545db",
            "summary": "(Bloomberg) -- The carnage in financial markets worsened on Monday with stressed-out investors abandoning hopes that President Donald Trump would change his tariff policy.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsWhat Would ‘Transportation Abundance’ Look Like?Stocks tumbled, t",
            "date": "2025-04-07T10:10:44Z",
            "sentiment-score": -0.6143666282296181
        },
        {
            "id": "5645002f-bef1-4478-9988-95fd21ef3b2d",
            "summary": "A 360-degree turnaround is rapidly consigning work from home culture to the past as sticks replace carrots to herd workers back into offices",
            "date": "2025-04-07T05:00:17Z",
            "sentiment-score": 0.06678773183375597
        },
        {
            "id": "7368c7f4-382f-3698-aba8-6872427c8b53",
            "summary": "Wood said Trump’s tariff \"doesn't make sense.\"",
            "date": "2025-04-06T23:54:21Z",
            "sentiment-score": -0.5721290241926908
        },
        {
            "id": "528b2673-ea25-431e-a234-6fc71598aa09",
            "summary": "The Magnificent 7 tech stocks continued their sell off Monday as the Trump administration’s global tariff plan rocked markets.",
            "date": "2025-04-07T13:39:20Z",
            "sentiment-score": -0.8942932719364762
        },
        {
            "id": "9d6ecca8-6f75-4702-a975-b7076f03fa32",
            "summary": "The markets are undergoing one of the worst stretches in recent memory as Trump tariff fears take hold. Here is what is top of mind with the Yahoo Finance community.",
            "date": "2025-04-07T12:54:01Z",
            "sentiment-score": -0.13367204554378986
        },
        {
            "id": "44af9acf-9f03-386a-95ad-dc116a6045b7",
            "summary": "Amazon has restructured its air network to accommodate the need for fewer short-haul package flights and a new clientele of shippers with heavy freight. The post Amazon airline prioritizes bigger aircraft to handle third-party cargo appeared first on FreightWaves.",
            "date": "2025-04-07T13:00:00Z",
            "sentiment-score": 0.40911852568387985
        },
        {
            "id": "829f6128-de4b-3026-9d20-28fc8d035ac4",
            "summary": "Buy for Me can purchase eligible products from third-party sites without customers leaving the Amazon Shopping app.",
            "date": "2025-04-07T10:35:00Z",
            "sentiment-score": 0.00943190511316061
        },
        {
            "id": "0ce11993-edf6-349c-9a5e-6e1510602c2a",
            "summary": "Meat department sales hit record highs in 2024, but there’s room for more innovation and personalized messaging from grocers to continue motivating shoppers, according to a report from FMI.",
            "date": "2025-04-07T10:00:22Z",
            "sentiment-score": 0.8895331425592303
        },
        {
            "id": "1937f0ab-0762-3733-877e-4fd0ba7e4daf",
            "summary": "President Donald Trump announced a new batch of tariffs on April 2, and let's just say investors haven't been jumping with joy since then.  Tech stocks experienced some of the harshest drops.  One tech stock that has been hit fairly hard because of the new tariffs is Amazon (NASDAQ: AMZN).",
            "date": "2025-04-07T16:00:00Z",
            "sentiment-score": -0.8362429961562157
        },
        {
            "id": "359d8ff9-7dea-3eae-8f73-6e61ca3f025a",
            "summary": "We recently published a list of Tariff Hits and More: 10 AI Stocks in the Spotlight. In this article, we are going to take a look at where Amazon.com Inc. (NASDAQ:AMZN) stands against other AI stocks in the spotlight. The newly announced tariffs by U.S. President Donald Trump could have serious consequences for many stocks. […]",
            "date": "2025-04-07T18:22:58Z",
            "sentiment-score": -0.3711920902132988
        },
        {
            "id": "77f458fd-a0cd-3600-8314-309e63e9ac92",
            "summary": "Amazon.com’s shares rose about 3% Monday, outperforming the Nasdaq Composite index and reversing a rout late last week as investors feared consumers would reduce online spending.  Investment bank Oppenheimer & Co estimated Amazon’s revenue could decline by about 8% due to tariffs, as opposed to 16% for Meta Platforms and 15% for Google.  American shopping habits have increasingly tilted toward online shopping, and e-commerce has grown more entrenched.",
            "date": "2025-04-07T18:18:44Z",
            "sentiment-score": -0.9480460211634636
        },
        {
            "id": "039ecda3-4fef-43c7-82a1-91e57d6642a4",
            "summary": "Trump's tariffs have sent shockwaves through markets amid one of the largest three-day crashes since World War II.",
            "date": "2025-04-08T08:00:53Z",
            "sentiment-score": -0.8629733622074127
        },
        {
            "id": "2fa495b0-f9da-3501-8a79-1b1fd3324212",
            "summary": "Cathie Wood is still pushing millions of dollars into the stock market despite trading volatility brought on by the Trump tariffs.",
            "date": "2025-04-08T13:47:50Z",
            "sentiment-score": 0.14692117366939783
        },
        {
            "id": "0efd8c19-0a8c-3538-b673-edfe1e10ef11",
            "summary": "Due to his success -- both personally and through his company, Berkshire Hathaway -- Warren Buffett draws a lot of attention when he speaks and makes investing moves.  With Buffett's net worth of over $150 billion and Berkshire Hathaway's market cap of over $1 trillion (as of April 7), it's easy to see why.  People often look to Berkshire Hathaway's stock portfolio to get inspiration for investments they may want to consider, especially during turbulent market times like we're witnessing now.",
            "date": "2025-04-08T11:38:00Z",
            "sentiment-score": 0.012662852182984352
        },
        {
            "id": "28863af7-adf2-345b-8b0d-727e8acfe999",
            "summary": "Last week, Donald Trump announced \"reciprocal\" tariffs that have caused significant turbulence in global markets, with the stock prices of major U.S. tech companies, known as the “Magnificent 7,” plummeting and wiping out nearly $1.8 trillion in ...",
            "date": "2025-04-08T10:45:18Z",
            "sentiment-score": -0.9105431251227856
        },
        {
            "id": "cd55a526-621f-318d-8284-54e2bb9de172",
            "summary": "The next breakthrough technology to follow artificial intelligence (AI) could be quantum computing.  In February, Amazon joined other big tech firms, such as Google parent Alphabet, in touting investments in the field.  Now may be a good time to invest in one of this nascent industry's hot stocks, IonQ (NYSE: IONQ).",
            "date": "2025-04-08T10:30:00Z",
            "sentiment-score": 0.1717611225321889
        },
        {
            "id": "d04c8aa2-b455-3e19-bfa9-c625fc917b3e",
            "summary": "To say that the stock market has been volatile lately doesn't do the situation justice.  The S&P 500 (SNPINDEX: ^GSPC) and several other major market indexes recently fell by more than 10% over a two-day period in response to President Trump's surprisingly high tariff rates.  The S&P 500 is now 18% below its February high, and with a 23% drop, the Nasdaq Composite (NASDAQINDEX: ^IXIC) is now firmly in bear market territory.",
            "date": "2025-04-08T09:41:00Z",
            "sentiment-score": -0.9554864298552275
        },
        {
            "id": "3e96208b-fc13-3029-aff3-d06f2607e93b",
            "summary": "Amazon recently closed its TikTok Shop clone. Buying TikTok would give the company’s social-commerce business a shot in the arm.",
            "date": "2025-04-08T07:00:00Z",
            "sentiment-score": 0.06744823418557644
        },
        {
            "id": "4e533441-f9b9-47ea-bf80-e22da3646462",
            "summary": "Output per worker fell by 0.5% between 2019 and 2024, according to the Resolution Foundation.",
            "date": "2025-04-08T05:00:15Z",
            "sentiment-score": -0.9579885229468346
        },
        {
            "id": "adabd60d-de04-4899-9bc1-1b19f5fa9686",
            "summary": "March was another month marked by volatility, as US president Donald Trump pressed ahead with his tariff agenda.",
            "date": "2025-04-08T05:00:09Z",
            "sentiment-score": -0.3880235254764557
        },
        {
            "id": "a705c1a6-3948-337d-bad7-802c1b12ca5c",
            "summary": "We recently published a list of 10 Best Fundamental Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Amazon.com, Inc. (NASDAQ:AMZN) stands against other best fundamental stocks to buy according to billionaires. As per Fitch Ratings, the US tariffs are now at levels that continue to […]",
            "date": "2025-04-08T02:36:13Z",
            "sentiment-score": 0.06572685576975346
        },
        {
            "id": "1a804fb4-262a-300a-8843-da5ccb008bf7",
            "summary": "The futures of Amazon (AMZN) and Tesla (TSLA) are “incredibly bright,” Dan Crowley, the Portfolio Manager of Nightview Capital told Schwab Network recently. Crowley also believes that “opportunities are developing” for investors to buy top-notch companies. He suggested that the Trump administration will have to meaningfully reduce tariffs once consumers begin paying higher prices as […]",
            "date": "2025-04-08T14:08:42Z",
            "sentiment-score": 0.8180424012243748
        },
        {
            "id": "3f822b44-2071-3a20-a488-37b728a5016f",
            "summary": "Prominent investor Josh Brown, the co-founder of Ritholtz Wealth Management, recently told CNBC why he decided to add to his positions in Amazon (AMZN) and Uber (UBER). Brown also explained his rationale for buying shares of mortgage provider Rocket Companies (RKT) for the first time. Why Brown Added to His AMZN, UBER Holdings Describing both […]",
            "date": "2025-04-08T15:48:11Z",
            "sentiment-score": 0.0413392367772758
        },
        {
            "id": "5eeaf32c-1adf-40bd-a5ca-31d24b0b82cd",
            "summary": "Nvidia and its \"Magnificent Seven\" peers had shed $1.8 trillion in value last week",
            "date": "2025-04-08T12:54:02Z",
            "sentiment-score": -0.9507620232179761
        },
        {
            "id": "feffc5e3-273a-39cd-823a-92f13fb55327",
            "summary": "JPMorgan slashed its price targets on 25 companies in the internet space, citing macroeconomic issues, Schwab Network recently reported. Among the most prominent names whose price targets were slashed by the bank are Meta (META), Amazon (AMZN), Alphabet (GOOG), and Netflix (NFLX). Some of the Highest-Profile Target Cuts The bank reduced its price target on […]",
            "date": "2025-04-08T16:30:10Z",
            "sentiment-score": -0.9281390681862831
        },
        {
            "id": "83a02036-0abb-3c72-b4e3-41e5c7dbfef9",
            "summary": "IBM's stock defied market trends with a 13% gain in Q1 2025. Here's how Big Blue pulled off this impressive feat while the S&P 500 struggled.",
            "date": "2025-04-08T17:31:56Z",
            "sentiment-score": 0.2530146539211273
        },
        {
            "id": "1b570e8c-73b5-3834-8543-ae33296257a2",
            "summary": "The market is wobbling again, and the Magnificent Seven tech stocks are being swept along.    In recent trading, the stocks varied from a 1.3% loss for Apple to a near-2% gain for Nvidia.   The septet had added nearly $500 billion in market cap, according to Dow Jones Market Data, only for a large chunk of those gains to evaporate.",
            "date": "2025-04-08T16:27:16Z",
            "sentiment-score": -0.9164056982845068
        },
        {
            "id": "0d170e44-211e-3574-9ade-21270262e2bd",
            "summary": "JPMorgan cut its price targets for Amazon stock and Meta Tuesday along with a list of internet stocks, citing recession risk.",
            "date": "2025-04-08T18:08:24Z",
            "sentiment-score": -0.9294581776484847
        },
        {
            "id": "99b0821d-d9d3-3207-910c-6adb28be25c6",
            "summary": "We recently published a list of 13 Best Big Data Stocks to Buy According to Analysts. In this article, we are going to take a look at where Amazon.com, Inc. (NASDAQ:AMZN) stands against other best big data stocks to buy according to analysts. The big data companies focus on collecting, storing, and analyzing huge amounts […]",
            "date": "2025-04-08T18:05:52Z",
            "sentiment-score": 0.005678920075297356
        },
        {
            "id": "5c711514-78a6-327a-8b93-1f0cf9d305d0",
            "summary": "BABA outshines AMZN with stronger growth, lower valuation and massive AI investments. BABA's 45.2% stock surge signals superior upside in the e-commerce race.",
            "date": "2025-04-08T19:00:00Z",
            "sentiment-score": 0.8896191781386733
        },
        {
            "id": "1e6e0fca-e6c3-3dca-ace1-b013c80305a5",
            "summary": "We recently published a list of 10 Best Stocks to Buy According to Billionaire Steve Cohen. In this article, we are going to take a look at where Amazon.com, Inc. (NASDAQ:AMZN) stands against other best stocks to buy according to billionaire Steve Cohen. Steve Cohen, a prominent figure in the world of hedge funds, is […]",
            "date": "2025-04-08T22:11:46Z",
            "sentiment-score": 0.017960323952138424
        },
        {
            "id": "3872870d-cfed-3a0b-9618-bb7bcd72df50",
            "summary": "Tariffs are once again flooding the headlines. They're in your newsfeed, your inbox, and probably your group chat. The Trump administration's sweeping new import taxes—set to hit everything from electronics to apparel—are back in the spotlight, and of course, billionaire entrepreneur Mark Cuban has thoughts. Spoiler: he's not shy about sharing them. \"If these tariffs stick, it's going to be ugly for Amazon, but incredible for all the American sellers,\" Cuban posted on Bluesky. That post lit a fu",
            "date": "2025-04-08T22:30:38Z",
            "sentiment-score": 0.04738518409430981
        },
        {
            "id": "6605e722-5597-3a31-a906-6fcb8f125add",
            "summary": "A small collective of unlikely candidates is emerging as the most popular opportunities in the quantum computing industry.",
            "date": "2025-04-09T10:45:00Z",
            "sentiment-score": 0.060491140466183424
        },
        {
            "id": "cefac904-e3bc-35d3-9581-d0d6fc0ac388",
            "summary": "Real estate investment trusts, or REITs, aren't well known for their volatility, and as a group, they tend to be more resilient than the typical S&P 500 company during tough times.  The S&P 500 is down by roughly 12% as of this writing, since President Trump's tariff plan was announced, but the real estate sector is down by less than 10%.  Industrial real estate giant Prologis (NYSE: PLD) has fallen by 17% since the tariffs were announced, and although there are certainly some valid concerns, the fact remains that this is a rock-solid REIT with a bright future, currently trading at a discount.",
            "date": "2025-04-09T10:32:00Z",
            "sentiment-score": -0.9441448980942369
        },
        {
            "id": "2c626bc3-27d3-4133-9b14-718a74840084",
            "summary": "Discover the best credit cards to save money, earn rewards and travel smarter.",
            "date": "2025-04-09T10:14:28Z",
            "sentiment-score": 0.09530814550817013
        },
        {
            "id": "1e102a2b-4c14-3453-bcf4-5b9dddb1557c",
            "summary": "Now is not the time to panic. Now is the time to make rational decisions for your stock portfolio.",
            "date": "2025-04-09T09:40:00Z",
            "sentiment-score": -0.004362383857369423
        },
        {
            "id": "24eb806e-1e5d-3b58-917b-390720595b5d",
            "summary": "The big-tech companies have largely bankrolled AI’s growth, after all:  Microsoft Meta Alphabet  and  Amazon.com  together plan more than $270 billion of capital spending on data centers this year, according to a Citigroup estimate.  Before the past few days, this had lifted Nvidia’s shares to unprecedented heights; it was briefly the largest listed company in the world.  Sustaining the boom hinges on the tech companies’ willingness to stick with current and future spending against a backdrop where recession appears increasingly likely.",
            "date": "2025-04-09T09:30:00Z",
            "sentiment-score": 0.8819751720875502
        },
        {
            "id": "1363f6ed-ff6a-31af-b4cb-d6e62b9d8beb",
            "summary": "While Amazon has slipped 6.8% to $172.50 per share over the past six months, it’s still beating the S&P 500 by 6.9 percentage points.",
            "date": "2025-04-09T09:10:21Z",
            "sentiment-score": -0.9145663767121732
        },
        {
            "id": "159408fc-097d-30bd-9d00-f75e2bc90b61",
            "summary": "Retail investors have a great opportunity to join the smart money right now.",
            "date": "2025-04-09T08:30:00Z",
            "sentiment-score": 0.09296447737142444
        },
        {
            "id": "9f320cc6-2968-39d5-8861-e1ede4b21b6a",
            "summary": "The giant of a company clearly can't live up to the incredibly high standard of its impressive past, but...",
            "date": "2025-04-09T08:15:00Z",
            "sentiment-score": 0.024989042431116104
        },
        {
            "id": "491cd193-7223-34f5-8785-f67b446eae4e",
            "summary": "Lakehouse Capital, a Sydney-based investment manager, released its “Lakehouse Global Growth Fund” February 2025 investor letter. A copy of the letter can be downloaded here. February was a volatile month for global equities due to the deluge of Trump headlines. However, the portfolio’s holding companies continue to press their advantages and execute on their growth […]",
            "date": "2025-04-09T11:32:36Z",
            "sentiment-score": -0.2513347417116165
        },
        {
            "id": "972eefb0-74ca-3e68-b938-741e2b68248d",
            "summary": "Cathie Wood pushed around $40 million into two Dow giants this week prior to Trump's tariffs taking effect.",
            "date": "2025-04-09T13:33:06Z",
            "sentiment-score": 0.1187355238944292
        },
        {
            "id": "d511be81-e5bb-36d0-a2a2-0683bd1427de",
            "summary": "(Bloomberg) -- Short sellers, or traders who wager on share price declines, are up $159 billion in paper profits over just six trading days after an escalating trade war sent the US stock market plummeting down more than 10%. The biggest market drawdown since 2022 on President Donald Trump’s pronouncement of sweeping worldwide tariffs made bets against an exchange traded fund tracking the S&P 500 Index, known as SPY, the most profitable short bet in that timeframe, according to data from S3 Part",
            "date": "2025-04-09T13:11:31Z",
            "sentiment-score": -0.8850987674668431
        },
        {
            "id": "233f786a-8240-3517-9fd0-55b07b395248",
            "summary": "Billionaire backers of President Donald Trump are watching their fortunes tumble as tariffs take a toll on Big Tech.",
            "date": "2025-04-09T11:00:25Z",
            "sentiment-score": -0.9189884318038821
        },
        {
            "id": "bec81bb8-71ce-3730-ad66-cba54930b681",
            "summary": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Amazon.com Inc. has canceled orders for multiple products made in China and other Asian countries, according to a document reviewed by Bloomberg and people familiar with the matter, suggesting the company is reducing its exposure to tariffs imposed by President Donald Trump.The orders for beach chairs, scooters, air conditioners and other merchandise from multiple Amazon vendors were halted after Trump’s Apr",
            "date": "2025-04-09T14:28:49Z",
            "sentiment-score": -0.9256295990198851
        },
        {
            "id": "2a74fe33-ad95-39e8-8919-9e6c117df2d4",
            "summary": "The market is suffering under the weight of President Donald Trump's tariffs on trading partners, as investors try to understand how they'll affect companies.  One growth stock that's fallen hard this year is Amazon (NASDAQ: AMZN), which is down 20% year to date, as of this writing.  Here's why I think now could be a good time to buy Amazon stock.",
            "date": "2025-04-09T14:11:00Z",
            "sentiment-score": -0.9281388176605105
        },
        {
            "id": "9ad28c7c-d248-3837-8762-91bb473da674",
            "summary": "The company is asking potential capital partners to submit proposals, according to the report, which said the facilities are expected to be mostly delivery hubs, but some of the properties would also include large fulfillment centers packed with robots.  Amazon did not immediately respond to a Reuters request for comment.  The e-commerce company's request for information from financing partners predated U.S. President Donald Trump's tariff announcement from last week, Bloomberg said, adding it was unclear how the shift in trade policy would impact Amazon's plans.",
            "date": "2025-04-09T14:09:15Z",
            "sentiment-score": -0.02305765450000763
        },
        {
            "id": "2d59de91-e1e7-3c60-8a4a-62632898045f",
            "summary": "ARK Invest Takes Bold Position in NVIDIA, Cuts Exposure to UiPath",
            "date": "2025-04-09T15:07:17Z",
            "sentiment-score": 0.35839705169200897
        },
        {
            "id": "d90d33ef-1725-3606-8964-3607cb59d917",
            "summary": "A quiet move after Trump's tariff bombshell is exposing Amazon's suppliers--and investors--to a whole new level of risk.",
            "date": "2025-04-09T17:48:54Z",
            "sentiment-score": -0.11431080102920532
        },
        {
            "id": "27a5f2f1-7e6c-30d1-a171-88a12d81ee05",
            "summary": "Amazon.com (NasdaqGS:AMZN) unveiled its innovative Nova Sonic AI model designed to improve AI-driven conversations, which combines speech understanding and generation. Despite these advancements, the company's shares declined 11% last week, even as broader market turmoil unfolded with a 12% drop in the S&P 500 following the implementation of new tariffs by the U.S. and retaliatory measures from China. While technology stocks, including Apple and Tesla, rallied in volatile trading, Amazon's...",
            "date": "2025-04-09T17:42:06Z",
            "sentiment-score": -0.9454574473202229
        },
        {
            "id": "c9b1a0e4-249c-3ae6-8877-242500d75b1b",
            "summary": "Amazon.com  e-commerce business faces the danger that consumers could pull back as tariffs hit the economy, but its cloud business may be hit as well, some analysts say.  Amazon Web Services is a closely watched segment of the company due to its growth.  Fourth-quarter revenue at AWS increased 19% from the previous year to $28.8 billion, while sales at the online store increased 7% to $75.6 billion.",
            "date": "2025-04-09T17:36:00Z",
            "sentiment-score": 0.9166837073862553
        },
        {
            "id": "0b5cbc24-d166-3fba-ae03-c01c702ebc9f",
            "summary": "Amazon Halts Chinese Inventory Orders, Sets Sights on $15B U.S. Facilities",
            "date": "2025-04-09T17:27:32Z",
            "sentiment-score": -0.11545000970363617
        },
        {
            "id": "b25c4bf4-adb6-3bef-bb60-c1dccc124bea",
            "summary": "Amazon (AMZN) is canceling some wholesale orders from Asia that it directly imports and ships to its warehouses as it begins to respond to President Donald Trump’s trade war, according to a new report.",
            "date": "2025-04-09T17:11:00Z",
            "sentiment-score": -0.9454187569208443
        },
        {
            "id": "8ef18045-1f98-3286-874e-7c996f9a3bbd",
            "summary": "Two major banks recently slashed their price targets on Amazon (AMZN) stock, but both banks remain bullish on the tech giant’s overall outlook, Schwab Network reported. Mizuho’s Take on AMZN Stock The Japanese bank lowered its price target on AMZN to $255 from $285 but kept an Outperform rating on the shares. About 50% of […]",
            "date": "2025-04-09T15:43:28Z",
            "sentiment-score": -0.8940702453255653
        },
        {
            "id": "fc1365ee-9192-31e0-b41d-c97ee786ba47",
            "summary": "The three major US stock indexes were mixed in late-morning trading Wednesday following recent annou",
            "date": "2025-04-09T15:42:54Z",
            "sentiment-score": -0.9288709741085768
        },
        {
            "id": "7e2c62a6-4998-3ef8-815e-702b5f7f77d3",
            "summary": "Markets (^GSPC,&nbsp;^IXIC,&nbsp;^DJI) are shifting as investors look beyond the once-dominant \"Magnificent Seven\" and focus on international equities gaining traction. Horizon Investments head of research and quantitative strategies Mike Dickson joins Market Domination to discuss why global diversification may be the new core strategy as capital moves away from US assets. To watch more expert insights and analysis on the latest market action, check out more Market Domination&nbsp;here.",
            "date": "2025-04-12T12:00:05Z",
            "sentiment-score": 0.04364916542544961
        },
        {
            "id": "5930858e-8ab8-3f9c-a121-cb5215d916ba",
            "summary": "We recently published a list of 12 Best Tech Stocks to Buy For Long-Term Investment. In this article, we are going to take a look at where Amazon.com Inc. (NASDAQ:AMZN) stands against other tech stocks to buy for long-term investment. On April 1, Chris Verrone, chief market strategist at Strategas Research Partners, appeared on CNBC’s […]",
            "date": "2025-04-12T12:39:08Z",
            "sentiment-score": 0.02595455478876829
        },
        {
            "id": "1945f868-1ab4-342d-a14b-653ca6c52f79",
            "summary": "Looking to invest in the future of computing without excessive risk? These three tech powerhouses are building quantum capabilities while generating massive profits from their more well-known core businesses.",
            "date": "2025-04-12T11:49:00Z",
            "sentiment-score": 0.6152868838980794
        },
        {
            "id": "a96ad890-e7f0-3bd7-a6d0-c21e5aa7b477",
            "summary": "While President Donald Trump paused most of the tariffs that went into effect last week, tariffs on Chinese goods not only remain in place but are escalating, as I write this.  Most companies are exposed to tariffs on Chinese goods in one way or another, either because they source products and supplies from China, or because they're susceptible to weakening consumer and business spending as economic uncertainty ramps up.  Amazon (NASDAQ: AMZN) is facing multiple headwinds from the tariffs on Chinese products, and the retail and cloud giant may be more exposed than many of its peers.",
            "date": "2025-04-12T09:50:00Z",
            "sentiment-score": -0.9008795078843832
        },
        {
            "id": "484a367e-6070-325e-b98c-a1044ea811ad",
            "summary": "With the recent stock market crash, several leading artificial intelligence (AI) stocks have gone on sale.  Nvidia (NASDAQ: NVDA) is the market leader in AI chips, where its graphics processing units (GPUs) have become the main component to provide the processing power to handle AI workloads.  Nvidia has taken a more than 80% market share in the GPU space due largely to its CUDA software platform, which allows developers to easily program its chips for various AI-related tasks.",
            "date": "2025-04-12T08:25:00Z",
            "sentiment-score": 0.3005547523498535
        },
        {
            "id": "a7923819-1f6d-38fe-b838-8f7ea175c397",
            "summary": "Berkshire Hathaway can be a great source of inspiration inspiration for individual investors.  Warren Buffett, one of the most successful investors in American history, manages the vast majority of the company's $259 billion portfolio.  Among the 40 analysts that follow Apple, the median target price is $250 per share.",
            "date": "2025-04-12T08:01:00Z",
            "sentiment-score": 0.010874642990529537
        },
        {
            "id": "bb600843-8f6a-3177-a0c6-aeec1f7ec2ba",
            "summary": "MercadoLibre still offers plenty of growth at a reasonable valuation.",
            "date": "2025-04-12T07:32:00Z",
            "sentiment-score": 0.8249854957684875
        },
        {
            "id": "847c043f-813d-33ba-b53b-c7104b56a94c",
            "summary": "We recently published a list of the 13 NASDAQ Stocks with the Highest Upside Potential. In this article, we are going to take a look at where Amazon.com Inc. (NASDAQ:AMZN) stands against other NASDAQ stocks with high upside potential. On April 7, Dan Ives of Wedbush Securities joined CNBC’s ‘Squawk on the Street’ to discuss […]",
            "date": "2025-04-11T20:59:56Z",
            "sentiment-score": 0.01475464180111885
        },
        {
            "id": "cd550eab-e446-38ee-9ff2-94739410741e",
            "summary": "Anker, a China-based electronics company, has started to increase its prices on Amazon.com.  Anker is an established brand on Amazon and sells charging power banks, computer mouses and other products.  The company has raised prices on dozens of products since tariffs on imports from China were announced, according to market research firm SmartScout.",
            "date": "2025-04-11T17:55:13Z",
            "sentiment-score": 0.9046579012647271
        },
        {
            "id": "a339ed92-686e-38d8-a21e-ba6c61f68465",
            "summary": "Recently, Amazon.com (NasdaqGS:AMZN) introduced Nova Sonic, a new AI model poised to enhance the company's voice application capabilities. This development aligns with broader market trends where technology stocks saw gains. During the past week, Amazon's shares rose by 6%, contrasting with the broader market's relative stability. The rise in Amazon's stock may have been influenced by this AI advancement, in conjunction with a positive overall tech sector performance, amidst volatile market...",
            "date": "2025-04-11T17:15:26Z",
            "sentiment-score": 0.9178719855844975
        },
        {
            "id": "f82646c1-4ee6-4a32-89cc-bda23572ce50",
            "summary": "Meta is preparing for the start of a courtroom battle Monday with the US government in an antitrust case that could force Mark Zuckerberg to break up his $1.3 trillion empire and sell one of its crown jewels: Instagram.",
            "date": "2025-04-12T14:00:19Z",
            "sentiment-score": -0.6371034234762192
        },
        {
            "id": "fc19cc2b-56ab-3d63-86e5-fb50d4a44344",
            "summary": "In a rare interview with Walmart heir Steuart Walton, Yahoo Finance got an inside look at how he was chosen as one of two current family members on Walmart's (WMT) board of directors. It's an essential role to keep the family fortune close, as the Walton family holds just more than 45% of Walmart's stock. Walton chairs the Walmart board's technology and e-commerce committee as the retailer aims to take on one of its closest competitors, Amazon (AMZN). The board is also tasked with \"hiring the right people to run the company,\" which is \"probably the first priority,\" longtime retail analyst Joe Feldman of Telsey Advisory Group told Yahoo Finance, as Walmart takes on some of the biggest challenges of the times, including keeping up with artificial intelligence, dealing with the Trump administration's tariffs, and navigating nonstop culture wars. For more expert insight and the latest market action, click here.",
            "date": "2025-04-12T11:28:56Z",
            "sentiment-score": 0.05431413510814309
        },
        {
            "id": "d1d95f76-2cf4-377c-a809-c3fba2bad588",
            "summary": "In emails and WeChat messages viewed by Fortune, Chinese suppliers proposed illegal workarounds to executives from a brand with a large presence on Amazon.",
            "date": "2025-04-12T18:04:58Z",
            "sentiment-score": -0.9076956948265433
        },
        {
            "id": "9355c09f-8e79-32a2-9a00-25ab35711cf1",
            "summary": "We recently published a list of 14 AI Stocks Catching Wall Street’s Attention. In this article, we are going to take a look at where Amazon.com Inc. (NASDAQ:AMZN) stands against other AI stocks catching Wall Street’s attention. In the latest development in the feud between OpenAI and Elon Musk, the ChatGPT maker has countersued billionaire […]",
            "date": "2025-04-12T16:10:35Z",
            "sentiment-score": -0.1791562009602785
        },
        {
            "id": "0a4b6677-9c14-3075-84e7-b1b991857a9e",
            "summary": "Apple (AAPL) could be in for an even rougher ride than its Big Tech rivals.",
            "date": "2025-04-12T13:00:00Z",
            "sentiment-score": -0.9389768037945032
        },
        {
            "id": "cbb455fb-1a07-3afa-b177-4255f0a60666",
            "summary": "Starting April 8, there is a new permanent menu item on the Golden Arches menu.",
            "date": "2025-04-12T13:00:00Z",
            "sentiment-score": 0.014256341382861137
        }
    ]
}