{
    "ticker": "COST",
    "total_news": 26,
    "average_sentiment": 0.16269799164281443,
    "weighted_average_sentiment": 0.2556022456734015,
    "average_daily_sentiments": [
        0.6973676532506943,
        0.4583441228605807,
        0.2945722414712821,
        0.005933814914897084,
        -0.05214605499058962,
        0.33893482461571695,
        -0.22293132112827152
    ],
    "news": [
        {
            "id": "44cd9282-3f0a-37f2-aff1-c5c37f68f775",
            "summary": "Amazon and Costco could still beat the market over the next two decades.",
            "date": "2025-04-06T09:25:00Z",
            "sentiment-score": 0.7810969608835876
        },
        {
            "id": "c412e22f-2b7d-3af8-a3da-b315a6dbd9dd",
            "summary": "It seems no matter what time frame you use, shares of Costco Wholesale (NASDAQ: COST) outperform the broader market.  This top retail stock is now taking a breather along with the rest of the market, trading 10% below its record.  Where will Costco be in one year?",
            "date": "2025-04-06T09:04:00Z",
            "sentiment-score": -0.8641170766204596
        },
        {
            "id": "271ab754-5aaf-3c9f-bd1b-8332e8b81dce",
            "summary": "This past week, President Donald Trump announced his full plan for tariffs on imports -- a list of duties varying by country that could make a wide range of goods pricier for U.S. companies and consumers.  The concern for investors is that these higher prices will weigh on corporate earnings in two ways.  First, higher prices will hurt consumers' buying power, leaving them with less to spend on discretionary items.",
            "date": "2025-04-06T21:15:00Z",
            "sentiment-score": -0.9057961963117123
        },
        {
            "id": "0641c0b2-0294-3b5d-9f3a-20494594696a",
            "summary": "We recently published a list of 11 Best Counter Cyclical Stocks to Buy According to Analysts. In this article, we are going to take a look at where Costco Wholesale Corporation (NASDAQ:COST) stands against other best counter cyclical stocks to buy according to analysts. Counter cyclical stocks stand out because they tend to perform well […]",
            "date": "2025-04-06T21:05:19Z",
            "sentiment-score": 0.09709102753549814
        },
        {
            "id": "c435e0ef-3ba8-33f2-af48-091a0ceca64f",
            "summary": "It won’t be surprising to see some in-store shakeups.",
            "date": "2025-04-07T03:03:00Z",
            "sentiment-score": 0.10726921632885933
        },
        {
            "id": "94037514-481a-39d5-ad6c-29839e4a96e5",
            "summary": "Costco's stellar run may not be over, but investors must weigh its premium price against long-term growth potential.",
            "date": "2025-04-07T13:20:00Z",
            "sentiment-score": 0.6626311000436544
        },
        {
            "id": "85cd167e-471d-4128-81fa-4e1fb9ab5333",
            "summary": "Discount retailers are positioned to benefit as consumers remain pinched.",
            "date": "2025-04-07T17:09:56Z",
            "sentiment-score": 0.9043699130415916
        },
        {
            "id": "3df7ce1e-cc86-318b-a055-cd5fd090c6fc",
            "summary": "The White House denied reports on Monday of an alleged 90-day pause on reciprocal tariffs, which are still set to take effect Wednesday, April 9. Wedbush Securities managing director of equity research for retail hardlines Seth Basham joins Catalysts to discuss how retailers will absorb tariff-fueled price increases, noting that most retailers will be forced to pass on some of the cost to their consumers. Basham notes that retailers with more pricing power, such as auto parts retailers and mass merchants that sell consumer staples, will be more equipped to withstand the impact of these tariffs. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here.",
            "date": "2025-04-07T18:30:00Z",
            "sentiment-score": 0.031156348064541817
        },
        {
            "id": "d4573dfc-04c7-336f-9dff-72ff07bb7bbb",
            "summary": "From Chinese electronics to Canadian yoga wear, shoppers are buying now to avoid paying more later",
            "date": "2025-04-08T12:00:16Z",
            "sentiment-score": -0.1755118891596794
        },
        {
            "id": "31c2ee01-a506-361e-a6d0-3ccab6d41d29",
            "summary": "In the closing of the recent trading day, Costco (COST) stood at $908.13, denoting a -0.91% change from the preceding trading day.",
            "date": "2025-04-07T21:45:14Z",
            "sentiment-score": -0.010752454400062561
        },
        {
            "id": "5d1fd367-4827-33f1-9b66-7d4cfaf25e8e",
            "summary": "We recently published a list of 10 Best Fundamental Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Costco Wholesale Corporation (NASDAQ:COST) stands against other best fundamental stocks to buy according to billionaires. As per Fitch Ratings, the US tariffs are now at levels that continue […]",
            "date": "2025-04-08T14:23:23Z",
            "sentiment-score": 0.03688775189220905
        },
        {
            "id": "3e8fff95-980a-3b8e-947d-f95b65741dbf",
            "summary": "Investors and other retailers will be looking for clues on how to navigate the new tariff environment.",
            "date": "2025-04-08T16:33:00Z",
            "sentiment-score": 0.17275625467300415
        },
        {
            "id": "fd716268-6513-392f-b945-0968e8778447",
            "summary": "We recently published a list of 10 Defensive Stocks Billionaire Ken Fisher is Betting On. In this article, we are going to take a look at where Costco Wholesale Corporation (NASDAQ:COST) stands against other defensive stocks billionaire Ken Fisher is betting on. Ken Fisher, an American billionaire investor, author, and financial analyst, founded and runs Fisher Asset […]",
            "date": "2025-04-08T22:16:01Z",
            "sentiment-score": 0.003966209478676319
        },
        {
            "id": "e376a17f-70cd-382d-b3be-e04a0bd333c4",
            "summary": "Experts say tariffs will affect everyday purchases, but as negotiations continue, exact price increases remain unclear.",
            "date": "2025-04-09T10:00:18Z",
            "sentiment-score": -0.006561160087585449
        },
        {
            "id": "ec40087e-b28a-3951-b765-8d0e059a426b",
            "summary": "Costco has had productive discussions with Iowa Attorney General Brenna Bird over the retailer's diversity policies amid a legal onslaught against those programs launched by President Donald Trump, according to Bird's office and another person familiar with the talks.  Bird and 18 other GOP state attorneys general urged Costco Chief Executive Ron Vachris in a letter in January to end what they described as \"unlawful discrimination ... through diversity, equity and inclusion (\"DEI\") policies\".",
            "date": "2025-04-08T23:21:09Z",
            "sentiment-score": -0.2988286018371582
        },
        {
            "id": "38a7ca1b-b481-3acd-a00e-7e2c837f71e7",
            "summary": "Costco (COST) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
            "date": "2025-04-09T13:00:14Z",
            "sentiment-score": 0.018428789917379618
        },
        {
            "id": "60bb92e0-40b9-34f3-adf5-6281155b73f9",
            "summary": "Defensive stocks like Walmart Inc. (WMT) are often a go-to when markets flip upside down. With its low beta and stable dividend, Walmart has historically performed well during periods of fear, uncertainty, and doubt. In a gung-ho political environment full of geopolitical landmines, being recession-proof is often not enough. In recent years, the retail king has reaped the rewards—growing its market share and attracting a wider range of consumers across different income levels. Naturally, that’s",
            "date": "2025-04-12T12:11:58Z",
            "sentiment-score": 0.6973676532506943
        },
        {
            "id": "ab0c6ffd-2314-34cb-9f57-9a934adf3095",
            "summary": "We recently published a list of 10 Best Organic Food Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Costco Wholesale Corporation (NASDAQ:COST) stands against other best organic food stocks to buy according to billionaires. Overview of the Global Organic Food Industry According to a report […]",
            "date": "2025-04-11T19:37:24Z",
            "sentiment-score": 0.013934529386460781
        },
        {
            "id": "e01b7617-2805-3a40-8c4b-4f9a717be167",
            "summary": "Investing.com -- Mizuho Securities started coverage of major U.S. retailers with a preference for Walmart (NYSE:WMT) over Target and Costco (NASDAQ:COST) citing Walmart’s more advanced transformation, broader earnings power, and greater resilience to economic headwinds.",
            "date": "2025-04-11T13:24:39Z",
            "sentiment-score": 0.9027537163347006
        },
        {
            "id": "7f2d6a00-64a8-38f2-a892-777184f75c20",
            "summary": "Costco Wholesale (COST) continues to deliver \"compelling value\" despite concerns around consumer con",
            "date": "2025-04-10T19:11:19Z",
            "sentiment-score": 0.9188134279102087
        },
        {
            "id": "1a94dac1-8f8a-3833-aa91-9bc18c3ace8e",
            "summary": "Costco's March sales results beat Wall Street’s expectations, leading JPMorgan analysts to call the retailer a “clear market leader.\"",
            "date": "2025-04-10T18:26:18Z",
            "sentiment-score": 0.9170916713774204
        },
        {
            "id": "163599f2-8ed9-35ed-b1e2-a05195e8bade",
            "summary": "Josh Lipton explores some of the top stories on Yahoo Finance's Market Minute. Novavax (NVAX) shares fell after US President Donald Trump's Secretary of Health and Human Services Robert F. Kennedy Jr. questioned the efficacy of the company's COVID vaccine. Costco's (COST) March comparable sales beat estimates. Lovesac (LOVE) reported fourth quarter results, with sales beating estimates. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-10T17:23:02Z",
            "sentiment-score": -0.04959799349308014
        },
        {
            "id": "1f0f9d7b-b643-3da2-9c92-2dc9683e296e",
            "summary": "Costco's comparable sales for March increase 6.4%. Its distinctive membership business model and pricing power set it apart from traditional players.",
            "date": "2025-04-10T16:07:00Z",
            "sentiment-score": 0.4165752101689577
        },
        {
            "id": "f1efab7e-ca35-3317-9161-31cafe9d3e0f",
            "summary": "We recently published a list of Jim Cramer Says Tariff Pain Isn’t Over Yet And Reviews These 9 Stocks. In this article, we are going to take a look at where Costco Wholesale Corporation (NASDAQ:COST) stands against other stocks that Jim Cramer discusses. In his latest appearance on CNBC’s Squawk on the Street, Jim Cramer dissected […]",
            "date": "2025-04-10T12:37:29Z",
            "sentiment-score": -0.009404769167304039
        },
        {
            "id": "e4fa6b89-8af8-383b-a9f6-7d9eb7eee498",
            "summary": "Costco (COST) was a big mover last session on higher-than-average trading volume. The latest trend in earnings estimate revisions might not help the stock continue moving higher in the near term.",
            "date": "2025-04-10T11:38:00Z",
            "sentiment-score": 0.7780124628916383
        },
        {
            "id": "3abb2c4f-fa98-354f-ac88-3fd8d778fae4",
            "summary": "Tech stocks are selling off as fears around Trump's tariffs linger.",
            "date": "2025-04-10T11:05:00Z",
            "sentiment-score": -0.9094843193888664
        }
    ]
}