{
    "ticker": "CRM",
    "total_news": 11,
    "average_sentiment": 0.06803685092282566,
    "weighted_average_sentiment": 0.0704669998511672,
    "average_daily_sentiments": [
        0.027815785724669695,
        -0.13828643038868904,
        0.4188377195969224,
        0.027772606971363228,
        0,
        0.030984572134912014,
        0
    ],
    "news": [
        {
            "id": "3eb87042-acb6-3b77-bcdc-5ab7572b9f7a",
            "summary": "We recently published a list of 12 Best Enterprise Software Stocks to Buy Now. In this article, we are going to take a look at where Salesforce Inc. (NYSE:CRM) stands against other best enterprise software stocks to buy now. In 2024, the global enterprise market size was estimated at $263.79 billion, according to Grand View […]",
            "date": "2025-04-05T23:40:10Z",
            "sentiment-score": 0.014200030826032162
        },
        {
            "id": "a10fb8f7-288b-3a82-83f7-20dc69cf3716",
            "summary": "Salesforce.com (CRM) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
            "date": "2025-04-07T13:00:14Z",
            "sentiment-score": 0.019071352668106556
        },
        {
            "id": "0fba2fdc-4a2c-3c56-9bb5-deba86153b85",
            "summary": "Director Oscar Munoz bought stock the first trading day after President Donald Trump announced new tariffs.",
            "date": "2025-04-07T16:04:00Z",
            "sentiment-score": 0.04289779160171747
        },
        {
            "id": "9c40e759-3bcd-35f5-8e1c-e73eaad49a0a",
            "summary": "Let’s dig into the relative performance of Salesforce (NYSE:CRM) and its peers as we unravel the now-completed Q4 sales software earnings season.",
            "date": "2025-04-09T09:05:41Z",
            "sentiment-score": 0.03891567327082157
        },
        {
            "id": "1ab33a0d-7a0f-39bb-9556-66e28b245c15",
            "summary": "We recently published a list of 20 Stocks Insiders Bought in April After Trump’s Tariff Rollout. In this article, we are going to take a look at where Salesforce, Inc. (NYSE:CRM) stands against other stocks that insiders bought in April after Trump’s tariff rollout. President Donald Trump called April 2 a “Liberation Day” after signing […]",
            "date": "2025-04-09T01:47:06Z",
            "sentiment-score": 0.013792152516543865
        },
        {
            "id": "f38e07b0-36ae-3876-8b27-f3225762df12",
            "summary": "Key Insights Significantly high institutional ownership implies Salesforce's stock price is sensitive to their trading...",
            "date": "2025-04-09T12:00:40Z",
            "sentiment-score": 0.030609995126724243
        },
        {
            "id": "3f3f1479-1e16-3d65-ad5c-be747307d2dc",
            "summary": "We recently published a list of 12 Best Tech Stocks to Buy For Long-Term Investment. In this article, we are going to take a look at where Salesforce Inc. (NYSE:CRM) stands against other tech stocks to buy for long-term investment. On April 1, Chris Verrone, chief market strategist at Strategas Research Partners, appeared on CNBC’s […]",
            "date": "2025-04-12T13:03:37Z",
            "sentiment-score": 0.027815785724669695
        },
        {
            "id": "75b45589-26c9-374c-b8d3-dc5b0f30cfe8",
            "summary": "The latest trading day saw Salesforce.com (CRM) settling at $255, representing a -0.05% change from its previous close.",
            "date": "2025-04-11T21:45:14Z",
            "sentiment-score": -0.2848754320293665
        },
        {
            "id": "c7a1c75c-8fcd-3f45-9b0c-7d2cd1078b5d",
            "summary": "Today's Research Daily features new research reports on 16 major stocks, including T-Mobile US, Inc. (TMUS), Salesforce, Inc. (CRM) and Alibaba Group Holding Limited (BABA), as well as two micro-cap stocks Old Point Financial Corporation (OPOF) and BayFirst Financial Corp. (BAFN).",
            "date": "2025-04-11T21:07:00Z",
            "sentiment-score": 0.008302571251988411
        },
        {
            "id": "9971b90d-b8e9-363d-a392-31e595e7664a",
            "summary": "We recently published a list of 10 AI Stocks to Watch Now. In this article, we are going to take a look at where Salesforce, Inc. (NYSE:CRM) stands against other AI stocks to watch now. The trade war between two of the world’s biggest economies, China and the US, is deepening even further. In a […]",
            "date": "2025-04-10T21:38:24Z",
            "sentiment-score": -0.016274023801088333
        },
        {
            "id": "015b1093-d454-3563-aa80-765cc16828c0",
            "summary": "CRM's dominant position in the enterprise software space, ongoing AI initiatives, strong long-term prospects and attractive valuation make the stock worth holding.",
            "date": "2025-04-10T19:00:00Z",
            "sentiment-score": 0.8539494629949331
        }
    ]
}