{
    "ticker": "CVX",
    "total_news": 24,
    "average_sentiment": -0.09561157705805574,
    "weighted_average_sentiment": -0.09365288027506259,
    "average_daily_sentiments": [
        0.019391711801290512,
        -0.03788784430879685,
        0,
        -0.2528577860444784,
        0.038352653943002225,
        -0.5814458066597581,
        0
    ],
    "news": [
        {
            "id": "0575d4c0-4c09-3cbf-82f2-1676fc0da261",
            "summary": "The move may come as a surprise, given that the U.S. benchmark oil price, West Texas Intermediate, is $69.36 per barrel compared to an average of $76.63 in 2024.  Here's why ExxonMobil (NYSE: XOM), Chevron (NYSE: CVX), and ConocoPhillips (NYSE: COP) stand out as three balanced dividend stocks to buy now.  ExxonMobil, Chevron, and ConocoPhillips all have clear paths toward delivering strong free cash flow (FCF) even at current oil prices.",
            "date": "2025-04-05T22:05:00Z",
            "sentiment-score": 0.8437841180711985
        },
        {
            "id": "b16ef76e-d21a-3091-bbf9-2a95dc901311",
            "summary": "CVX to pay $740 million fine to restore Louisiana wetlands after Texaco's mishandling of drilling waste and failure to follow environmental laws.",
            "date": "2025-04-07T10:29:00Z",
            "sentiment-score": -0.915802763774991
        },
        {
            "id": "fd275d04-0d7f-31d5-b241-c7901894c90c",
            "summary": "Investors looking for stable, income-generating assets for their portfolios may focus on large-cap energy stocks like WMB, CVX and KMI.",
            "date": "2025-04-08T11:23:00Z",
            "sentiment-score": 0.05431017093360424
        },
        {
            "id": "9dd54e80-0f62-3204-855b-09b686e642ae",
            "summary": "Energy company Chevron will begin a survey of the east Mediterranean seabed early this summer to prepare for a pipeline connecting a sizable natural gas deposit in Cyprus waters with processing facilities in Egypt, Cypriot officials said Monday.  Chevron CEO Mike Wirth told Cypriot President Nikos Christodoulides in a meeting at Chevron headquarters in Houston the survey will proceed according to a set timetable.",
            "date": "2025-04-07T22:16:36Z",
            "sentiment-score": 0.09477147366851568
        },
        {
            "id": "c70b0629-b359-346d-8c16-3a30c48ed82d",
            "summary": "The job cuts, which are estimated to impact roughly 9,000 employees, mirror staff reductions planned by rival BP to trim costs and boost efficiency.",
            "date": "2025-04-07T15:07:54Z",
            "sentiment-score": -0.9233061298727989
        },
        {
            "id": "a2b674a3-a983-39e7-aec0-b79251c8bc77",
            "summary": "We recently published a list of 11 Best American Energy Stocks to Buy Now. In this article, we are going to take a look at where Chevron Corporation (NYSE:CVX) stands against other best American energy stocks to buy now. On Friday, April 4, oil futures reached multiyear lows following China’s response to the tariffs imposed by […]",
            "date": "2025-04-08T14:21:19Z",
            "sentiment-score": -0.9374594762921333
        },
        {
            "id": "a07475b2-f684-3509-af0f-90b23c917a29",
            "summary": "The oil stock beat the market in Q1. Here's why it remains a buy on any dip.",
            "date": "2025-04-08T15:50:20Z",
            "sentiment-score": 0.060364061035215855
        },
        {
            "id": "5932f807-0a14-3157-b92a-acc381ee2a6d",
            "summary": "Can Chevron and ExxonMobil sail through the current turbulent tariff-induced business environment?",
            "date": "2025-04-08T13:39:00Z",
            "sentiment-score": 0.11510265432298183
        },
        {
            "id": "5ee7161c-84e8-3693-9fc7-74f65138588e",
            "summary": "CVX is set to begin a seabed survey to link Cyprus' Aphrodite gas field to Egypt, boosting regional energy ties.",
            "date": "2025-04-08T14:42:00Z",
            "sentiment-score": 0.8994458597153425
        },
        {
            "id": "ebc9b234-e28b-3499-8790-4892f2df5fc6",
            "summary": "U.S. oil major Chevron plans to increase the use of a technique that allows it to fracture subterranean rock in three wells at a time in the Permian basin, the company told Reuters, in an effort to cut the time and cost of producing oil.  Chevron's expansion of the technique, known as triple-frac, comes as the second-largest U.S. oil producer expects to continue growing output in the Permian, the biggest U.S. oilfield, even as it begins to slow spending in the basin.  The shale oil revolution in the United States has been driven by technological advancement.",
            "date": "2025-04-09T10:09:28Z",
            "sentiment-score": 0.3631624784320593
        },
        {
            "id": "ecda9868-9da8-3747-86ad-5bf93357b6d7",
            "summary": "AFRM and RH have been highlighted as Zacks Bull and Bear of the Day.",
            "date": "2025-04-09T08:14:00Z",
            "sentiment-score": 0.2394199762493372
        },
        {
            "id": "eee11b7f-d931-3eb8-9ee4-feb54607514a",
            "summary": "The Dow Jones Industrial Average (DJINDICES: ^DJI) fell sharply after the U.S. released a new tariff program.  A quick look at the three highest-paying dividend stocks on the index -- Merck (NYSE: MRK), Chevron (NYSE: CVX), and Verizon (NYSE: VZ) -- is a good place to start if you want to find out.  Merck's 4% dividend yield is near the highest levels of the past decade, though it's been much higher in the past.",
            "date": "2025-04-09T07:15:00Z",
            "sentiment-score": 0.002869267016649246
        },
        {
            "id": "5bae32d9-43f4-3c2f-8ce7-5a437f2fbce0",
            "summary": "Oil price plunges below $60, dragging oil majors like XOM, CVX, and SHEL lower. Trade war tariffs and OPEC+ supply surge shake up global energy markets.",
            "date": "2025-04-09T10:33:00Z",
            "sentiment-score": -0.921746707521379
        },
        {
            "id": "3ec2c0a2-f6cd-3b90-895a-b2e7635c1ac6",
            "summary": "(Bloomberg) -- Oil plunged to a four-year low as an intensifying trade war endangered energy demand, with a fresh wave of US and Chinese levies menacing the global economy.Brent futures tumbled below $60 a barrel for the first time since 2021 as natural gas, copper and other commodities also slid. West Texas Intermediate futures traded near $57 a barrel. Shares of BP Plc, Shell Plc, Exxon Mobil Corp. and Chevron Corp. slumped.Crude futures maintained losses as official US data showed domestic in",
            "date": "2025-04-09T14:40:46Z",
            "sentiment-score": -0.9479939443990588
        },
        {
            "id": "a296096f-954b-3769-8289-2e8f058766cd",
            "summary": "Scotiabank downgraded Occidental Petroleum (OXY) and Chevron (CVX) to Sector Perform from Sector Outperform. Market Domination hosts Josh Lipton and Julie Hyman discuss the latest news, highlighting concerns over Occidental's leveraged position following its Crown Rock acquisition and potential buyback reductions at Chevron. To watch more expert insights and analysis on the latest market action, check out more Market Domination&nbsp;here.",
            "date": "2025-04-11T21:00:15Z",
            "sentiment-score": -0.15486345626413822
        },
        {
            "id": "04d048a3-6eac-3f03-8bee-319ab259c9d6",
            "summary": "The stock market has sold off hard this year.  The silver lining to stock market sell-offs is that they enable investors to buy high-quality dividend stocks while they're on sale.  One that I added to during the sell-off was Chevron (NYSE: CVX).",
            "date": "2025-04-12T07:28:00Z",
            "sentiment-score": 0.019391711801290512
        },
        {
            "id": "9b997e7b-4184-3a31-9f61-0bc01481336b",
            "summary": "Chevron (CVX) closed at $135.63 in the latest trading session, marking a +0.48% move from the prior day.",
            "date": "2025-04-11T21:45:16Z",
            "sentiment-score": 0.8038385007530451
        },
        {
            "id": "420a0583-cdad-3888-849b-20d618f2d695",
            "summary": "Analyst sees EOG better positioned amid market uncertainty, while leverage and payout concerns weigh on peers",
            "date": "2025-04-11T21:30:52Z",
            "sentiment-score": 0.8425155291333795
        },
        {
            "id": "8ec2085a-71e5-3fa7-9904-0ab78a608800",
            "summary": "We recently published a list of Jim Cramer Recently Talked About These 9 Stocks. In this article, we are going to take a look at where Chevron Corporation (NYSE:CVX) stands against other stocks that Jim Cramer discussed recently. On Wednesday, Jim Cramer, the host of Mad Money, shared his thoughts on the market turmoil of […]",
            "date": "2025-04-11T16:34:00Z",
            "sentiment-score": -0.0017905347049236298
        },
        {
            "id": "441c8acd-6844-3be8-be65-d15f9eeaab29",
            "summary": "HOUSTON (Reuters) -At least two vessels carrying Venezuelan crude chartered by Chevron are stalled due to state oil company PDVSA canceling their export authorizations, according to shipping data and sources, as the government had no certainty of payment amid the hardening of U.S. sanctions on the OPEC-member country.  An individual license issued in 2022 by the United States for Chevron to operate in Venezuela was revoked in March by U.S. President Donald Trump's administration with a wind-down period granted until May 27.  The U.S. oil producer awaits customs paperwork to return the cargoes to ports after PDVSA on Thursday canceled set-sail authorizations to two of the Chevron-chartered vessels that had finished loading.",
            "date": "2025-04-11T15:03:50Z",
            "sentiment-score": -0.939659146592021
        },
        {
            "id": "64416e40-31d8-38a7-a044-1129c9a8bd6a",
            "summary": "Energy stocks advanced premarket Friday as the Energy Select Sector SPDR Fund (XLE) rose by 0.3% rec",
            "date": "2025-04-11T13:27:45Z",
            "sentiment-score": 0.9088513273745775
        },
        {
            "id": "bf8f89f0-0084-367e-b38e-a36ff5e2d91f",
            "summary": "Chevron (CVX) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
            "date": "2025-04-11T13:00:15Z",
            "sentiment-score": 0.023157368879765272
        },
        {
            "id": "62fd1996-51af-326f-a28b-a1abd3ae7a01",
            "summary": "The Trump administration has revoked Shell and BP's Venezuela gas licenses, escalating a crackdown that began with Chevron and now threatens Trinidad's energy security.",
            "date": "2025-04-11T10:46:00Z",
            "sentiment-score": -0.8734335880726576
        },
        {
            "id": "7d2b5477-0569-37b7-b99d-9762563dc9fc",
            "summary": "Chevron's (CVX) operations in Venezuela are facing disruptions after state oil company PDVSA cancele",
            "date": "2025-04-11T10:28:28Z",
            "sentiment-score": -0.9496065992861986
        }
    ]
}