{
    "ticker": "DIS",
    "total_news": 29,
    "average_sentiment": -0.10365142276639054,
    "weighted_average_sentiment": -0.18237430656947445,
    "average_daily_sentiments": [
        0.056091008707880974,
        0.030967586673796177,
        -0.5597765377024189,
        -0.026309939660131933,
        0.242145168595016,
        0.1490932619864387,
        -0.1651404546573758
    ],
    "news": [
        {
            "id": "3662cd28-c765-367d-90dd-a882507564d6",
            "summary": "The film from Warner Bros. Pictures and Universal Pictures dethroned Disney’s ‘Captain America’ as the biggest domestic opening of 2025.",
            "date": "2025-04-06T21:03:00Z",
            "sentiment-score": 0.44406260550022125
        },
        {
            "id": "07164b6e-f776-354a-81b6-c77d8dc20df2",
            "summary": "We recently published a list of Starter Stock Portfolio 12 Safe Stocks to Buy. In this article, we are going to take a look at where The Walt Disney Company (NYSE:DIS) stands against other best beginner stocks. The US stock market has experienced a turbulent first quarter of 2025, marked by increased volatility and negative […]",
            "date": "2025-04-06T20:53:01Z",
            "sentiment-score": -0.919113309122622
        },
        {
            "id": "b0c5db05-0d1b-3ae0-9d26-f8a1cb7e87e7",
            "summary": "Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service.",
            "date": "2025-04-07T13:40:10Z",
            "sentiment-score": 0.023358063772320747
        },
        {
            "id": "d5990666-8f44-3ad2-80c7-bee5e59ae777",
            "summary": "Why investors should use the Zacks Earnings ESP tool to help find stocks that are poised to top quarterly earnings estimates.",
            "date": "2025-04-07T13:00:09Z",
            "sentiment-score": 0.07137294113636017
        },
        {
            "id": "44b7faa6-f7ae-36bf-ab88-4dbaec157958",
            "summary": "In Disney World’s Central Shops, electricians, carpenters, and painters construct parts of character costumes and tweak theme-park rides.",
            "date": "2025-04-06T11:00:00Z",
            "sentiment-score": -0.020370660349726677
        },
        {
            "id": "43a17eab-7ce0-327d-95d3-15a95a5490da",
            "summary": "Disney (DIS) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report.",
            "date": "2025-04-07T16:10:10Z",
            "sentiment-score": 0.8725993037223816
        },
        {
            "id": "b423b170-5a45-31e5-857a-666372a889c8",
            "summary": "T-Mobile collaborates with Disney to streamline the movie production process using 5G networks.",
            "date": "2025-04-07T16:06:00Z",
            "sentiment-score": 0.2279264791868627
        },
        {
            "id": "4a885c37-4d9e-3f0f-994a-498704115fb8",
            "summary": "DIS' pipeline signals strong potential but near-term headwinds call for patience, suggesting investors hold the stock or watch for a better entry point in 2025.",
            "date": "2025-04-07T19:00:00Z",
            "sentiment-score": -0.17072575725615025
        },
        {
            "id": "2741905e-07c7-3b35-a4e9-bcb9c2cdd269",
            "summary": "Abigail Disney previously said the need to tax rich people like her “has never been so dire.”",
            "date": "2025-04-07T17:33:48Z",
            "sentiment-score": 0.020316369831562042
        },
        {
            "id": "ffd41a25-91d1-3f9c-8466-e85d2db05950",
            "summary": "Investing.com -- Morgan Stanley has named Netflix (NASDAQ:NFLX) its new Top Pick in the Media & Entertainment sector, replacing Walt Disney (NYSE:DIS).",
            "date": "2025-04-08T12:28:32Z",
            "sentiment-score": 0.7957404758781195
        },
        {
            "id": "3353964c-87d9-3cf0-979f-636d0c089bbe",
            "summary": "In the closing of the recent trading day, Walt Disney (DIS) stood at $83.30, denoting a -0.28% change from the preceding trading day.",
            "date": "2025-04-07T21:45:15Z",
            "sentiment-score": -0.0011945664882659912
        },
        {
            "id": "a0cd4eb3-e475-3576-ad3e-e5b83e2e2c00",
            "summary": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores.",
            "date": "2025-04-08T13:45:07Z",
            "sentiment-score": 0.014377608895301819
        },
        {
            "id": "921c8417-6704-3207-830e-fcc9d0d66d99",
            "summary": "We recently published a list of 10 Best Stocks to Buy According to Billionaire Steve Cohen. In this article, we are going to take a look at where The Walt Disney Company (NYSE:DIS) stands against other best stocks to buy according to billionaire Steve Cohen. Steve Cohen, a prominent figure in the world of hedge […]",
            "date": "2025-04-08T18:53:17Z",
            "sentiment-score": 0.03271675296127796
        },
        {
            "id": "7a3ea142-e1f5-366e-b562-0aecffa02f8d",
            "summary": "Ever since President Donald Trump announced his tariff plan, there's been no shortage of stocks that are trading for a big discount to their previous highs.  Although it's entirely possible for the stock market to remain volatile for a while, it looks like an excellent time to add shares of industry-leading companies like Walt Disney (NYSE: DIS) and Starbucks (NASDAQ: SBUX), and that's exactly what I did recently.  Walt Disney struggled in the post-pandemic years to bring its streaming business to profitability and also may have priced its theme parks and related add-ons a bit too aggressively, without investing nearly enough in improving the customer experience.",
            "date": "2025-04-09T09:46:00Z",
            "sentiment-score": 0.6451912932097912
        },
        {
            "id": "f368eb8c-7c5e-3204-a1cd-fb3d9e51581c",
            "summary": "A tariff-induced tumble for the Dow, S&P 500, and Nasdaq Composite paves the way for opportunistic investors to buy shares of phenomenal businesses at a discount.",
            "date": "2025-04-09T07:06:00Z",
            "sentiment-score": -0.10645906627178192
        },
        {
            "id": "2ba393a8-f07b-30b7-aa60-e80d195ca1f0",
            "summary": "We recently published a list of 12 Best Cruise Stocks to Buy According to Hedge Funds. In this article, we are going to take a look at where The Walt Disney Company (NYSE:DIS) stands against other best cruise stocks to buy according to hedge funds. Overview of the Cruise Line Industry The cruise industry is […]",
            "date": "2025-04-09T13:32:22Z",
            "sentiment-score": 0.002438977360725403
        },
        {
            "id": "7b1bed61-bfdc-3820-bfb7-0ca523c3dc9c",
            "summary": "ClearBridge Investments, an investment management company, released its “ClearBridge Value Strategy” first quarter 2025 investor letter. A copy of the letter can be downloaded here. In the first quarter, the strategy underperformed its Russell 1000 Value benchmark, driven by detractors in the energy and financials, which overcame contributions from overweight to energy and underweight to […]",
            "date": "2025-04-09T13:04:32Z",
            "sentiment-score": -0.688774473965168
        },
        {
            "id": "a98873af-8d31-3181-8c8e-ba0a864f69e8",
            "summary": "Zacks.com users have recently been watching Disney (DIS) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.",
            "date": "2025-04-09T13:00:12Z",
            "sentiment-score": 0.016053571365773678
        },
        {
            "id": "9e9551ec-4b1d-3800-b47e-8bc1ad3210e7",
            "summary": "The Big Tech giant is trading instant streams for theatrical prestige, rolling out a studio-size release schedule to win hearts—and maybe Oscars—before views.",
            "date": "2025-04-08T11:00:00Z",
            "sentiment-score": 0.12574583664536476
        },
        {
            "id": "4d4a1b98-97ed-31e1-aa75-e4e59d6ad1af",
            "summary": "In early January, FuboTV's (NYSE: FUBO) story dramatically changed when it agreed to merge its business with Hulu.  FuboTV's stock rose sharply as investors applauded the deal it made with media giant Disney (NYSE: DIS).  Should you buy, sell, or hold FuboTV stock in 2025 before the transaction is completed?",
            "date": "2025-04-12T07:14:00Z",
            "sentiment-score": 0.056091008707880974
        },
        {
            "id": "395656ca-5f97-3c33-8ba0-94b2fbb331ad",
            "summary": "The Zacks Earnings ESP is a great way to find potential earnings surprises. Why investors should take advantage now.",
            "date": "2025-04-11T13:00:10Z",
            "sentiment-score": 0.030967586673796177
        },
        {
            "id": "bf6d1a15-13c9-346b-8745-d82e686246c3",
            "summary": "A number of stocks fell in the afternoon session after stocks gave back some of the gains from the previous day as the White House clarified the tariffs on imports from China would add up to 145%, while the baseline 10% tariffs remained in place for all countries. This reminded markets that the global trade environment remained volatile, limiting the potential for sustained gains.",
            "date": "2025-04-10T22:19:03Z",
            "sentiment-score": -0.9405808476731181
        },
        {
            "id": "118e2f18-a4f6-3768-bbc6-48c7d5670318",
            "summary": "Julie Hyman and Josh Lipton take a closer look at some of Thursday's trending tickers on Market Domination. Tariff risks weigh on Nike (NKE) as US President Trump increases the tariff on imports from China to 145%. Entertainment stocks like Disney (DIS), Warner Bros. Discovery (WBD), and Fox (FOX, FOXA) are falling after China cut imports of Hollywood content. Novavax (NVAX) stock plunges after US Health and Human Services Secretary Robert F. Kennedy Jr. questioned the efficacy of the company's vaccines. To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
            "date": "2025-04-10T20:18:10Z",
            "sentiment-score": -0.9375497363507748
        },
        {
            "id": "576a6261-b077-3a4c-9b00-dee0abe99930",
            "summary": "A surprise tariff war twist hits U.S. entertainment, but the real story is what it signals for global investors.",
            "date": "2025-04-10T19:09:34Z",
            "sentiment-score": -0.007408538833260536
        },
        {
            "id": "0d271ec8-b539-3289-a098-3e8c6521e4c4",
            "summary": "The China Film Administration says that the U.S.’s latest tariff decisions has led it to reduce Hollywood film imports.",
            "date": "2025-04-10T18:39:00Z",
            "sentiment-score": -0.00569915771484375
        },
        {
            "id": "e1a72055-4081-3ec9-bd4e-79875b196ef8",
            "summary": "Here are some of the stories Wall Street is watching on Thursday, April 10. The ongoing trade battle between the US and China is weighing on shares of Apple (AAPL), Disney (DIS), and Warner Bros. Discovery (WBD). Oil prices (CL=F, BZ=F) are also falling on worries that tariffs could weigh on demand. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-10T18:09:21Z",
            "sentiment-score": -0.8054739544168115
        },
        {
            "id": "19416654-bf5d-3b13-9a96-6f24c878c663",
            "summary": "(Bloomberg) -- China announced it would curb imports of Hollywood films, opening a new front in its trade war with the US hours after President Donald Trump’s record tariffs took effect.Most Read from BloombergMidtown Office Building Evacuated on Concerns of Wall CollapseIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapThe Secret Formula for Faster TrainsHelicopter Crashes Into Hudson River With Multiple FatalitiesInside the Quiet, Extravagant Expansion of the Frick CollectionAuthorit",
            "date": "2025-04-10T17:59:41Z",
            "sentiment-score": -0.011427227407693863
        },
        {
            "id": "fe115f5d-33f5-3f78-9bb2-3d1f6556e24f",
            "summary": "Theme park stocks have sold off hard this year.  Things have been tough for travel and leisure stocks because the economy is weakening and consumer sentiment is persistently sour.  Theme parks have been no exception.",
            "date": "2025-04-10T16:53:00Z",
            "sentiment-score": -0.9169689044356346
        },
        {
            "id": "5d2de090-b1cc-3283-bff9-cf7dabd8f960",
            "summary": "We recently published a list of Jim Cramer Warns of a 36% Market Drop & Reviews These 9 Key Stocks. In this article, we are going to take a look at where The Walt Disney Company (NYSE:DIS) stands against other stocks Jim Cramer discusses. In his appearance on CNBC’s Squawk on the Street on Monday, […]",
            "date": "2025-04-10T16:21:35Z",
            "sentiment-score": -0.8531039347872138
        }
    ]
}