{
    "ticker": "GE",
    "total_news": 8,
    "average_sentiment": -0.4365923156728968,
    "weighted_average_sentiment": -0.41786421954091035,
    "average_daily_sentiments": [
        0,
        -0.15392596647143364,
        -0.7940870001912117,
        0,
        0,
        -0.7673372947610915,
        -0.47087695030495524
    ],
    "news": [
        {
            "id": "46190826-a59e-3dad-b175-c0974718e979",
            "summary": "We recently published a list of Top 10 Stocks on Jim Cramer’s Radar as Trump Tariffs Wreak Havoc Across Global Markets. In this article, we are going to take a look at where GE Aerospace (NYSE:GE) stands against other top stocks on Jim Cramer’s radar as Trump tariffs wreak havoc across global markets. Jim Cramer […]",
            "date": "2025-04-03T18:47:42Z",
            "sentiment-score": 0.0017621805891394615
        },
        {
            "id": "f6103b4b-f460-3038-89cf-3a73aa45f972",
            "summary": "If any winners emerge from the trade war started by the Trump administration, the aviation industry certainly isn’t going to be among them.  Shares in aerospace manufacturers such as Boeing, Airbus, GE Aerospace and Rolls-Royce plummeted Thursday as a result of Trump's “Liberation Day” announcements.  Airbus’s plant in Alabama would face a cost surge, but so would Boeing’s many U.S. assembly lines.",
            "date": "2025-04-03T13:55:07Z",
            "sentiment-score": -0.94351608119905
        },
        {
            "id": "a143c4b8-f3af-3df2-8406-e4bcd6c2d931",
            "summary": "As the Q4 earnings season wraps, let’s dig into this quarter’s best and worst performers in the medical devices & supplies - imaging, diagnostics industry, including QuidelOrtho (NASDAQ:QDEL) and its peers.",
            "date": "2025-04-04T09:04:25Z",
            "sentiment-score": -0.5828553922474384
        },
        {
            "id": "a67e5e6e-3f61-35ee-bff3-0ce6a4e8a369",
            "summary": "Shares of the companies spun off from the former industrial icon General Electric were all tanking Friday, led by medical device maker GE HealthCare, on investor fears that they would be hurt by Beijing’s retaliatory levies countering President Donald Trump’s tariffs.",
            "date": "2025-04-04T17:16:48Z",
            "sentiment-score": -0.9518191972747445
        },
        {
            "id": "1e771ad3-4d7b-3616-ae54-9c26578d52a6",
            "summary": "As the Q4 earnings season wraps, let’s dig into this quarter’s best and worst performers in the general industrial machinery industry, including John Bean (NYSE:JBTM) and its peers.",
            "date": "2025-04-07T09:06:09Z",
            "sentiment-score": -0.7940870001912117
        },
        {
            "id": "662b440b-4820-3628-8c36-56241adf8a4d",
            "summary": "The S&P 500 is often seen as a benchmark for strong businesses, but that doesn’t mean every stock is worth owning. Some companies face significant challenges, whether it’s stagnating growth, heavy debt, or disruptive new competitors.",
            "date": "2025-04-08T14:25:58Z",
            "sentiment-score": -0.2859894447028637
        },
        {
            "id": "69f70892-2901-3a90-832c-2d7df830ba7f",
            "summary": "We recently published a list of 10 Defense Stocks with the Highest EPS Growth in 5 Years. In this article, we will take a look at where GE Aerospace (NYSE:GE) stands against other stocks with the highest EPS growth during this period. The world has been embroiled in deadly political and armed conflict over the […]",
            "date": "2025-04-08T22:14:53Z",
            "sentiment-score": -0.021862488240003586
        },
        {
            "id": "acbfe512-dac6-33a9-929e-b872f31c1b0b",
            "summary": "GE Aerospace separated from GE Vernova on April 2, 2024. The big winners from that breakup were investors.",
            "date": "2025-04-02T20:16:00Z",
            "sentiment-score": 0.08562889788299799
        }
    ]
}