{
    "ticker": "GE",
    "total_news": 8,
    "average_sentiment": -0.36063989030662924,
    "weighted_average_sentiment": -0.35097597429970484,
    "average_daily_sentiments": [
        0,
        -0.44114939868450165,
        -0.30029379731665057,
        0,
        -0.15392596647143364,
        -0.7940870001912117,
        0
    ],
    "news": [
        {
            "id": "1e771ad3-4d7b-3616-ae54-9c26578d52a6",
            "summary": "As the Q4 earnings season wraps, let’s dig into this quarter’s best and worst performers in the general industrial machinery industry, including John Bean (NYSE:JBTM) and its peers.",
            "date": "2025-04-07T09:06:09Z",
            "sentiment-score": -0.7940870001912117
        },
        {
            "id": "662b440b-4820-3628-8c36-56241adf8a4d",
            "summary": "The S&P 500 is often seen as a benchmark for strong businesses, but that doesn’t mean every stock is worth owning. Some companies face significant challenges, whether it’s stagnating growth, heavy debt, or disruptive new competitors.",
            "date": "2025-04-08T14:25:58Z",
            "sentiment-score": -0.2859894447028637
        },
        {
            "id": "69f70892-2901-3a90-832c-2d7df830ba7f",
            "summary": "We recently published a list of 10 Defense Stocks with the Highest EPS Growth in 5 Years. In this article, we will take a look at where GE Aerospace (NYSE:GE) stands against other stocks with the highest EPS growth during this period. The world has been embroiled in deadly political and armed conflict over the […]",
            "date": "2025-04-08T22:14:53Z",
            "sentiment-score": -0.021862488240003586
        },
        {
            "id": "6f3fd88d-0b59-39de-b7b1-c5744e8cd071",
            "summary": "Looking back on general industrial machinery stocks’ Q4 earnings, we examine this quarter’s best and worst performers, including Luxfer (NYSE:LXFR) and its peers.",
            "date": "2025-04-11T09:17:12Z",
            "sentiment-score": -0.8995168833062053
        },
        {
            "id": "228aedde-ddac-309e-9130-ddae1f27a415",
            "summary": "As the craze of earnings season draws to a close, here’s a look back at some of the most exciting (and some less so) results from Q4. Today, we are looking at general industrial machinery stocks, starting with Otis (NYSE:OTIS).",
            "date": "2025-04-11T09:15:47Z",
            "sentiment-score": 0.017218085937201977
        },
        {
            "id": "7f0c2a70-248e-3de7-8aa8-8db8d97029ce",
            "summary": "A number of stocks fell in the afternoon session after stocks gave back some of the gains from the previous day as the White House clarified the tariffs on imports from China would add up to 145%, while the baseline 10% tariffs remained in place for all countries. This reminded markets that the global trade environment remained volatile, limiting the potential for sustained gains.",
            "date": "2025-04-10T21:08:06Z",
            "sentiment-score": -0.9405808476731181
        },
        {
            "id": "22f96ff7-02fe-346e-9d22-de71eaf149e4",
            "summary": "Even amid stock market turmoil, valuations still matter.",
            "date": "2025-04-10T15:25:46Z",
            "sentiment-score": 0.01039203442633152
        },
        {
            "id": "62261566-cd43-32e0-93c0-af4193f56e8e",
            "summary": "The end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how medical devices & supplies - imaging, diagnostics stocks fared in Q4, starting with Hologic (NASDAQ:HOLX).",
            "date": "2025-04-10T09:14:53Z",
            "sentiment-score": 0.029307421296834946
        }
    ]
}