{
    "ticker": "HD",
    "total_news": 13,
    "average_sentiment": 0.07531021657184912,
    "weighted_average_sentiment": 0.12132858282088169,
    "average_daily_sentiments": [
        0.037688687443733215,
        -0.01964995265007019,
        0.25194737990386784,
        0,
        0.22426674677990377,
        -0.31462080869823694,
        0
    ],
    "news": [
        {
            "id": "229adc11-b286-3d16-b1fd-3efd52d85ac1",
            "summary": "Quarterly earnings results are a good time to check in on a company’s progress, especially compared to its peers in the same sector. Today we are looking at Home Depot (NYSE:HD) and the best and worst performers in the home furnishing and improvement retail industry.",
            "date": "2025-04-07T09:05:19Z",
            "sentiment-score": -0.40299954265356064
        },
        {
            "id": "fd58f280-cc04-3846-a417-341e561f07c2",
            "summary": "Finding stocks expected to beat quarterly earnings estimates becomes an easier task with our Zacks Earnings ESP.",
            "date": "2025-04-07T13:00:13Z",
            "sentiment-score": 0.10026570502668619
        },
        {
            "id": "99aadc3d-109b-3a22-bfde-7c39ac52efe3",
            "summary": "Home Depot (NYSE:HD) experienced a flat price movement over the past week, amidst a backdrop of significant investor activism highlighting proposals on corporate governance and sustainability, which the company recommended voting against ahead of its annual meeting on May 22, 2025. At the same time, broader market volatility, driven by heightened uncertainties around new tariffs, saw the market dip significantly, with the Dow Jones index dropping sharply. This general market turbulence likely...",
            "date": "2025-04-07T17:23:39Z",
            "sentiment-score": -0.6411285884678364
        },
        {
            "id": "29112f85-8e99-3f5f-b059-793c59c02837",
            "summary": "Recently, Zacks.com users have been paying close attention to Home Depot (HD). This makes it worthwhile to examine what the stock has in store.",
            "date": "2025-04-08T13:00:13Z",
            "sentiment-score": 0.04607897251844406
        },
        {
            "id": "4c23a284-21e2-3512-8bef-0f7e4709f97a",
            "summary": "Based on the average brokerage recommendation (ABR), Home Depot (HD) should be added to one's portfolio. Wall Street analysts' overly optimistic recommendations cast doubt on the effectiveness of this highly sought-after metric. So, is the stock worth buying?",
            "date": "2025-04-08T13:30:08Z",
            "sentiment-score": 0.02887299470603466
        },
        {
            "id": "51350ce6-a892-3039-ba80-26db92682a26",
            "summary": "(Bloomberg) -- The Friday before President Donald Trump’s April 2 announcement of across-the-board tariffs, the top lawyer for one of the biggest US retail industry groups updated members on planning for a potential lawsuit over the trade levies.Most Read from BloombergThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsTrump Order on CDFI Fund Risks Aid for Small Businesses, HousingThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideIn Chicago, a Former Steel Mill Looks t",
            "date": "2025-04-08T16:36:26Z",
            "sentiment-score": -0.0213942751288414
        },
        {
            "id": "d89ddfd6-abd3-30bb-a42b-94ebf0a6a069",
            "summary": "Home Depot (HD) concluded the recent trading session at $334.81, signifying a -1.96% move from its prior day's close.",
            "date": "2025-04-08T21:45:15Z",
            "sentiment-score": 0.8435092950239778
        },
        {
            "id": "3338e6f7-56be-3dda-ba96-4c6dd88ca1f5",
            "summary": "Key Insights Significantly high institutional ownership implies Home Depot's stock price is sensitive to their trading...",
            "date": "2025-04-12T13:00:13Z",
            "sentiment-score": 0.037688687443733215
        },
        {
            "id": "10b4e96e-b6f8-3a27-ba88-b65d16ed1992",
            "summary": "The end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how home furnishing and improvement retail stocks fared in Q4, starting with Lowe's (NYSE:LOW).",
            "date": "2025-04-11T09:13:30Z",
            "sentiment-score": -0.01964995265007019
        },
        {
            "id": "7e9d54a0-336e-3af3-965a-123f58b8c4cf",
            "summary": "(Bloomberg) -- When President Donald Trump said last week that he was using tariffs to remake American trade policy and bolster domestic manufacturing, entrepreneur Evita Chu started calling around to see if she could source some of the yarn she buys from China and Europe in the US instead.She stumbled upon a yarn mill in Wisconsin. “Oh wow, there are these mills and we’d never heard of them,” Chu said. “That’s the positive side.” The negative? The mill doesn’t have the technology to spin the ya",
            "date": "2025-04-10T16:38:50Z",
            "sentiment-score": 0.03328635822981596
        },
        {
            "id": "0d4afc88-e75a-3046-8d64-cfcb7bd2d4bb",
            "summary": "Williams-Sonoma (WSM) saw its shares surge in the last session with trading volume being higher than average. The latest trend in earnings estimate revisions may not translate into further price increase in the near term.",
            "date": "2025-04-10T14:35:00Z",
            "sentiment-score": 0.9169349186122417
        },
        {
            "id": "01f01cea-21d9-32ae-b327-a34451d1cc95",
            "summary": "Suppose you want an early read on trading conditions at turf and landscape equipment company Toro (NASDAQ: TORO).  Major competitors of Toro include Stanley Black & Decker (MTD Products) in residential lawn care, John Deere in golf/turf maintenance, and Deere in utility equipment.  Meanwhile, Home Depot and Lowe's Companies are major lawn care equipment retailers.",
            "date": "2025-04-10T12:55:00Z",
            "sentiment-score": 0.015373233705759048
        },
        {
            "id": "c0eecb7d-f31b-3269-b255-bd60b8de0971",
            "summary": "The end of an earnings season can be a great time to discover new stocks and assess how companies are handling the current business environment. Let’s take a look at how Floor And Decor (NYSE:FND) and the rest of the home furnishing and improvement retail stocks fared in Q4.",
            "date": "2025-04-10T09:06:47Z",
            "sentiment-score": 0.04219500906765461
        }
    ]
}