{
    "ticker": "IBM",
    "total_news": 23,
    "average_sentiment": 0.14590671290036128,
    "weighted_average_sentiment": 0.10870972511861306,
    "average_daily_sentiments": [
        0.6152868838980794,
        -0.7882710350677371,
        0.24039349736024937,
        -0.04867787260029997,
        0.19760154436031976,
        0.4920395975932479,
        -0.0053644925355911255
    ],
    "news": [
        {
            "id": "2c282091-6bb1-37c9-8916-bce2ffb0b1ae",
            "summary": "The mostly forgotten former technology titan may quietly be sitting on the next big thing in AI's ongoing evolution.",
            "date": "2025-04-06T13:00:00Z",
            "sentiment-score": -0.0053644925355911255
        },
        {
            "id": "237feeb6-39fc-3322-b868-68fe99858f87",
            "summary": "IBM on Monday announced that it acquired Hakkoda, a data and AI consultancy based in New York, for an undisclosed amount. Mohamad Ali, SVP and head of IBM's consulting business, said that the acquisition would \"further expand\" IBM's ability to bring consultants and AI to clients, particularly customers in industries like financial services, public sector, and healthcare and life sciences. \"With Hakkoda's data expertise, deep technology partnerships, and asset-centric delivery model,\" Ali said in",
            "date": "2025-04-07T14:08:02Z",
            "sentiment-score": 0.8538036290556192
        },
        {
            "id": "b205c470-6f84-3798-a4d9-7364a7384b56",
            "summary": "IBM (IBM) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.",
            "date": "2025-04-07T13:00:17Z",
            "sentiment-score": -0.011550968512892723
        },
        {
            "id": "404bdf4e-72c5-30e7-97e1-d700109aca83",
            "summary": "Here, we pick three AI stocks, META, IBM and OKTA, which are well poised to benefit from AI's growing pervasiveness and huge spending by tech giants.",
            "date": "2025-04-07T15:47:00Z",
            "sentiment-score": 0.6137034017592669
        },
        {
            "id": "2e016357-331a-3562-9c01-1967da92f7e1",
            "summary": "IBM watsonx introduces new AI native features in the Master's App and website to ensure an immersive experience for golf fans.",
            "date": "2025-04-07T16:10:00Z",
            "sentiment-score": 0.5122023280709982
        },
        {
            "id": "577ba0ed-c42f-4055-963e-05f667bddb5b",
            "summary": "Wall Street analysts are out defending some stocks amid a brief reprieve in the Trump tariff-related selling.",
            "date": "2025-04-08T13:07:39Z",
            "sentiment-score": -0.7377830166369677
        },
        {
            "id": "a656fdf5-bd62-3962-abf6-108e6d891335",
            "summary": "The product line, designed to handle AI workloads, will begin shipping this summer.",
            "date": "2025-04-08T00:01:00Z",
            "sentiment-score": 0.07150600058957934
        },
        {
            "id": "f8aaf0c9-4d5c-3ecd-a864-a125720bf048",
            "summary": "IBM is releasing the latest version of its mainframe hardware that includes new updates meant to accelerate AI adoption. The hardware and consulting company on Monday announced IBM z17, the latest version of its mainframe computer hardware. This fully encrypted mainframe is powered by an IBM Telum II processor and is designed for more than 250 AI use cases, the company says, including AI agents and generative AI. Mainframes might seem like old hat, but they're used by 71% of Fortune 500 companie",
            "date": "2025-04-08T04:01:00Z",
            "sentiment-score": 0.051696831826120615
        },
        {
            "id": "90da2557-1505-3ca3-bdc7-d62a4de33511",
            "summary": "IBM stock gained in a bounce-back day for tech stocks. The computing giant is launching an AI-focused update to its mainframe.",
            "date": "2025-04-08T15:06:18Z",
            "sentiment-score": 0.6445716060698032
        },
        {
            "id": "83a02036-0abb-3c72-b4e3-41e5c7dbfef9",
            "summary": "IBM's stock defied market trends with a 13% gain in Q1 2025. Here's how Big Blue pulled off this impressive feat while the S&P 500 struggled.",
            "date": "2025-04-08T17:31:56Z",
            "sentiment-score": 0.2530146539211273
        },
        {
            "id": "b3974713-463e-3517-a5b7-ca0966879e8b",
            "summary": "The buyout of data consultancy provider Hakkoda will strengthen IBM's consulting expertise and support its clients' AI transformation initiatives.",
            "date": "2025-04-08T16:25:00Z",
            "sentiment-score": 0.9026031903922558
        },
        {
            "id": "8031d85a-245b-3fcc-a4ab-c925c05fe24d",
            "summary": "IBM's mainframe systems, known for their extreme reliability, remain a workhorse in certain industries.  Of the world's 50 top banks, 43 use IBM's mainframes to handle mission-critical workloads.  Every two to three years, IBM refreshes its mainframe lineup with a new model that brings improved performance and expanded capabilities.",
            "date": "2025-04-09T09:35:00Z",
            "sentiment-score": 0.800565586425364
        },
        {
            "id": "b167b5f3-e1ce-36f9-a0b4-bc0414723b4f",
            "summary": "We recently published a list of 9 AI Stocks In Focus: Tariffs and Key Updates. In this article, we are going to take a look at where International Business Machines Corporation (NYSE:IBM) stands against other AI stocks in focus. President Donald Trump’s new tariff regimes have been introduced under the International Emergency Economic Powers Act. […]",
            "date": "2025-04-09T16:25:51Z",
            "sentiment-score": 0.019844673573970795
        },
        {
            "id": "9293b67b-b617-357c-acf1-51847e8597f3",
            "summary": "IBM Telum II processor-powered mainframe can process up to 50% more AI inference operations per day than its predecessor.",
            "date": "2025-04-09T16:06:19Z",
            "sentiment-score": 0.11617139261215925
        },
        {
            "id": "1945f868-1ab4-342d-a14b-653ca6c52f79",
            "summary": "Looking to invest in the future of computing without excessive risk? These three tech powerhouses are building quantum capabilities while generating massive profits from their more well-known core businesses.",
            "date": "2025-04-12T11:49:00Z",
            "sentiment-score": 0.6152868838980794
        },
        {
            "id": "d2631671-bed5-3c98-bd78-fe3a8bd89b61",
            "summary": "As the stock market swings wildly thanks to erratic, unpredictable, and potentially economically damaging tariff policies from the Trump administration, predicting anything in the near term about stocks has become next to impossible.  AT&T (NYSE: T), Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B), and IBM (NYSE: IBM) are three such companies that investors can buy and hold for the long run.  Telecom giant AT&T will certainly feel some pain if the Trump administration's tariff policy leads to an economic slowdown.",
            "date": "2025-04-11T10:45:00Z",
            "sentiment-score": -0.7882710350677371
        },
        {
            "id": "b87f0562-79f2-3253-8adc-7c85d71f36e2",
            "summary": "(Bloomberg) -- International Business Machines Corp. spent months revising its diversity initiatives as conservative attacks and souring attitudes toward DEI shifted into a full-blown assault from President Donald Trump.Most Read from BloombergMidtown Office Building Evacuated on Concerns of Wall CollapseIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapThe Secret Formula for Faster TrainsHelicopter Crashes Into Hudson River With Multiple FatalitiesInside the Quiet, Extravagant Expansi",
            "date": "2025-04-10T23:30:48Z",
            "sentiment-score": -0.1513735130429268
        },
        {
            "id": "18322992-289e-3c04-9419-e20f0749ae79",
            "summary": "Silicon Motion (SIMO) was a big mover last session on higher-than-average trading volume. The latest trend in earnings estimate revisions might not help the stock continue moving higher in the near term.",
            "date": "2025-04-10T15:15:00Z",
            "sentiment-score": 0.8433930007740855
        },
        {
            "id": "1995fddb-a11c-3755-be30-52f25d27a888",
            "summary": "We recently published a list of 10 AI Stocks Investors Are Watching Today. In this article, we are going to take a look at where International Business Machines Corporation (NYSE:IBM) stands against other AI stocks investors are watching today. Tech experts strongly believe that the new tariffs could potentially slow down the AI boom. “The […]",
            "date": "2025-04-10T12:02:07Z",
            "sentiment-score": 0.029161004349589348
        },
        {
            "id": "dd6d2c4b-5515-364e-ae31-7658c0669b5a",
            "summary": "(Updates with Booz Allen's response in the third paragraph.) Booz Allen Hamilton Holding (BAH), A",
            "date": "2025-04-09T20:13:06Z",
            "sentiment-score": 0.0018016491085290909
        },
        {
            "id": "7d12e6b0-00ff-4109-af66-10b3c5b8c126",
            "summary": "The tech industry tried to cozy up to the Trump Administration in the hopes that it could avoid getting caught in the crossfire of his policy moves. But they couldn't dodge his tariffs.",
            "date": "2025-04-09T19:29:14Z",
            "sentiment-score": -0.2778167128562927
        },
        {
            "id": "ff5f6616-2dd7-33a8-b38d-b9c6dad2a9ca",
            "summary": "A number of stocks jumped in the afternoon session after markets rallied sharply on news that President Trump announced a 90-day tariff pause. Reciprocal tariffs were also dropped to 10% for most countries, sparking renewed optimism amid ongoing trade talks. The major stock indices rose as investors, growing impatient of seemingly irrational tariff actions, welcomed the pause as a sign of a more measured path forward.",
            "date": "2025-04-09T18:39:03Z",
            "sentiment-score": -0.21724315546453
        },
        {
            "id": "494d0957-f5c3-3084-b2d1-57ef369c45f2",
            "summary": "International Business Machines (NYSE:IBM) recently experienced investor activism, with shareholder John Chevedden filing a proposal to increase transparency on lobbying practices. Despite this, IBM's share price remained relatively flat over the last quarter. The company's earnings report indicated modest revenue growth, coupled with a drop in net income and EPS, which could have weighed on its stock. Meanwhile, IBM's ongoing product innovations and strategic alliances, like the introduction...",
            "date": "2025-04-09T18:04:28Z",
            "sentiment-score": -0.7840685416013002
        }
    ]
}