{
    "ticker": "ISRG",
    "total_news": 12,
    "average_sentiment": 0.19899478869047016,
    "weighted_average_sentiment": 0.21594397484191827,
    "average_daily_sentiments": [
        -0.929603086784482,
        -0.005266471765935421,
        0.8905725432559848,
        0.28885090444236994,
        0.8619344313628972,
        -0.0451683490537107,
        -0.958422941621393
    ],
    "news": [
        {
            "id": "a6160a32-00a2-3a54-988c-7e7df16e918d",
            "summary": "Intuitive Surgical (NASDAQ: ISRG) was a pioneer in minimally invasive robotic-assisted surgery technology, and its leadership in the field has long been a key edge for the company.  At the time of this writing, global economic concerns and Intuitive Surgical's mixed outlook have caused shares of the medical device giant to drop by about 18% from the all-time high they set in January.  Surgeons performed nearly 2.7 million procedures using Intuitive Surgical's da Vinci system in 2024 alone -- twice as many as five years ago.",
            "date": "2025-04-06T11:00:00Z",
            "sentiment-score": -0.958422941621393
        },
        {
            "id": "38d3d95f-ab08-37d8-97d6-b858aab4cc4d",
            "summary": "Recently, Zacks.com users have been paying close attention to Intuitive Surgical (ISRG). This makes it worthwhile to examine what the stock has in store.",
            "date": "2025-04-07T13:00:10Z",
            "sentiment-score": 0.04966981429606676
        },
        {
            "id": "e90aa9cf-fc19-3441-b9f5-23d84916c7a6",
            "summary": "A bear market takes hold as Trump tariffs hammer stocks. With IBD Leaderboard trimmed to just seven names, safety and preparation are in focus.",
            "date": "2025-04-07T17:16:37Z",
            "sentiment-score": -0.14000651240348816
        },
        {
            "id": "25f694f9-2a10-3760-87d3-3be743925227",
            "summary": "Intuitive Surgical shows improving price performance, earning an upgrade to its IBD Relative Strength Rating.",
            "date": "2025-04-08T07:00:00Z",
            "sentiment-score": 0.9281622031703591
        },
        {
            "id": "30361122-e8df-326c-81c9-415d38a45921",
            "summary": "Intuitive Surgical, Inc. (ISRG) closed at $457.63 in the latest trading session, marking a -1.29% move from the prior day.",
            "date": "2025-04-08T22:00:15Z",
            "sentiment-score": 0.7957066595554352
        },
        {
            "id": "735b4031-6b8f-38a3-a331-5a45d6ec0c93",
            "summary": "Equity markets may be struggling because of President Donald Trump's current economic policies, but that doesn't mean investors should avoid buying stocks right now -- quite the contrary.  History tells us that equities tend to experience strong runs following downturns, so it's worth putting money into excellent companies that are being dragged down with along with the broader market.  To that end, let's consider five excellent growth-oriented companies to invest in on the dip: Novo Nordisk (NYSE: NVO), Eli Lilly (NYSE: LLY), Vertex Pharmaceuticals (NASDAQ: VRTX), Intuitive Surgical (NASDAQ: ISRG), and Shopify (NASDAQ: SHOP).",
            "date": "2025-04-09T14:00:00Z",
            "sentiment-score": 0.016165612265467644
        },
        {
            "id": "622d5c7f-2d6a-3ce1-8dd4-46c4bb33898a",
            "summary": "\"You get what you pay for\" often applies to expensive stocks with best-in-class business models and execution. While their quality can sometimes justify the premium, they typically experience elevated volatility during market downturns when expectations change.",
            "date": "2025-04-09T13:02:10Z",
            "sentiment-score": -0.06570730730891228
        },
        {
            "id": "5e48dd90-c2f3-35e8-b3cd-a3ac18cddf56",
            "summary": "Only a few days ago, the Nasdaq was in a bear market (down 20%-plus from recent all-time highs).  What should investors who are experiencing Nasdaq market whiplash do now?  Alphabet is now quite reasonably valued with a price-to-earnings-to-growth (PEG) ratio of 1.04, based on data from LSEG.",
            "date": "2025-04-12T08:48:00Z",
            "sentiment-score": -0.929603086784482
        },
        {
            "id": "6dec86a4-ecf9-398a-ae9c-90aa5873e445",
            "summary": "We recently published a list of 10 Best Medical Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Intuitive Surgical, Inc. (NASDAQ:ISRG) stands against other best medical stocks to buy according to billionaires. Why are Healthcare Stocks Under Pressure? Some experts view medical, healthcare, and big […]",
            "date": "2025-04-11T20:00:24Z",
            "sentiment-score": -0.005266471765935421
        },
        {
            "id": "a5d33f48-9208-3150-8d74-46dcb6110784",
            "summary": "Intuitive Surgical (NasdaqGS:ISRG) recently announced the FDA clearance of its SP SureForm 45 stapler for use with the da Vinci SP surgical system, an advancement set to enhance surgical procedures by increasing safety and efficiency. Despite the broader market facing a sharp decline, with the Nasdaq sliding 6% amid a tech rout, Intuitive's shares rose 8%, suggesting that the company's innovations and product approvals provided support against market pressures. While the broader market...",
            "date": "2025-04-10T17:18:08Z",
            "sentiment-score": 0.8657461237162352
        },
        {
            "id": "23cebfd7-6b94-378b-a6b4-69ca01405807",
            "summary": "Intuitive Surgical (ISRG) saw its shares surge in the last session with trading volume being higher than average. The latest trend in earnings estimate revisions could translate into further price increase in the near term.",
            "date": "2025-04-10T15:37:00Z",
            "sentiment-score": 0.9153989627957344
        },
        {
            "id": "2b47c372-177e-3051-aa01-406a8d82b220",
            "summary": "Netflix and DoorDash are two of the seven best stocks where investors can find magnificent profit growth prospects.  More than 70% of analysts covering Netflix have buy or overweight ratings on the video streaming service.  The consensus estimate for 2025 earnings is $24.69, a 25% increase from last year.",
            "date": "2025-04-09T17:36:21Z",
            "sentiment-score": 0.9160944083705544
        }
    ]
}