{
    "ticker": "ISRG",
    "total_news": 10,
    "average_sentiment": -0.11558645446784795,
    "weighted_average_sentiment": 0.12677936398018244,
    "average_daily_sentiments": [
        -0.024770847521722317,
        0.8619344313628972,
        -0.0451683490537107,
        -0.958422941621393,
        0,
        0,
        -0.41859626211225986
    ],
    "news": [
        {
            "id": "79fe7689-2f34-3f27-8a20-57b334e9c635",
            "summary": "The Nasdaq Composite (NASDAQINDEX: ^IXIC) and the S&P 500 (SNPINDEX: ^GSPC) sank, shifting in and out of correction territory in the first quarter of the year for one big reason: investors have been worried about the economy.  President Donald Trump is putting tariffs on imports, and economists predict this could lead to higher inflation and a slowdown in growth.  Healthcare companies, for example, may excel since people need their medicines or procedures regardless of the economic backdrop.",
            "date": "2025-04-02T22:15:00Z",
            "sentiment-score": -0.944239548407495
        },
        {
            "id": "5115c19f-470a-36b0-bd9e-6017c31181bd",
            "summary": "Josh Lipton goes over some of the top stories on this segment of Market Minute. Medical device stocks like GE Healthcare (GEHC) and Intuitive Surgical (ISRG) saw losses, while pharmaceutical companies remained unaffected by country-specific tariffs. Oil futures (CL=F, BZ=F) are dropping after OPEC Plus announced an unexpected supply increase. Lamb Weston (LW) stock surges after the company exceeded third-quarter earnings expectations. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-03T17:15:57Z",
            "sentiment-score": -0.9051518775522709
        },
        {
            "id": "269b8afb-3bc4-470d-9c52-09689051d6f0",
            "summary": "Medical devices, or the medtech sector, are not immune from the reciprocal tariffs announced by Trump yesterday.",
            "date": "2025-04-03T14:29:02Z",
            "sentiment-score": 0.06795935332775116
        },
        {
            "id": "a6160a32-00a2-3a54-988c-7e7df16e918d",
            "summary": "Intuitive Surgical (NASDAQ: ISRG) was a pioneer in minimally invasive robotic-assisted surgery technology, and its leadership in the field has long been a key edge for the company.  At the time of this writing, global economic concerns and Intuitive Surgical's mixed outlook have caused shares of the medical device giant to drop by about 18% from the all-time high they set in January.  Surgeons performed nearly 2.7 million procedures using Intuitive Surgical's da Vinci system in 2024 alone -- twice as many as five years ago.",
            "date": "2025-04-06T11:00:00Z",
            "sentiment-score": -0.958422941621393
        },
        {
            "id": "38d3d95f-ab08-37d8-97d6-b858aab4cc4d",
            "summary": "Recently, Zacks.com users have been paying close attention to Intuitive Surgical (ISRG). This makes it worthwhile to examine what the stock has in store.",
            "date": "2025-04-07T13:00:10Z",
            "sentiment-score": 0.04966981429606676
        },
        {
            "id": "e90aa9cf-fc19-3441-b9f5-23d84916c7a6",
            "summary": "A bear market takes hold as Trump tariffs hammer stocks. With IBD Leaderboard trimmed to just seven names, safety and preparation are in focus.",
            "date": "2025-04-07T17:16:37Z",
            "sentiment-score": -0.14000651240348816
        },
        {
            "id": "25f694f9-2a10-3760-87d3-3be743925227",
            "summary": "Intuitive Surgical shows improving price performance, earning an upgrade to its IBD Relative Strength Rating.",
            "date": "2025-04-08T07:00:00Z",
            "sentiment-score": 0.9281622031703591
        },
        {
            "id": "30361122-e8df-326c-81c9-415d38a45921",
            "summary": "Intuitive Surgical, Inc. (ISRG) closed at $457.63 in the latest trading session, marking a -1.29% move from the prior day.",
            "date": "2025-04-08T22:00:15Z",
            "sentiment-score": 0.7957066595554352
        },
        {
            "id": "735b4031-6b8f-38a3-a331-5a45d6ec0c93",
            "summary": "Equity markets may be struggling because of President Donald Trump's current economic policies, but that doesn't mean investors should avoid buying stocks right now -- quite the contrary.  History tells us that equities tend to experience strong runs following downturns, so it's worth putting money into excellent companies that are being dragged down with along with the broader market.  To that end, let's consider five excellent growth-oriented companies to invest in on the dip: Novo Nordisk (NYSE: NVO), Eli Lilly (NYSE: LLY), Vertex Pharmaceuticals (NASDAQ: VRTX), Intuitive Surgical (NASDAQ: ISRG), and Shopify (NASDAQ: SHOP).",
            "date": "2025-04-09T14:00:00Z",
            "sentiment-score": 0.016165612265467644
        },
        {
            "id": "622d5c7f-2d6a-3ce1-8dd4-46c4bb33898a",
            "summary": "\"You get what you pay for\" often applies to expensive stocks with best-in-class business models and execution. While their quality can sometimes justify the premium, they typically experience elevated volatility during market downturns when expectations change.",
            "date": "2025-04-09T13:02:10Z",
            "sentiment-score": -0.06570730730891228
        }
    ]
}