{
    "ticker": "JNJ",
    "total_news": 23,
    "average_sentiment": 0.10871596051299054,
    "weighted_average_sentiment": 0.08951375072252063,
    "average_daily_sentiments": [
        0.007894683629274368,
        0.22809393219649793,
        -0.21665246656630188,
        -0.5132346330210567,
        0.38805326470173895,
        -0.6353507675230503,
        0
    ],
    "news": [
        {
            "id": "70626521-449f-3b79-b7cd-d936cb9688ff",
            "summary": "The trial involved biologic-naïve subjects who had not responded adequately to standard therapies.",
            "date": "2025-04-07T11:12:09Z",
            "sentiment-score": -0.6353507675230503
        },
        {
            "id": "6b438e88-d53e-32a6-8db3-9599262bcca1",
            "summary": "Johnson & Johnson (JNJ) said Tuesday that the latest results from a trial of the investigational nip",
            "date": "2025-04-08T09:30:34Z",
            "sentiment-score": 0.14977731928229332
        },
        {
            "id": "15240a3d-44fa-3c0b-ac3a-70f910693914",
            "summary": "The approval follows October 2024's indication extension for daratumumab-VRd for newly diagnosed patients eligible for ASCT.",
            "date": "2025-04-08T08:50:23Z",
            "sentiment-score": 0.4626776874065399
        },
        {
            "id": "a4b082d4-d3e5-3d1d-8c66-df0c01b86afc",
            "summary": "Walgreens (WBA) stock is rising after the company reported better-than-expected second quarter earnings while preparing for privatization. Yahoo Finance Senior Health Reporter Anjalee Khemlani highlights the company's cost management strategy, CVS's (CVS) leadership changes amid similar challenges in the retail drug sector, and moves by US drug makers, like Merck (MRK), Johnson & Johnson (JNJ), and Eli Lilly (LLY), as they prepare for incoming tariffs. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
            "date": "2025-04-08T14:03:18Z",
            "sentiment-score": 0.4182991795241833
        },
        {
            "id": "936d1730-54cd-3857-9f6d-f0cc0067b12c",
            "summary": "The device is differentiated from other Shockwave products, and rival catheters from Abbott and Boston Scientific, because it emits waves from its tip.",
            "date": "2025-04-08T09:57:30Z",
            "sentiment-score": 0.1133681214414537
        },
        {
            "id": "fafc4bbc-ffc9-32a2-b72e-727759dcd173",
            "summary": "Johnson & Johnson (JNJ) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.",
            "date": "2025-04-08T14:00:09Z",
            "sentiment-score": 0.12215862981975079
        },
        {
            "id": "fade22d1-4b04-3a73-ba26-cc11ec4c724b",
            "summary": "Goldman updates coverage across major U.S. drugmakers, citing exclusivity risks, pricing power, and pipeline outlooks",
            "date": "2025-04-08T17:58:13Z",
            "sentiment-score": 0.05184461548924446
        },
        {
            "id": "1182d00a-0521-3bf6-aebf-180151ff4ea7",
            "summary": "J&J exhibited additional findings from the Vivacity-MG3 study, displaying that nipocalimab met its key secondary endpoint.",
            "date": "2025-04-08T17:44:40Z",
            "sentiment-score": 0.9093218529596925
        },
        {
            "id": "089fea8f-2086-36bf-8c81-f1f3f169ca29",
            "summary": "Johnson & Johnson (NYSE:JNJ) on Tuesday announced results from additional analyses of the Phase 3 Vivacity-MG3 study and the ongoing open-label extension (OLE), evaluating the long-term efficacy and safety of nipocalimab in a broad population of antibody-positive adults with generalized myasthenia gravis (gMG). Patients treated with nipocalimab plus standard of care (SOC) maintained improvements in their MG-ADL (activities of daily living) and QMG (quantifies disease severity) scores over 84 wee",
            "date": "2025-04-08T18:26:32Z",
            "sentiment-score": 0.9170118384063244
        },
        {
            "id": "bad134ec-0cb1-3fcc-b046-1451d694984b",
            "summary": "We recently published a list of 10 Defensive Stocks Billionaire Ken Fisher is Betting On. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other defensive stocks billionaire Ken Fisher is betting on. Ken Fisher, an American billionaire investor, author, and financial analyst, founded and runs Fisher Asset […]",
            "date": "2025-04-08T22:14:16Z",
            "sentiment-score": 0.006257223896682262
        },
        {
            "id": "2f1a369a-7ab9-39e1-a5b5-cf04e1def8d0",
            "summary": "In the latest trading session, Johnson & Johnson (JNJ) closed at $149.83, marking a -0.52% move from the previous day.",
            "date": "2025-04-08T21:45:16Z",
            "sentiment-score": 0.729816178791225
        },
        {
            "id": "42788375-b286-39dd-b048-683f4aab07b7",
            "summary": "Drugmaker stocks, including Eli Lilly (LLY), Johnson & Johnson (JNJ), Merck (MRK), and Pfizer (PFE), are under pressure on Wednesday after President Trump announced that he may impose tariffs on pharmaceutical imports. Yahoo Finance Senior Health Reporter Anjalee Khemlani joins Morning Brief to break down the details. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
            "date": "2025-04-09T14:11:57Z",
            "sentiment-score": -0.07719903066754341
        },
        {
            "id": "f171bfb7-94e2-3b98-bde2-9d5add357a5c",
            "summary": "Stocks in drugmakers sold off globally after President Trump said tariffs on pharmaceutical imports will be unveiled shortly, signaling the industry could be next in line amid a trade war that is causing market turmoil.  AbbVie, Eli Lilly, Johnson & Johnson, Merck and Pfizer all fell at least 2% Wednesday morning.  Denmark's Novo Nordisk, Switzerland's Novartis and the U.K.'s AstraZeneca and GSK also fell 2% or more in the U.S.",
            "date": "2025-04-09T13:51:17Z",
            "sentiment-score": -0.9492702353745699
        },
        {
            "id": "cab8f54b-9923-3a4d-9cc1-1733d9ba0213",
            "summary": "We recently published a list of the 11 Cheap NYSE Stocks to Invest in According to Hedge Funds. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other cheap NYSE stocks. On March 26, Jack Caffrey of JPMorgan Asset Management provided an analysis of market trends […]",
            "date": "2025-04-12T13:05:22Z",
            "sentiment-score": 0.007894683629274368
        },
        {
            "id": "e66f4567-1cb7-3894-b8f8-71082691e388",
            "summary": "We recently published a list of Jim Cramer Questions Market Logic and Dissects These 7 Key Stocks. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. In his latest appearance on CNBC’s Squawk on the Street, Jim Cramer unpacked the deepening uncertainty […]",
            "date": "2025-04-11T17:59:02Z",
            "sentiment-score": -0.011082835495471954
        },
        {
            "id": "6c70e023-4fd8-3b8c-9b4f-576138b88c8c",
            "summary": "JNJ's Innovative Medicines unit sales are expected to have been driven by drugs like Darzalex and Tremfya. We do not expect any improvement in MedTech sales.",
            "date": "2025-04-11T15:32:00Z",
            "sentiment-score": 0.8878326155245304
        },
        {
            "id": "63b4a4b0-03c0-47f5-8c77-924188fd222e",
            "summary": "Earnings preview of key companies reporting next week and what to look out for.",
            "date": "2025-04-11T13:11:11Z",
            "sentiment-score": -0.010118871927261353
        },
        {
            "id": "c73546e9-3901-3b54-a82d-945b52d20ad2",
            "summary": "The safety profile of icotrokinra was demonstrated to be 'favourable', according to the company.",
            "date": "2025-04-11T11:41:55Z",
            "sentiment-score": 0.9221508968621492
        },
        {
            "id": "a03b0266-2381-35b9-8681-f1fed3edcc56",
            "summary": "Microsoft (NASDAQ: MSFT) and Johnson & Johnson (NYSE: JNJ) are leading companies in their respective industries.  Microsoft's market cap is $2.6 trillion, so some detractors feel it has little room to grow.  Meanwhile, Johnson & Johnson is still dealing with thousands of talc-related lawsuits, and recently hit another road bump in that department.",
            "date": "2025-04-11T08:25:00Z",
            "sentiment-score": -0.6483121439814568
        },
        {
            "id": "5788e167-ba2e-3f2d-8e9e-4bfb72e0e2c1",
            "summary": "Pharma stocks tumbled Thursday after the Trump administration said the delay for reciprocal tariffs doesn't apply to sector-specific tariffs.",
            "date": "2025-04-10T16:58:23Z",
            "sentiment-score": -0.9471217887476087
        },
        {
            "id": "597d79bb-14b2-3483-ad21-cd6600245366",
            "summary": "Evaluate the expected performance of Johnson & Johnson (JNJ) for the quarter ended March 2025, looking beyond the conventional Wall Street top-and-bottom-line estimates and examining some of its key metrics for better insight.",
            "date": "2025-04-10T13:15:12Z",
            "sentiment-score": 0.06325879180803895
        },
        {
            "id": "f515e359-5d6b-37af-8c12-92cd66252e73",
            "summary": "Johnson & Johnson (JNJ) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
            "date": "2025-04-10T13:00:15Z",
            "sentiment-score": 0.02074585296213627
        },
        {
            "id": "e3f04ed2-2700-32a4-a768-e58ea75b9b69",
            "summary": "We recently published a list of Jim Cramer Says Tariff Pain Isn’t Over Yet And Reviews These 9 Stocks. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. In his latest appearance on CNBC’s Squawk on the Street, Jim Cramer dissected […]",
            "date": "2025-04-10T12:42:43Z",
            "sentiment-score": -0.003492722287774086
        }
    ]
}