{
    "ticker": "JPM",
    "total_news": 53,
    "average_sentiment": -0.12147133374797567,
    "weighted_average_sentiment": -0.029243552726639067,
    "average_daily_sentiments": [
        0.6403410403678814,
        0.29669092911192113,
        0,
        -0.5123838135041296,
        -0.15777169753398215,
        -0.10980675561243997,
        -0.29491068484882516
    ],
    "news": [
        {
            "id": "b694fe0c-6fe2-318f-b0d2-aa9bc43f4db2",
            "summary": "Coming up: US and China tariffs set to take effect, March inflation data, Big Bank earnings, consumer sentiment, Fed meeting minutes, consumer credit data",
            "date": "2025-04-06T10:00:00Z",
            "sentiment-score": 0.005216325633227825
        },
        {
            "id": "0acbf8de-1736-347c-a18c-8821ff856675",
            "summary": "(Bloomberg) -- US Treasury Secretary Scott Bessent on Sunday struck a defiant tone in the face of global financial markets selling off sharply in response to new US tariffs, arguing the new duties were necessary and rejecting the idea that they would cause a US recession.",
            "date": "2025-04-06T13:59:16Z",
            "sentiment-score": -0.8913758927956223
        },
        {
            "id": "e1840d61-f600-348a-9100-31a048ab5233",
            "summary": "(Bloomberg) -- President Donald Trump’s top economic officials dismissed investors’ fears of inflation and recession, offering no apologies for the market turmoil sparked by sweeping global tariffs and defiantly insisting a boom is on the horizon. Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Hot Press Is the Low-Tech Laundry Trick the",
            "date": "2025-04-06T20:07:29Z",
            "sentiment-score": 0.0014275126159191132
        },
        {
            "id": "26b4856a-9fa5-4001-99d5-39c873ba6131",
            "summary": "Trump urges the Fed to lower rates, giving no indication he will back down from his sweeping tariff policy.",
            "date": "2025-04-07T12:27:55Z",
            "sentiment-score": -0.5697861909866333
        },
        {
            "id": "982b6f97-832e-4912-ac7e-163b9bc071fc",
            "summary": "JPMorgan CEO Jamie Dimon and other big names on Wall Street are issuing new warnings about the impact of President Trump's tariffs as markets continue to plunge.",
            "date": "2025-04-07T10:17:43Z",
            "sentiment-score": -0.9279226548969746
        },
        {
            "id": "67715f18-b72b-3b91-b612-ae04419ec556",
            "summary": "In the JPMorgan CEO’s annual letter, he says he hopes for long-term benefits but that many uncertainties exist.",
            "date": "2025-04-07T11:07:00Z",
            "sentiment-score": -0.19123435020446777
        },
        {
            "id": "3d0ebe43-1d0c-344c-9bb3-7cf6b3c741c0",
            "summary": "Style Box ETF report for BBMC",
            "date": "2025-04-07T10:20:04Z",
            "sentiment-score": -0.0072733694687485695
        },
        {
            "id": "692dbcdd-10da-3ab5-ad8b-f93b3f6fb91f",
            "summary": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsWhat Would ‘Transportation Abundance’ Look Like?JPMorgan Chase & Co. Chief Executive Officer Jamie Dimon urged a quick resolution to the uncertaint",
            "date": "2025-04-07T10:15:00Z",
            "sentiment-score": 0.018405177630484104
        },
        {
            "id": "b084849b-e49e-3bb5-a3b4-05368aaf441b",
            "summary": "JPMorgan, Wells Fargo, Bank of America and Morgan Stanely are part of Zacks Earnings Preview.",
            "date": "2025-04-07T09:19:00Z",
            "sentiment-score": 0.004779371432960033
        },
        {
            "id": "5645002f-bef1-4478-9988-95fd21ef3b2d",
            "summary": "A 360-degree turnaround is rapidly consigning work from home culture to the past as sticks replace carrots to herd workers back into offices",
            "date": "2025-04-07T05:00:17Z",
            "sentiment-score": 0.06678773183375597
        },
        {
            "id": "c43ae83e-aae6-345a-a153-eb230b8be6f9",
            "summary": "(Bloomberg) -- With panic spreading in markets across the globe, world leaders raced over the weekend to make offers to US President Donald Trump to lower tariffs across the board. Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsWhat Would ‘Transportation Abundance’ Look Like?The pro",
            "date": "2025-04-07T13:16:12Z",
            "sentiment-score": -0.020276475697755814
        },
        {
            "id": "1f6f0dd9-c295-47f3-8bc1-13da4e12bd8a",
            "summary": "$9.5tn has been wiped off global share prices since the US president announced new trade levies.",
            "date": "2025-04-07T13:02:30Z",
            "sentiment-score": -0.9378651101142168
        },
        {
            "id": "2bfd5409-d150-3ba0-b7b1-6a8624079f85",
            "summary": "Madison Mills takes a closer look at the top stories as part of today's Market Minute. Big bank stocks, including JPMorgan (JPM) and Wells Fargo (WFC), are moving higher after an initial fall as analysts recalibrate their outlooks to account for mounting recession fears. Bitcoin (BTC-USD) is selling off as other crypto-related names, including Robinhood (HOOD), Strategy (MSTR), and Coinbase (COIN), are mixed today. Spirit Airlines (SAVEQ) stock is in focus after CEO Ted Christie stepped down. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-07T15:22:35Z",
            "sentiment-score": 0.02369101718068123
        },
        {
            "id": "60e0493e-897d-39f1-b6e6-324bd34f8e0b",
            "summary": "(Bloomberg) -- Bill Ackman said the US is “heading for a self-induced, economic nuclear winter.” Boaz Weinstein predicted the “avalanche has really just started.” And Jamie Dimon warned it “may be disastrous in the long run.”Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsWhat Would",
            "date": "2025-04-07T14:37:09Z",
            "sentiment-score": -0.019846586510539055
        },
        {
            "id": "e2c6e143-427e-3ba3-b56d-5c01bae545db",
            "summary": "(Bloomberg) -- The market chaos unleashed by Donald Trump’s trade war continued for a third day as stocks, bonds and commodities all swung wildly, buffeted by both fears of a recession and speculation the financial damage will drive him to change course. Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Hot Press Is the Low-Tech Laundry Tr",
            "date": "2025-04-07T16:20:12Z",
            "sentiment-score": -0.033771105110645294
        },
        {
            "id": "31bdb2f2-c7a8-3eba-a9e6-2d1cba8842f5",
            "summary": "(Bloomberg) -- Signs of exhaustion are emerging in the US bond market after its biggest weekly rally since August.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsTrump Order on CDFI Fund Risks Aid for Small Businesses, HousingUS Treasuries weakened in a volatile trading session on Mo",
            "date": "2025-04-07T14:49:43Z",
            "sentiment-score": -0.19451847672462463
        },
        {
            "id": "6332cd35-98de-364b-944f-dfa8b371d3bd",
            "summary": "JPMorgan Chase's CEO emphasized his concerns about geopolitical conflict and brought up recent culture shifts at the bank in his annual letter to shareholders.",
            "date": "2025-04-07T18:01:54Z",
            "sentiment-score": 0.0706881619989872
        },
        {
            "id": "d419d0f4-cd47-33da-baf5-2e667605f46a",
            "summary": "Financial stocks, like Goldman Sachs (GS), Jefferies (JEF), and Evercore (EVR), are in focus after Morgan Stanley downgraded its outlook for several names in the sector. Yahoo Finance Banking Reporter David Hollerith sits down with Julie Hyman and Trader Talk podcast host Kenny Polcari to check in on the financial sector ahead of earnings. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
            "date": "2025-04-07T21:05:21Z",
            "sentiment-score": -0.05908446945250034
        },
        {
            "id": "c86d555a-fa69-321b-8e9e-557e571c1e1d",
            "summary": "JPMorgan Chase CEO Jamie Dimon urged executives to embrace discomfort, stay curious, study competitors, and lead with humility in his latest shareholder letter.",
            "date": "2025-04-07T18:55:51Z",
            "sentiment-score": 0.039879072457551956
        },
        {
            "id": "5c044606-b8d6-37af-afbb-23270a2c15aa",
            "summary": "(Bloomberg) -- US equity rebounded from a three-day selloff as dip buyers emerged after fears of a trade-war induced recession wiped out more than $5 trillion of stock-market value.Most Read from BloombergThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideHousing Agency Aims to Relocate Its DC HeadquartersTrump Order on CDFI Fund Risks Aid for Small Businesses, HousingBoston Mayor Wu Embraces Trump Resistance as Campaign",
            "date": "2025-04-08T13:31:10Z",
            "sentiment-score": 0.17353442683815956
        },
        {
            "id": "a8493653-6b8e-3929-b9c0-2c72f8f7c739",
            "summary": "(Bloomberg) -- US stocks soared Tuesday after the biggest three-day rout in five years, fueled by the most oversold conditions since the depths of the pandemic and optimism the Trump administration will water down its harsh tariff regime.Most Read from BloombergThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideHousing Agency Aims to Relocate Its DC HeadquartersTrump Order on CDFI Fund Risks Aid for Small Businesses, Hou",
            "date": "2025-04-08T13:31:08Z",
            "sentiment-score": 0.2751981485635042
        },
        {
            "id": "71b0c0db-e3c9-34b7-9878-3cd0d70ec421",
            "summary": "JPMorgan Chase & Co. (JPM) concluded the recent trading session at $214.05, signifying a +1.79% move from its prior day's close.",
            "date": "2025-04-07T21:45:15Z",
            "sentiment-score": 0.8706334112212062
        },
        {
            "id": "17943da4-12a9-3c66-8e30-c97dc7bb0b51",
            "summary": "We recently published a list of Jim Cramer’s Game Plan: 10 Stocks in Focus. In this article, we are going to take a look at where JPMorgan Chase & Co. (NYSE:JPM) stands against other stocks in Jim Cramer’s focus. On Friday, Jim Cramer, the host of Mad Money, commented on the current state of the […]",
            "date": "2025-04-08T14:29:15Z",
            "sentiment-score": -0.01568695530295372
        },
        {
            "id": "fbe15d41-c691-474d-b721-a4d742e7226b",
            "summary": "The Trump tariff turmoil triggered new signs of stress on Wall Street, from a freeze in IPOs to a pause in bond sales to a widening of credit spreads.",
            "date": "2025-04-08T16:08:57Z",
            "sentiment-score": -0.8903488982468843
        },
        {
            "id": "6a158617-b48a-3d9e-b9be-a00b68ccd155",
            "summary": "(Bloomberg) -- Stocks headed toward their biggest gain since November and bonds fell after Treasury Secretary Scott Bessent fueled hopes of trade deals, marking a dramatic shift in Wall Street sentiment following a selloff that chopped trillions of dollars off global markets.Most Read from BloombergThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideTrump Order on CDFI Fund Risks Aid for Small Businesses, HousingBoston Ma",
            "date": "2025-04-08T16:28:45Z",
            "sentiment-score": -0.07079562544822693
        },
        {
            "id": "121c3291-34a2-33b8-9503-2fd4293affab",
            "summary": "Among them are several longtime hedge-fund managers such as Stan Druckenmiller.  “I do not support tariffs exceeding 10%,” he posted on X.  Also on X, Dan Loeb praised an analysis by the American Enterprise Institute that said Trump’s tariff formula “makes no economic sense.”",
            "date": "2025-04-08T15:43:51Z",
            "sentiment-score": 0.0758126750588417
        },
        {
            "id": "3825f423-5808-4675-8786-4ec91582951b",
            "summary": "Bill Ackman’s public campaign to slow down the rollout of President Trump’s tariffs continued Tuesday as the billionaire again took to social media to advocate for a pause.",
            "date": "2025-04-08T19:12:06Z",
            "sentiment-score": -0.6521156542003155
        },
        {
            "id": "95f263c0-c363-3ad6-98bc-41cc880c9666",
            "summary": "JPMorgan Chase (NYSE: JPM) Chief Executive Officer Jamie Dimon is one of the most respected voices on Wall Street.  Dimon leads the nation's largest bank by assets, and he successfully steered JPMorgan Chase through the great financial crisis without needing a bailout.  The company and Wall Street analysts often refer to the company's \"fortress\" balance sheet, a nod to Dimon's canny risk management.",
            "date": "2025-04-09T09:59:00Z",
            "sentiment-score": 0.043138415552675724
        },
        {
            "id": "71f662b1-b197-34be-9189-079192f24064",
            "summary": "JPMorgan Chase CEO Jamie Dimon said on Wednesday that sweeping tariffs imposed by U.S. President Donald Trump will probably lead to a recession and defaults by borrowers, he told Fox Business' Mornings with Maria. \"So long as you have rates going up... inflation is sticky and credit spreads are gapping out, which they're going to, I think you'll see more credit problems,\" Dimon said.",
            "date": "2025-04-09T12:50:51Z",
            "sentiment-score": -0.9226776892319322
        },
        {
            "id": "1fdf675e-3702-325c-8bbc-c13a8d7ccc0b",
            "summary": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.President Donald Trump’s so-called reciprocal tariffs are now in place, dealing a thunderous blow to the world economy as he pushes forward efforts to drastically reorder global trade.Trump’s latest tariffs push levies imposed on China this year to as high as 104%, along with import taxes on roughly 60 trading partners that run trade surpluses with the US. That comes after a 10% baseline tariff for most US t",
            "date": "2025-04-09T11:27:35Z",
            "sentiment-score": 0.24776166677474976
        },
        {
            "id": "30d6b22f-cc5a-46f1-bb75-1144bfd8798a",
            "summary": "Opposing views on president Trump's tariffs persist, even among his supporters.",
            "date": "2025-04-09T13:19:16Z",
            "sentiment-score": -0.7930512800812721
        },
        {
            "id": "a3b4073e-cf6b-3c9f-8915-5acaa3968de0",
            "summary": "Trump tariff news: President Trump's latest tariffs took effect Wednesday while China stepped up retaliation. Treasury yields are worrisome. Walmart and Delta Air pulled some guidance, citing tariff uncertainty.",
            "date": "2025-04-09T13:31:49Z",
            "sentiment-score": -0.931397270411253
        },
        {
            "id": "5df42bde-0549-3ff3-a426-79929dd953bb",
            "summary": "Nvidia (NVDA) stock “is pretty underappreciated now,” Tom Plumb, the president of Plumb Funds, told Schwab Network recently. Plumb also noted that he had recently bought JPMorgan (JPM) stock. NVDA Is Key to “the Digital Revolution,” Plumb Says NVDA is “really fueling all aspects of the digital revolution,” the investor stated. It’s involved in AI […]",
            "date": "2025-04-09T13:28:18Z",
            "sentiment-score": -0.11321691051125526
        },
        {
            "id": "fa30940b-b863-4f0e-9815-4e93d35592b5",
            "summary": "JPMorgan Chase CEO Jamie Dimon called a US recession a 'likely outcome' and warned that a negative market reaction to Trump trade policies 'could get worse if we don't make some progress.'",
            "date": "2025-04-09T14:40:55Z",
            "sentiment-score": -0.9428852126002312
        },
        {
            "id": "91a336f8-0602-349d-a516-3399c545a65b",
            "summary": "(Bloomberg) -- An exchange-traded product tied to declines in the oil market just saw its biggest outflow of funds since 2020. With crude prices crashing to a four-year low, some investors pulled out of the fund to cash in on profits.Oil has been hit by the one-two punch of OPEC+ choosing to ramp up output hours after US President Donald Trump last week unveiled a spate of trade policies that were especially punishing to major crude-importing economies, including China and India. Futures in New",
            "date": "2025-04-09T14:18:49Z",
            "sentiment-score": -0.9096813136711717
        },
        {
            "id": "43e679f2-f2d5-38eb-bee2-320adcb6a15d",
            "summary": "JPMorgan Chase CEO Jamie Dimon said Wednesday that a recession is a “likely outcome” from Trump’s tariffs policy and the ensuing market fallout. “I am going to defer to my economists at this point but I think probably,” Dimon said during an appearance on Fox Business.",
            "date": "2025-04-09T13:04:44Z",
            "sentiment-score": -0.6660460084676743
        },
        {
            "id": "df30e966-ca6c-3f74-af84-163bb0669ddb",
            "summary": "JPMorgan Chase Chief Executive Jamie Dimon said he thinks a recession is a likely outcome from President Trump’s tariffs. Asked on Fox Business Wednesday morning if he expects a recession, he said, “I am going to defer to my economists at this point but I think probably.",
            "date": "2025-04-09T12:48:05Z",
            "sentiment-score": -0.7004564888775349
        },
        {
            "id": "7f6a5da2-39f1-311c-9a83-82fabf96c95e",
            "summary": "Dow Jones and other indexes were mixed amid intensifying trade wars between the U.S. and China. Nvidia and Tesla jumped.",
            "date": "2025-04-09T14:59:08Z",
            "sentiment-score": -0.8368391990661621
        },
        {
            "id": "93d8baf2-aa25-3b1b-abe4-8c6a60a77359",
            "summary": "Josh Lipton goes over some of the top trending stories on this segment of Market Minute. Apple (AAPL) stock rebounds after previous losses, though shares are down over 20% over the past five days. Oil futures (CL=F) are sliding due to the escalating trade war as China announced retaliatory tariffs of 84% on US goods, effective April 10th. Bank stocks, including JPMorgan (JPM), Wells Fargo (WFC), and Citigroup (C) are under pressure after JPMorgan Chase CEO Jamie Dimon warned that a US recession is likely. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-09T17:19:38Z",
            "sentiment-score": -0.939682612195611
        },
        {
            "id": "75ab3683-e9fb-3cf6-bd66-a2e6aff75722",
            "summary": "(Bloomberg) -- At Nike Inc. headquarters in Beaverton, Oregon, executives are trying to figure out how to best spread the pain of new tariffs.Nike, the factories that produce its goods, the wholesalers that sell the goods and ultimately shoppers will all likely share portions of the cost, according to a person familiar with the matter who asked not to be named discussing private conversations.The backbone of Nike’s supply chain is being threatened by President Donald Trump’s global tariff campai",
            "date": "2025-04-09T17:41:39Z",
            "sentiment-score": -0.5162789113819599
        },
        {
            "id": "b943e33a-d6c5-377e-8b64-9c87823a965c",
            "summary": "JPMorgan Chase CEO Jamie Dimon said on Fox Business that he thinks the markets are “right” in pricing in the uncertainty caused by President Trump’s tariffs.",
            "date": "2025-04-09T15:47:00Z",
            "sentiment-score": 0.807939425110817
        },
        {
            "id": "18d0d1e9-5a1b-3eee-91c3-29bfbc08a8af",
            "summary": "Bank earnings are underway, with JPMorgan Chase (JPM) and Morgan Stanley (MS) reporting solid first quarter beats. CFRA Research director of equity research Ken Leon joins Market Domination with Julie Hyman and Josh Lipton to take a closer look at bank earnings. To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
            "date": "2025-04-11T20:35:10Z",
            "sentiment-score": 0.09776225360110402
        },
        {
            "id": "8a29a2a3-478b-35c1-a470-55bafe05ee75",
            "summary": "JPMorgan Chase & Co (JPM) reports robust financial performance with an 8% revenue increase, despite rising credit costs and market challenges.",
            "date": "2025-04-12T07:00:45Z",
            "sentiment-score": 0.9266004292294383
        },
        {
            "id": "defa414e-2fb0-32fb-b5d4-a9e469153477",
            "summary": "There are many valid reasons for the market to remain focused on tariffs since so much is happening in the broader economy. But how are they affecting the earnings outlook for the coming periods?",
            "date": "2025-04-11T22:17:00Z",
            "sentiment-score": -0.05341042950749397
        },
        {
            "id": "4416b0d6-22d5-3af7-bd54-b4142925194e",
            "summary": "(Bloomberg) -- Wall Street’s gyrations shook markets anew, with stocks erasing losses to notch their best week since 2023. The rally came as a rout in bonds and the dollar abated, following a few chaotic days that underscored fears foreign investors are beating a retreat from American assets.Most Read from BloombergThe Secret Formula for Faster TrainsIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapMidtown Office Building Evacuated on Concerns of Wall CollapseNYC Tourist Helicopter Cr",
            "date": "2025-04-11T21:27:04Z",
            "sentiment-score": 0.04850633442401886
        },
        {
            "id": "079652bc-adbf-31be-ad27-aebdee0be468",
            "summary": "The company repurchased $7.1 billion in stock and increased its dividend by 12%.",
            "date": "2025-04-11T21:15:49Z",
            "sentiment-score": 0.9113826351240277
        },
        {
            "id": "0b73e16c-3c2d-3677-b0a9-a94b30892f4f",
            "summary": "We recently published a list of the 11 Cheap NYSE Stocks to Invest in According to Hedge Funds. In this article, we are going to take a look at where JPMorgan Chase & Co. (NYSE:JPM) stands against other cheap NYSE stocks. On March 26, Jack Caffrey of JPMorgan Asset Management provided an analysis of market […]",
            "date": "2025-04-11T20:45:24Z",
            "sentiment-score": 0.007312223315238953
        },
        {
            "id": "d569afda-6bbf-3713-aceb-176be2a23d69",
            "summary": "The major indexes made robust progress Friday afternoon following Thursday's big losses. Nvidia climbed as Tesla fell.",
            "date": "2025-04-11T20:32:32Z",
            "sentiment-score": 0.7227031132206321
        },
        {
            "id": "13333978-29fe-3390-a41d-0a0f4ec61b54",
            "summary": "Shares of JPMorgan Chase (NYSE: JPM) rallied 4% on Friday, well above the market's return.  The country's largest bank released its earnings today, which beat analyst expectations.  In the first quarter, JPMorgan saw net managed revenue rise 8% year over year to $46.0 billion, while adjusted (non-GAAP) earnings per share, adjusted for one-time costs, was $4.91, about $0.27 higher than expected.",
            "date": "2025-04-11T20:31:14Z",
            "sentiment-score": 0.9169108541682363
        },
        {
            "id": "2112a1f6-e1c4-33a8-b4b0-d997309d8bd7",
            "summary": "(Bloomberg) -- JPMorgan Chase & Co. Chief Executive Officer Jamie Dimon said he expects “a kerfuffle” in the US Treasury market that prompts a Federal Reserve intervention. Most Read from BloombergThe Secret Formula for Faster TrainsIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapMidtown Office Building Evacuated on Concerns of Wall CollapseNYC Tourist Helicopter Crashes in Hudson River, Killing SixEven Oslo Has an Air Quality Problem“There will be a kerfuffle in the Treasury markets",
            "date": "2025-04-11T17:51:39Z",
            "sentiment-score": -0.8385891765356064
        },
        {
            "id": "b4cf73ec-6738-3bb2-963c-11919bfdb54e",
            "summary": "JPMorgan Chase (NYSE:JPM) announced robust Q1 2025 earnings, showcasing growth in net income and earnings per share compared to last year. Despite this strong performance, last week the stock experienced a flat price move of 0.69%. This aligns with the overall market's flat trajectory, influenced by global tariff developments and market volatility. Investors were evaluating several macroeconomic factors, including trade war impacts and inflation concerns, which have spurred uncertainty. Yet,...",
            "date": "2025-04-11T17:25:26Z",
            "sentiment-score": 0.8576405541971326
        },
        {
            "id": "90259501-f143-31c1-85a8-54bebb5532c7",
            "summary": "JPMorgan Chase (NYSE:JPM) announced a strong first-quarter earnings report for 2025, revealing impressive growth in net income and earnings per share compared to the previous year. These positive results likely added weight to the stock's 12% price increase over the past week. During this period, the market itself rose by 5%, indicating that broader market trends may also have contributed to JPM's performance. The solid financial performance underscored the company's resilience, amplifying...",
            "date": "2025-04-12T17:21:49Z",
            "sentiment-score": 0.9258141247555614
        },
        {
            "id": "feb56f07-0127-342c-9557-74d9d0ebd1df",
            "summary": "The Treasury market helps the global economy go-round, and Wall Street is watching closely for signs the Fed may need to intervene.",
            "date": "2025-04-12T12:41:00Z",
            "sentiment-score": 0.06860856711864471
        }
    ]
}