{
    "ticker": "KO",
    "total_news": 26,
    "average_sentiment": 0.08926493672725673,
    "weighted_average_sentiment": 0.03726236345060171,
    "average_daily_sentiments": [
        -0.001062050461769104,
        -0.24063070374540985,
        0.14360213046893477,
        0.23133598985150455,
        0.049274518354130645,
        0.356074760047098,
        0.10686077538412064
    ],
    "news": [
        {
            "id": "e997534b-95af-3877-ae66-29c812aac332",
            "summary": "The stock of Coca-Cola (NYSE: KO) is trouncing the market this year, up 16% while the S&P 500 is down 4%.  Now is when you get to see what investors prize in this kind of stock: stability and a dividend, which are hard to beat.  Coca-Cola is one of investing legend Warren Buffett's favorite stocks.",
            "date": "2025-04-06T09:56:00Z",
            "sentiment-score": 0.02134694904088974
        },
        {
            "id": "664f311c-a84f-351e-b2ca-9e6f89928322",
            "summary": "The beverage giant is a good safe haven stock for this volatile market.",
            "date": "2025-04-06T08:55:00Z",
            "sentiment-score": 0.29814013466238976
        },
        {
            "id": "e0777baa-dfcc-3fb6-b56b-d53a635bc0cd",
            "summary": "Dividend King Coca-Cola (NYSE: KO) is a consumer staples giant that fits that bill.  Coca-Cola owns one of the most recognized brands in the world, with lots going for it.  There's a reason why Warren Buffett has owned Coca-Cola within Berkshire Hathaway for decades.",
            "date": "2025-04-06T08:05:00Z",
            "sentiment-score": 0.07874560775235295
        },
        {
            "id": "c4d565ac-fc75-37d0-9c84-b00e978c4098",
            "summary": "Coca-Cola (NYSE: KO) and PepsiCo (NASDAQ: PEP) have a long-standing rivalry as each has battled for the hearts, minds, and wallets of consumers.  Stock analysis may not have the entertainment value of the companies' commercials, but which one, Coca-Cola or PepsiCo, deserves your investment dollars?  Coca-Cola started selling its namesake brand in 1886, and it remains a pure beverage company.",
            "date": "2025-04-06T16:35:00Z",
            "sentiment-score": 0.029210410080850124
        },
        {
            "id": "7d99afc4-e05a-3405-877e-814d1cbd5133",
            "summary": "Last week, our time-tested methodologies served investors well in navigating the market. Check out some of our achievements from the past three months.",
            "date": "2025-04-07T12:33:00Z",
            "sentiment-score": 0.14916840195655823
        },
        {
            "id": "9c13626a-dd8b-3c32-9449-e4c49cc321b0",
            "summary": "Coca-Cola, Hyatt, Sealed Air, Starbucks and Wyndham recently reached agreements with shareholder advocates. Proposals remain pending at Amazon, Home Depot, Kraft Heinz, Mondelez, PepsiCo and Wendy’s.",
            "date": "2025-04-07T10:48:00Z",
            "sentiment-score": 0.06590215675532818
        },
        {
            "id": "bc5f7cf2-3a6a-3050-9a6f-a5511cb16737",
            "summary": "Coca-Cola (KO) stock hit a 52-week peak of $73 a share last Thursday and is sitting on +9% gains this year compared to the S&P 500's 14% decline.",
            "date": "2025-04-07T19:25:00Z",
            "sentiment-score": 0.8531537214294076
        },
        {
            "id": "0efd8c19-0a8c-3538-b673-edfe1e10ef11",
            "summary": "Due to his success -- both personally and through his company, Berkshire Hathaway -- Warren Buffett draws a lot of attention when he speaks and makes investing moves.  With Buffett's net worth of over $150 billion and Berkshire Hathaway's market cap of over $1 trillion (as of April 7), it's easy to see why.  People often look to Berkshire Hathaway's stock portfolio to get inspiration for investments they may want to consider, especially during turbulent market times like we're witnessing now.",
            "date": "2025-04-08T11:38:00Z",
            "sentiment-score": 0.012662852182984352
        },
        {
            "id": "4268a88c-93af-39b4-b4b2-118a616487f2",
            "summary": "For the week, it was down just 0.6% compared to a 7.9% decline in the Dow Jones Industrial Average (DJINDICES: ^DJI), a 9.1% sell-off in the S&P 500 (SNPINDEX: ^GSPC), and a 10% decline in the Nasdaq Composite (NASDAQINDEX: ^IXIC).  Here's why Coca-Cola is holding its ground and whether the dividend stock seems worth buying now.  This outperformance may come as a surprise given it is a global company.",
            "date": "2025-04-08T10:47:00Z",
            "sentiment-score": -0.9492672989144921
        },
        {
            "id": "7687faed-9dd8-3941-b83d-3ed6bd8cca21",
            "summary": "Coca-Cola, PepsiCo, Berkshire Hathaway and Blackrock have been highlighted in this Investment Ideas article.",
            "date": "2025-04-08T08:42:00Z",
            "sentiment-score": 0.006119249388575554
        },
        {
            "id": "abf401fd-ab30-300c-9d43-e97541276051",
            "summary": "Warren Buffett's talent for growing piles of money lies in finding competitively positioned businesses that can weather the occasional hiccup in the economy and keep growing.  With economic uncertainty weighing on the stock market, investors can find solid stocks to buy in the portfolio of Buffett's Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B).",
            "date": "2025-04-08T08:35:00Z",
            "sentiment-score": 0.4937940873205662
        },
        {
            "id": "74685903-22e2-3643-b34b-6dbaaddb62c6",
            "summary": "We recently published a list of 10 Best Stocks to Buy According to Billionaire Steve Cohen. In this article, we are going to take a look at where The Coca-Cola Company (NYSE:KO) stands against other best stocks to buy according to billionaire Steve Cohen. Steve Cohen, a prominent figure in the world of hedge funds, […]",
            "date": "2025-04-08T18:51:02Z",
            "sentiment-score": 0.029160038102418184
        },
        {
            "id": "1bbc894c-6864-3966-9b1b-1fbfb23a4223",
            "summary": "Today's Research Daily features new research reports on 16 major stocks, including Walmart Inc. (WMT), The Coca-Cola Company (KO) and HSBC Holdings plc (HSBC), as well a micro-cap stock Friedman Industries Inc. Common Stock (FRD).",
            "date": "2025-04-08T20:31:00Z",
            "sentiment-score": 0.008607279509305954
        },
        {
            "id": "89b6d11b-68f5-3f6f-97a2-3e560794a512",
            "summary": "Coca-Cola (KO) reachead $68.42 at the closing of the latest trading day, reflecting a +0.07% change compared to its last close.",
            "date": "2025-04-08T21:50:15Z",
            "sentiment-score": 0.7438454208895564
        },
        {
            "id": "cc9c84eb-0edf-300d-a59e-9b3e157e3bd3",
            "summary": "Walmart, Coca-Cola, HSBC and Friedman Industries are included in this Analyst Blog.",
            "date": "2025-04-09T10:59:00Z",
            "sentiment-score": -0.0031904885545372963
        },
        {
            "id": "7a80523e-a9b5-3d53-8dfa-da6cb6724e82",
            "summary": "We recently published a list of 10 Defensive Stocks Billionaire Ken Fisher is Betting On. In this article, we are going to take a look at where The Coca-Cola Company (NYSE:KO) stands against other defensive stocks billionaire Ken Fisher is betting on. Ken Fisher, an American billionaire investor, author, and financial analyst, founded and runs Fisher Asset Management. […]",
            "date": "2025-04-09T16:21:51Z",
            "sentiment-score": 0.005490768700838089
        },
        {
            "id": "97389525-bc2c-4183-9320-98dd1630dacf",
            "summary": "Constellation Brands CEO Bill Newlands warns of the impact to his company's business from the Trump administration's policies.",
            "date": "2025-04-11T16:43:33Z",
            "sentiment-score": -0.9115050071850419
        },
        {
            "id": "6421f649-051d-3a2e-b414-8e38bffc31be",
            "summary": "Other investors are likely to see the market declines as an opportunity to get aggressive and buy, perhaps picking up an ultra-high-yield stock like AGNC Investment (NASDAQ: AGNC).  It's better to cut the middle and go with a different type of investment.  AGNC Investment's gargantuan yield could be a siren call to dividend investors who think they are picking up a stock that will provide them with reliable income for the rest of their lives.",
            "date": "2025-04-12T07:05:00Z",
            "sentiment-score": -0.001062050461769104
        },
        {
            "id": "8daa890b-d5fc-3a5f-b9a1-0cc07836ab81",
            "summary": "In times of uncertainty, investors turn to areas of relative certainty, and one such area is Warren Buffett's mastery of investing when others are fearful.  Consequently, it makes sense to look into what Buffett is holding in his Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) investment portfolio.  If you want to gain market exposure at such a challenging time, why not buy into Berkshire Hathaway stock and let Buffett carry the strain while you wait for more certainty on the fallout from the tariff escalations?",
            "date": "2025-04-11T14:15:00Z",
            "sentiment-score": 0.011278172954916954
        },
        {
            "id": "0f298edd-876b-33fb-a658-b12603e508e0",
            "summary": "Here is how Coca-Cola European (CCEP) and Pilgrim's Pride (PPC) have performed compared to their sector so far this year.",
            "date": "2025-04-11T13:40:14Z",
            "sentiment-score": -0.0223388671875
        },
        {
            "id": "a34f98a3-d5f6-4d3b-a0a9-9a3d7940c1d1",
            "summary": "A bearish call that is staying in place.",
            "date": "2025-04-11T12:40:02Z",
            "sentiment-score": -0.039957113564014435
        },
        {
            "id": "47eb5361-7784-3c55-8f54-f2380bcd01b2",
            "summary": "In the closing of the recent trading day, Coca-Cola (KO) stood at $70.76, denoting a +1.16% change from the preceding trading day.",
            "date": "2025-04-10T21:45:13Z",
            "sentiment-score": 0.7225788785144687
        },
        {
            "id": "2c4ac22e-6f93-30cd-9996-fe0060e0545a",
            "summary": "The European Commission had conducted inspections at the premises of companies active in the non-alcoholic drinks sector and had also quizzed an unidentified personal care company in March over concerns of possible curbs on the trade of goods across Europe and carving up markets.  EU officials have sent over a questionnaire to P&G and are collecting evidence from competitors and customers, the Bloomberg report said.  No formal allegations have been made against Procter & Gamble.",
            "date": "2025-04-10T12:18:47Z",
            "sentiment-score": -0.4353746175765991
        },
        {
            "id": "22573489-852f-3ff8-bdbf-3861bd645c44",
            "summary": "Coca-Cola (NYSE: KO) is one of the best-known consumer staples companies on the planet and has an incredible dividend track record.  At a time of elevated market volatility, owning a stock like Coca-Cola can help investors sleep well at night.  Coca-Cola, with its namesake soda and a host of other beverage products, has a global reach and loyal customers.",
            "date": "2025-04-09T22:59:00Z",
            "sentiment-score": 0.549091512337327
        },
        {
            "id": "19e6259b-d8c5-35ce-a66d-cd1f8ea446c3",
            "summary": "Warren Buffett certainly knows how to pick 'em.  While the investing community reels from the impact of President Trump's tariff program, many Buffett stocks are beating the market.  Consider how Coca-Cola (NYSE: KO) stock and Kroger stock (NYSE: KR) are faring as compared with the S&P 500 this year.",
            "date": "2025-04-09T22:32:00Z",
            "sentiment-score": 0.4172915630042553
        },
        {
            "id": "65d8d4c5-b7a5-35e7-a692-19fcd2d8888f",
            "summary": "Coca-Cola (NYSE: KO) is a very well-run company, highlighted by its status as a Dividend King.  Yes, it is a reliable and safe dividend stock, but it probably isn't worth chasing an overvalued stock if you are trying to find a safe haven during the current market storm.  You'll be far better off looking at dividend stocks that are more attractively priced like Realty Income (NYSE: O), Hershey (NYSE: HSY), and Coca-Cola competitor PepsiCo (NASDAQ: PEP).",
            "date": "2025-04-09T22:05:00Z",
            "sentiment-score": 0.18799659376963973
        }
    ]
}