{
    "ticker": "MCD",
    "total_news": 15,
    "average_sentiment": 0.07708519181857507,
    "weighted_average_sentiment": -0.014912748262928457,
    "average_daily_sentiments": [
        0,
        -0.20932960545178503,
        0.028724329080432653,
        0.645179889164865,
        -0.4702665942410628,
        0.5116449178506931,
        0.5438454989343882
    ],
    "news": [
        {
            "id": "00e21820-e4ee-3d65-99ec-2c8c9446b005",
            "summary": "We recently published a list of Jim Cramer Reveals What’s Next After Tariffs & Discusses These 10 Stocks. In this article, we are going to take a look at where McDonald’s Corporation (NYSE:MCD) stands against other stocks that Jim Cramer discusses. In his appearance on CNBC’s Squawk on the Street on Thursday, the day after […]",
            "date": "2025-04-05T22:46:00Z",
            "sentiment-score": 0.0065317219123244286
        },
        {
            "id": "c526b6af-5484-38e2-8227-13d829d181cb",
            "summary": "The main point of investing for the long term is to make money. Better yet, you'd like to see the share price move up...",
            "date": "2025-04-06T11:00:25Z",
            "sentiment-score": 0.5438454989343882
        },
        {
            "id": "a14fad2b-037d-390f-a012-d10712097ef4",
            "summary": "Starbucks' ability to reconnect with customers, improve in-store operations, and drive long-term brand loyalty should support a sustainable recovery over time.",
            "date": "2025-04-07T14:01:00Z",
            "sentiment-score": 0.9198814518749714
        },
        {
            "id": "e5461629-62d6-35ae-8d4e-26cd9d249c84",
            "summary": "We recently published a list of the 8 Most Profitable Dividend Stocks to Buy Now. In this article, we are going to take a look at where McDonald’s Corporation (NYSE:MCD) stands against other profitable dividend stocks. When it comes to profits, dividend investing is the first thing that springs to mind. Dividends represent a portion of […]",
            "date": "2025-04-07T18:24:19Z",
            "sentiment-score": 0.009412447921931744
        },
        {
            "id": "eaa7b143-2715-35d2-8d82-f6400cbbe0d8",
            "summary": "The stock market sell-off has intensified, with the Dow Jones Industrial Average and S&P 500 both down over 10% from their recent highs and the Nasdaq Composite down over 20% as of this writing-- putting the growth-heavy index in a bear market.  In fact, fast-food giant McDonald's (NYSE: MCD) hit an all-time high in March and is up slightly year-to-date at the time of this writing.  Here's why the Dow Jones component is well positioned to endure tariffs and why the dividend stock could be worth buying now.",
            "date": "2025-04-08T11:21:00Z",
            "sentiment-score": -0.9143479214981198
        },
        {
            "id": "9ee543a3-7f23-3e66-81be-8efa22ec9b9f",
            "summary": "McDonald's (MCD) closed at $299.89 in the latest trading session, marking a -0.07% move from the prior day.",
            "date": "2025-04-07T21:50:16Z",
            "sentiment-score": 0.6056408537551761
        },
        {
            "id": "de4e63b0-02ee-3e81-97d7-37012f3aa43b",
            "summary": "While the Dow Jones represents industry leaders, not every stock in the index is a safe bet. Some are facing headwinds like declining demand, rising costs, or disruptive new competitors.",
            "date": "2025-04-08T14:25:50Z",
            "sentiment-score": -0.9211565619334579
        },
        {
            "id": "7a23df2d-f740-4b2f-abdf-fe04fa592059",
            "summary": "Store expansion and a comeback of the China market is the hope; tariff backlash could shutter that.",
            "date": "2025-04-08T20:03:00Z",
            "sentiment-score": 0.4247047007083893
        },
        {
            "id": "ffab511e-6ed1-30c8-ad7a-53361535991f",
            "summary": "LOCO's ability to manage costs, adapt to evolving consumer preferences, and maintain a differentiated brand identity should support growth.",
            "date": "2025-04-09T14:04:00Z",
            "sentiment-score": 0.8654753379523754
        },
        {
            "id": "bcbf34d4-e429-3459-8d71-5869e3843bef",
            "summary": "Madison Mills and Yahoo Finance Executive Editor Brian Sozzi outline what's driving interest in some of the trending tickers on Yahoo Finance's platform. Citi analysts cut their Nvidia (NVDA) price target to $150 per share, citing reduced chip sales in 2025 and 2026 due to the trade war. Jefferies analysts outline their top defensive retail and consumer-facing picks, including Uber (UBER), Exxon (XOM), McDonald's (MCD), and Netflix (NFLX). Logitech (LOGI) withdraws its full-year 2026 guidance, citing tariff uncertainty. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
            "date": "2025-04-11T15:02:02Z",
            "sentiment-score": -0.9343402707017958
        },
        {
            "id": "1b48f809-bf70-3cdb-8b3c-410fac04c433",
            "summary": "The National Center for Public Policy Research, a McDonald's shareholder, pushed the fast food giant to consider it, despite a lack of interest.",
            "date": "2025-04-11T21:26:56Z",
            "sentiment-score": 0.11524050775915384
        },
        {
            "id": "5233fd82-716a-3341-9823-41e641010a11",
            "summary": "We recently published a list of 10 Best Food Stocks to Buy According to Billionaires. In this article, we are going to take a look at where McDonald’s Corporation (NYSE:MCD) stands against other best food stocks to buy according to billionaires. A significant contributor to the global economy, the food business has changed over time […]",
            "date": "2025-04-11T18:47:39Z",
            "sentiment-score": 0.021738454699516296
        },
        {
            "id": "a34f98a3-d5f6-4d3b-a0a9-9a3d7940c1d1",
            "summary": "A bearish call that is staying in place.",
            "date": "2025-04-11T12:40:02Z",
            "sentiment-score": -0.039957113564014435
        },
        {
            "id": "e5f4f3bd-878b-3097-b711-79359e8b9e59",
            "summary": "What trends should we look for it we want to identify stocks that can multiply in value over the long term? Amongst...",
            "date": "2025-04-10T11:00:11Z",
            "sentiment-score": 0.028724329080432653
        },
        {
            "id": "2083fd5f-a1c0-3bb7-9b6d-6bc011615890",
            "summary": "In the closing of the recent trading day, McDonald's (MCD) stood at $303.58, denoting a +1.25% change from the preceding trading day.",
            "date": "2025-04-09T21:45:05Z",
            "sentiment-score": 0.4248844403773546
        }
    ]
}