{
    "ticker": "MRK",
    "total_news": 12,
    "average_sentiment": -0.4424858431642254,
    "weighted_average_sentiment": -0.4439786948955082,
    "average_daily_sentiments": [
        0,
        0.0010881340131163597,
        -0.6301269537458817,
        -0.6384864298161119,
        0.029778591357171535,
        -0.9559274455532432,
        0
    ],
    "news": [
        {
            "id": "f4d6079f-f84f-3c01-bfbd-4dbb8d14b6a4",
            "summary": "The past six months haven’t been great for Merck. It just made a new 52-week low of $79.69, and shareholders have lost 26.6% of their capital. This was partly due to its softer quarterly results and might have investors contemplating their next move.",
            "date": "2025-04-07T09:10:45Z",
            "sentiment-score": -0.9559274455532432
        },
        {
            "id": "cdc5860f-4d10-3f55-9797-9bc389b535f2",
            "summary": "Quarterly earnings results are a good time to check in on a company’s progress, especially compared to its peers in the same sector. Today we are looking at Organon (NYSE:OGN) and the best and worst performers in the branded pharmaceuticals industry.",
            "date": "2025-04-08T09:07:18Z",
            "sentiment-score": -0.336032435297966
        },
        {
            "id": "a4b082d4-d3e5-3d1d-8c66-df0c01b86afc",
            "summary": "Walgreens (WBA) stock is rising after the company reported better-than-expected second quarter earnings while preparing for privatization. Yahoo Finance Senior Health Reporter Anjalee Khemlani highlights the company's cost management strategy, CVS's (CVS) leadership changes amid similar challenges in the retail drug sector, and moves by US drug makers, like Merck (MRK), Johnson & Johnson (JNJ), and Eli Lilly (LLY), as they prepare for incoming tariffs. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
            "date": "2025-04-08T14:03:18Z",
            "sentiment-score": 0.4182991795241833
        },
        {
            "id": "5992a3b0-052f-3a00-9b42-f2b413b30595",
            "summary": "We recently published a list of 10 Defensive Stocks Billionaire Ken Fisher is Betting On. In this article, we are going to take a look at where Merck & Co., Inc. (NYSE:MRK) stands against other defensive stocks billionaire Ken Fisher is betting on. Ken Fisher, an American billionaire investor, author, and financial analyst, founded and runs Fisher […]",
            "date": "2025-04-08T22:15:07Z",
            "sentiment-score": 0.007069029845297337
        },
        {
            "id": "a3b4073e-cf6b-3c9f-8915-5acaa3968de0",
            "summary": "Trump tariff news: President Trump's latest tariffs took effect Wednesday while China stepped up retaliation. Treasury yields are worrisome. Walmart and Delta Air pulled some guidance, citing tariff uncertainty.",
            "date": "2025-04-09T13:31:49Z",
            "sentiment-score": -0.931397270411253
        },
        {
            "id": "be7d1b24-7c1e-38ff-91b2-281ea7807568",
            "summary": "Big pharmaceutical names plowed lower Wednesday after Trump on Tuesday said that tariffs would take direct aim at drug imports.",
            "date": "2025-04-09T13:08:24Z",
            "sentiment-score": -0.9341345755383372
        },
        {
            "id": "22407950-a8f9-3d18-b6ce-42a8911228cd",
            "summary": "Catalysts host Madison Mills and Trader Talk podcast host Kenny Polcari take a look at some of the day's top trending stocks. Apple (AAPL) is in focus after Microsoft (MSFT) replaced Apple as the most valuable company. Alibaba (BABA) reverses earlier gains after US tariffs went into effect. Drugmaker stocks, including Pfizer (PFE), Merck (MRK), and Eli Lilly (LLY), are falling after President Trump announced that pharmaceutical tariffs may be on the way. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
            "date": "2025-04-09T14:43:22Z",
            "sentiment-score": -0.6112148426473141
        },
        {
            "id": "42788375-b286-39dd-b048-683f4aab07b7",
            "summary": "Drugmaker stocks, including Eli Lilly (LLY), Johnson & Johnson (JNJ), Merck (MRK), and Pfizer (PFE), are under pressure on Wednesday after President Trump announced that he may impose tariffs on pharmaceutical imports. Yahoo Finance Senior Health Reporter Anjalee Khemlani joins Morning Brief to break down the details. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
            "date": "2025-04-09T14:11:57Z",
            "sentiment-score": -0.07719903066754341
        },
        {
            "id": "87d3ee81-4e05-3a55-901d-ef8152420f1a",
            "summary": "We recently published a list of Jim Cramer Recently Talked About These 9 Stocks. In this article, we are going to take a look at where Merck & Co., Inc. (NYSE: MRK) stands against other stocks that Jim Cramer discussed recently. On Wednesday, Jim Cramer, the host of Mad Money, shared his thoughts on the […]",
            "date": "2025-04-11T16:33:45Z",
            "sentiment-score": 0.0010881340131163597
        },
        {
            "id": "ec0da42a-1d30-3d09-b5c1-9c2aa3a210a4",
            "summary": "Merck (NYSE:MRK) recently experienced a significant corporate governance event when multiple shareholder proposals were announced, with the company recommending against them for the upcoming annual meeting. This development comes amid a general market downturn, underscored by the Dow and Nasdaq dropping 4% and 6%, respectively. Over the past week, Merck's share price has decreased by 5.42%, slightly exceeding the broader market's decline. The combination of these shareholder proposals and...",
            "date": "2025-04-10T17:23:17Z",
            "sentiment-score": -0.9394085304811597
        },
        {
            "id": "5788e167-ba2e-3f2d-8e9e-4bfb72e0e2c1",
            "summary": "Pharma stocks tumbled Thursday after the Trump administration said the delay for reciprocal tariffs doesn't apply to sector-specific tariffs.",
            "date": "2025-04-10T16:58:23Z",
            "sentiment-score": -0.9471217887476087
        },
        {
            "id": "3680ca98-ebf8-37ec-b129-d0888deb81ab",
            "summary": "We came across a bullish thesis on Merck & Co., Inc. (MRK) on Substack by Charly AI. In this article, we will summarize the bulls’ thesis on MRK. Merck & Co., Inc. (MRK)’s share was trading at $81.91 as of April 9th. MRK’s trailing and forward P/E were 12.15 and 9.10 respectively according to Yahoo Finance. Merck […]",
            "date": "2025-04-10T12:55:50Z",
            "sentiment-score": -0.0038505420088768005
        }
    ]
}