{
    "ticker": "NFLX",
    "total_news": 30,
    "average_sentiment": 0.09783777948468923,
    "weighted_average_sentiment": 0.0933404170758671,
    "average_daily_sentiments": [
        0.033594968263059855,
        0.0702962456853129,
        0,
        -0.007246575318276882,
        0.2646232153702941,
        0.003477210711155619,
        -0.07863620482385159
    ],
    "news": [
        {
            "id": "7719641a-d9b0-30fe-abc7-f0bf3f277f93",
            "summary": "The recent correction in the stock market is making many investors uneasy.  Amid several days of considerable sell-offs, shareholders are likely questioning past investments, and others may ask themselves whether they want to stay in the stock market at all.  Knowing that, three Fool.com contributors have ideas about where tech investors can turn for stability and long-term returns: Netflix (NASDAQ: NFLX), Spotify Technology (NYSE: SPOT), and the VanEck Semiconductor ETF (NASDAQ: SMH).",
            "date": "2025-04-06T11:45:00Z",
            "sentiment-score": -0.07863620482385159
        },
        {
            "id": "491ed742-7982-3c9e-b0c3-75073450f0ed",
            "summary": "Netflix (NASDAQ: NFLX) has been one of the best performing stocks this century.  Netflix deserves credit for completely disrupting the media industry.  By letting viewers select from a huge catalog of shows and movies, with the ability to watch whenever they wanted, Netflix provided a superior experience compared to traditional cable TV.",
            "date": "2025-04-07T11:15:00Z",
            "sentiment-score": 0.22161179035902023
        },
        {
            "id": "051c27e9-6150-348a-8ae6-126805678ec8",
            "summary": "Netflix and NVIDIA have been highlighted in this Investment Ideas article.",
            "date": "2025-04-07T09:47:00Z",
            "sentiment-score": 0.017444737255573273
        },
        {
            "id": "b0d4803f-e5d8-3aab-a9d5-e040fc2a0f55",
            "summary": "Both Netflix stock and Spotify stock are down 13% from their all-time highs amid the volatility in the broader market, but they are actually outperforming the Nasdaq-100 technology index, which has plummeted by almost 17% from its high.  Since it appears likely that trade tensions will persist for the foreseeable future, here's why investors with a spare $1,500 (money they don't need for immediate expenses) might want to buy one share of Netflix and one share of Spotify.  Netflix is the world's largest streaming platform for movies and TV shows, with 301.6 million subscribers as of the end of 2024.",
            "date": "2025-04-07T09:03:00Z",
            "sentiment-score": -0.9486311348155141
        },
        {
            "id": "c5225218-b550-462a-b025-be7f38940888",
            "summary": "The profit outlook for businesses has dimmed considerably post Trump tariff news.",
            "date": "2025-04-07T14:53:59Z",
            "sentiment-score": -0.4999271593987942
        },
        {
            "id": "c5b6c566-f5f1-3416-aa3c-73a17406c777",
            "summary": "Netflix (NFLX) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
            "date": "2025-04-07T13:00:13Z",
            "sentiment-score": 0.0199852017685771
        },
        {
            "id": "91762df4-54b3-30d7-b1b6-c71f3b1ed194",
            "summary": "Funds are buying Netflix and Philip Morris amid the Trump tariff stock market meltdown. Both stocks are near all-time highs.",
            "date": "2025-04-07T18:56:42Z",
            "sentiment-score": 0.31535322219133377
        },
        {
            "id": "a49cd7b9-49d8-379a-8fea-0322b450df9d",
            "summary": "As Disney, Warner Bros. Discovery and plenty of other media companies have seen their stocks get hit hard in the past few days, Spotify and Netflix are emerging relatively unscathed from the recent tariff-driven market mayhem.  Spotify shares closed up 3% Monday.  Netflix shares were up 1.4%.",
            "date": "2025-04-07T20:53:13Z",
            "sentiment-score": 0.8985038176178932
        },
        {
            "id": "b1c2c8bf-4529-3da1-a303-0589d605105b",
            "summary": "It could be Turnaround Tuesday for stocks after a bruising three-day stretch. Futures on the Dow Jones Industrial Average are jumping, as traders focus on the Trump administration reportedly beginning trade discussions with Japan. The S&P 500 and Nasdaq Composite are also set to open higher. President Trump's broad tariffs are set to kick in tomorrow, with many now seeing them as a negotiating tactic. China, however, vowed today to quote “fight to the end” on the tariff front.Here is what you need to know about the markets today:Levi’s puts investors through the spin cycle: Shares of&nbsp; the jeans maker surged 10% in early trading following better than expected quarterly earnings. The company maintained its full year profit outlook. Walmart is in focus: While Wall Street tries to estimate what tariffs could mean for companies, veteran retail analyst Greg Melich of EvercoreISI is estimating a worst-case scenario of tariffs on Walmart. Melich said, \"If 50% incremental [tariffs] on China and 20% rest of the world [tariffs] are maintained, AND no carrots of tax cuts or deregulation are implemented, we estimate the EPS pressure for Walmart of 2% could grow 3x higher.\" BrIIt could be the year of lost profits for companies due to tariffs: The bottom up consensus earnings per share expectation for the S&P 500 assumes 9.6% growth. Some of the biggest EPS gains are seen in tech darlings Nvidia, Broadcom, Netflix and Microsoft. But long-time strategist Adam Parker at Trivariate Research says investors no longer believe those numbers. Parker thinks the tariffs are such a headwind, investors may see NO earnings growth for the S&P 500.",
            "date": "2025-04-08T11:37:55Z",
            "sentiment-score": 0.20111581683158875
        },
        {
            "id": "55c9ed02-3f3e-3b8c-b85b-b4982c837a53",
            "summary": "The cup with handle is a simple base pattern that leads to successful breakouts. Netflix gained 39% after breaking out from a cup with handle's buy point in 2023.",
            "date": "2025-04-08T13:00:57Z",
            "sentiment-score": 0.8055367930792272
        },
        {
            "id": "ffd41a25-91d1-3f9c-8466-e85d2db05950",
            "summary": "Investing.com -- Morgan Stanley has named Netflix (NASDAQ:NFLX) its new Top Pick in the Media & Entertainment sector, replacing Walt Disney (NYSE:DIS).",
            "date": "2025-04-08T12:28:32Z",
            "sentiment-score": 0.7957404758781195
        },
        {
            "id": "b8cf4522-8f62-3832-b74a-977925a7f643",
            "summary": "Meghan, Duchess of Sussex, talks to Fortune about launching consumer brand As Ever and the release of her new podcast, right as tariffs rock the markets.",
            "date": "2025-04-08T10:30:00Z",
            "sentiment-score": 0.038057878613471985
        },
        {
            "id": "8a750d51-b800-3f46-b24a-e4c408b80ab5",
            "summary": "We recently published a list of 10 Best Fundamental Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Netflix, Inc. (NASDAQ:NFLX) stands against other best fundamental stocks to buy according to billionaires. As per Fitch Ratings, the US tariffs are now at levels that continue to transform […]",
            "date": "2025-04-08T02:33:31Z",
            "sentiment-score": 0.06015987414866686
        },
        {
            "id": "feffc5e3-273a-39cd-823a-92f13fb55327",
            "summary": "JPMorgan slashed its price targets on 25 companies in the internet space, citing macroeconomic issues, Schwab Network recently reported. Among the most prominent names whose price targets were slashed by the bank are Meta (META), Amazon (AMZN), Alphabet (GOOG), and Netflix (NFLX). Some of the Highest-Profile Target Cuts The bank reduced its price target on […]",
            "date": "2025-04-08T16:30:10Z",
            "sentiment-score": -0.9281390681862831
        },
        {
            "id": "ad5de33d-d4b3-385a-aeb4-0129bdf7b423",
            "summary": "Netflix stock rose Tuesday after Morgan Stanley called the internet television network its \"top pick\" among media and entertainment stocks.",
            "date": "2025-04-08T17:09:28Z",
            "sentiment-score": 0.9071639496833086
        },
        {
            "id": "4236a7fc-7821-3700-8f1f-77b3935c7e67",
            "summary": "Netflix spends significantly in local economies around the world, and its content is closely watched. That makes harsh trade actions a political liability.",
            "date": "2025-04-08T16:48:00Z",
            "sentiment-score": -0.32132694125175476
        },
        {
            "id": "558fedce-8541-3133-8073-825f960030ca",
            "summary": "Earnings results often indicate what direction a company will take in the months ahead. With Q4 behind us, let’s have a look at Booking (NASDAQ:BKNG) and its peers.",
            "date": "2025-04-09T09:10:07Z",
            "sentiment-score": 0.013729277066886425
        },
        {
            "id": "bf0eb05f-7ea4-3154-86cb-0fb788cd9ace",
            "summary": "Netflix (NFLX) closed at $870.40 in the latest trading session, marking a +0.3% move from the prior day.",
            "date": "2025-04-08T21:45:16Z",
            "sentiment-score": 0.8233001595363021
        },
        {
            "id": "c3b80c33-7807-3d91-ac47-c3758c04263a",
            "summary": "Investing.com -- KeyBanc Capital Markets cut price targets across a group of digital advertising and streaming stocks citing worsening ad agency checks and increased macro uncertainty.The firm reduced revenue forecasts and price targets for eight names, including Overweight-rated Alphabet (NASDAQ:GOOGL), Meta Platforms (NASDAQ:META), Netflix (NASDAQ:NFLX), Pinterest (NYSE:PINS), Spotify (NYSE:SPOT), and The Trade Desk (NASDAQ:TTD).Trump tariffs have induced the investments pause until, as compan",
            "date": "2025-04-09T17:48:06Z",
            "sentiment-score": -0.9515634113922715
        },
        {
            "id": "2b47c372-177e-3051-aa01-406a8d82b220",
            "summary": "Netflix and DoorDash are two of the seven best stocks where investors can find magnificent profit growth prospects.  More than 70% of analysts covering Netflix have buy or overweight ratings on the video streaming service.  The consensus estimate for 2025 earnings is $24.69, a 25% increase from last year.",
            "date": "2025-04-09T17:36:21Z",
            "sentiment-score": 0.9160944083705544
        },
        {
            "id": "bcbf34d4-e429-3459-8d71-5869e3843bef",
            "summary": "Madison Mills and Yahoo Finance Executive Editor Brian Sozzi outline what's driving interest in some of the trending tickers on Yahoo Finance's platform. Citi analysts cut their Nvidia (NVDA) price target to $150 per share, citing reduced chip sales in 2025 and 2026 due to the trade war. Jefferies analysts outline their top defensive retail and consumer-facing picks, including Uber (UBER), Exxon (XOM), McDonald's (MCD), and Netflix (NFLX). Logitech (LOGI) withdraws its full-year 2026 guidance, citing tariff uncertainty. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
            "date": "2025-04-11T15:02:02Z",
            "sentiment-score": -0.9343402707017958
        },
        {
            "id": "50dbc512-dd52-33f7-a60b-84ac3d8ac9e2",
            "summary": "The market whipsawed higher on Trump tariff news. Palantir leads stocks setting up, but here's what to do now.",
            "date": "2025-04-12T11:49:45Z",
            "sentiment-score": 0.030248358845710754
        },
        {
            "id": "439e2239-a3df-48fc-8c57-3f5c4d060dca",
            "summary": "Key moments from the last seven days, plus a glimpse at the week ahead",
            "date": "2025-04-12T10:29:24Z",
            "sentiment-score": 0.036941577680408955
        },
        {
            "id": "2aff7827-9784-3cbe-9949-543205dc1502",
            "summary": "This is what could happen next to Netflix shares.",
            "date": "2025-04-11T18:53:49Z",
            "sentiment-score": -0.08265281189233065
        },
        {
            "id": "0cb1efbe-18da-3eea-b866-9dc040174ebd",
            "summary": "Netflix stock has been a popular defensive play in the current unsteady market. But analysts differ on an appropriate valuation.",
            "date": "2025-04-11T17:47:56Z",
            "sentiment-score": -0.0030827131122350693
        },
        {
            "id": "bb233227-0b97-3922-9100-f42f733926ea",
            "summary": "NFLX's strategic content investment and ad-tier growth fuel its 47.9% stock rise. With record subscriber gains, 2025 offers smart investors an ideal entry point.",
            "date": "2025-04-11T14:34:00Z",
            "sentiment-score": 0.7197241187095642
        },
        {
            "id": "63b4a4b0-03c0-47f5-8c77-924188fd222e",
            "summary": "Earnings preview of key companies reporting next week and what to look out for.",
            "date": "2025-04-11T13:11:11Z",
            "sentiment-score": -0.010118871927261353
        },
        {
            "id": "a34f98a3-d5f6-4d3b-a0a9-9a3d7940c1d1",
            "summary": "A bearish call that is staying in place.",
            "date": "2025-04-11T12:40:02Z",
            "sentiment-score": -0.039957113564014435
        },
        {
            "id": "eedf2543-ef7a-309c-8f29-28fd659f628b",
            "summary": "Consumer discretionary stocks like AOUT, CCL, GME and NFLX are poised to benefit from cooling inflation.",
            "date": "2025-04-11T12:31:00Z",
            "sentiment-score": 0.9022400192916393
        },
        {
            "id": "b05492f3-596d-3859-80ab-33ad72e406f0",
            "summary": "VTR, BRK.B and NFLX have been highlighted in this Market Edge article.",
            "date": "2025-04-11T09:12:00Z",
            "sentiment-score": 0.010557608678936958
        }
    ]
}