{
    "ticker": "ORCL",
    "total_news": 28,
    "average_sentiment": 0.04736018240717905,
    "weighted_average_sentiment": -0.1504887629561126,
    "average_daily_sentiments": [
        -0.3822140774379174,
        0.06744823418557644,
        0.031728035770356655,
        -0.07759589469060302,
        -0.3608850850723684,
        0.33125281892716885,
        0.6205314551480114
    ],
    "news": [
        {
            "id": "bd041819-4022-3a96-a3ad-e40693d74f05",
            "summary": "The White House is reportedly close to approving a TikTok deal that would bring in new U.S.-based investors.",
            "date": "2025-04-02T21:03:53Z",
            "sentiment-score": 0.5744222598150373
        },
        {
            "id": "c0f87eb6-3cd1-3ea6-925f-0d1fe7540de6",
            "summary": "President Trump is expected to be briefed Wednesday on a framework to keep the video-sharing app operational.",
            "date": "2025-04-02T20:11:00Z",
            "sentiment-score": 0.13699807226657867
        },
        {
            "id": "1aece5f9-a5cf-3d3a-bc37-4d53fbf7bac8",
            "summary": "Amazon and AppLovin reportedly submitted bids to acquire TikTok, ahead of a U.S. ban set to go into effect Saturday if no deal is reached with the app's Chinese parent company.",
            "date": "2025-04-02T20:03:45Z",
            "sentiment-score": -0.5048812814056873
        },
        {
            "id": "bb221b46-27e8-3dfe-85b0-1f903ea7904f",
            "summary": "We recently published a list of 11 Best Data Storage Stocks to Invest in According to Analysts. In this article, we are going to take a look at where Oracle Corp. (NYSE:ORCL) stands against other best data storage stocks to invest in according to analysts. Data storage is defined as the organized preservation of digital […]",
            "date": "2025-04-02T19:44:11Z",
            "sentiment-score": 0.012423917651176453
        },
        {
            "id": "d5c15fa5-7123-39cc-9ac9-66108498da42",
            "summary": "(Bloomberg) -- Oracle Corp. has told customers that a hacker broke into a computer system and stole old client log-in credentials, according to two people familiar with the matter. It’s the second cybersecurity breach that the software company has acknowledged to clients in the last month.Most Read from BloombergMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Frank Lloyd Wright Learned From the Desert",
            "date": "2025-04-02T21:30:11Z",
            "sentiment-score": -0.02365369349718094
        },
        {
            "id": "0c845bbe-a8c0-395d-b0bd-5dac377546de",
            "summary": "Oracle Corporation ( NYSE:ORCL ) has announced that it will be increasing its dividend from last year's comparable...",
            "date": "2025-04-03T17:26:40Z",
            "sentiment-score": 0.9053344372659922
        },
        {
            "id": "c62e9c41-40df-38ca-9602-fb9728a49ea5",
            "summary": "Catch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: TARIFF PLAN: President Donald Trump’s team is finalizing plans for reciprocal tariffs to be unveiled on Wednesday, with multiple proposals under consideration, including a tiered tariff system and a customized reciprocal plan, Bloomberg’s Josh Wingrove and Jennifer A. Dlouhy report. The tariffs a",
            "date": "2025-04-03T14:15:58Z",
            "sentiment-score": 0.046600740402936935
        },
        {
            "id": "cf52436c-7226-343e-8ed9-4c63a6e2731f",
            "summary": "Artisan Partners, an investment management company, released its “Artisan Global Opportunities Fund” fourth quarter 2024 investor letter. A copy of the letter can be downloaded here. US equities experienced significant gains in Q4, showcasing a strong year. The portfolio showed slight weakness in Q4 but posted a strong absolute return in 2024. In the fourth […]",
            "date": "2025-04-03T12:18:38Z",
            "sentiment-score": 0.8627727068960667
        },
        {
            "id": "dcbd223c-82fe-3fcd-ad69-f14c98627351",
            "summary": "(Bloomberg) -- President Donald Trump said the US was close to unveiling a plan that would spare the Chinese-owned social media app TikTok from a US ban, with multiple investors involved in discussions for a deal.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation",
            "date": "2025-04-03T21:21:07Z",
            "sentiment-score": 0.66741793602705
        },
        {
            "id": "764a3fdc-503a-3dfd-8cd2-d527a568a9c1",
            "summary": "AMD, NVIDIA, Microsoft, Meta and Oracle are part of the Zacks top Analyst Blog.",
            "date": "2025-04-04T13:00:00Z",
            "sentiment-score": 0.004079347476363182
        },
        {
            "id": "eb890132-a0ae-3cba-bb38-a2c13adc4b80",
            "summary": "The tech-heavy Nasdaq Composite (^IXIC) is set to enter a bear market. Futurum Group CEO Daniel Newman joins Catalysts with Madison Mills and Lumida Wealth Management CEO Ram Ahluwalia to discuss what President Donald Trump's new tariffs mean for tech CEOs and their artificial intelligence (AI) spending. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
            "date": "2025-04-04T17:00:00Z",
            "sentiment-score": 0.026288065128028393
        },
        {
            "id": "c5c85a5b-bd7d-37cb-9ac7-02907cecdaa1",
            "summary": "The TikTok ban got another extension from President Trump, who said his administration is making progress on arranging a deal.",
            "date": "2025-04-04T18:42:49Z",
            "sentiment-score": 0.8917679395526648
        },
        {
            "id": "a065592d-b225-3ff3-959a-56aa2bde3873",
            "summary": "We recently published a list of Jim Cramer’s Thoughts on Liberation Day, Tariffs, and 17 Stocks to Watch Right Now. In this article, we are going to take a look at where Oracle Corporation (NYSE:ORCL) stands against other stocks that Jim Cramer discusses. On Tuesday, April 1st, the host of Mad Money opened the show […]",
            "date": "2025-04-05T03:14:26Z",
            "sentiment-score": 0.009455039165914059
        },
        {
            "id": "6a810bf4-7c70-3b84-9c7a-f203c0eb6908",
            "summary": "We recently published a list of 11 Best Innovative Stocks to Buy According to Analysts. In this article, we are going to take a look at where Oracle Corporation (NYSE:ORCL) stands against other best innovative stocks to buy according to analysts. Innovative stocks are the companies that continuously invest in developing new products, services or […]",
            "date": "2025-04-04T22:18:33Z",
            "sentiment-score": 0.016621812246739864
        },
        {
            "id": "34d40282-5d43-32cc-b403-6cdff0bf95f7",
            "summary": "Higher prices may be in store for a range of materials used to build the data centers that will deliver AI.",
            "date": "2025-04-04T22:13:00Z",
            "sentiment-score": 0.717506930232048
        },
        {
            "id": "38e5c5c8-57d9-3b7a-88ec-e4a4c84f7823",
            "summary": "The major averages were sharply lower again near noon, continuing yesterday’s post-tariff slide. China has retaliated with additional tariffs of 34% on all U.S. goods a day after the Trump administration imposed its own sweeping levies. Meanwhile, the latest U.S. jobs data show that nonfarm payrolls rose by a higher-than-forecast 228,000 jobs, though the unemployment rate has ticked higher. Looking to commodities, oil prices are sharply lower due to a planned output increase promised by OPEC+ as",
            "date": "2025-04-05T16:10:32Z",
            "sentiment-score": -0.7312252093106508
        },
        {
            "id": "6155b2e5-fb5b-347d-a61a-97fd52eadc6f",
            "summary": "Investing.com -- The latest wave of U.S. tariffs rattled markets, hitting software stocks with declines ranging from low single digits to more than 10% in smaller-cap names. But according to Bernstein, the reaction may be more panic than substance.",
            "date": "2025-04-06T10:30:05Z",
            "sentiment-score": -0.9272495387122035
        },
        {
            "id": "c71c89f0-dfcd-399c-89bf-eebacba622c5",
            "summary": "Microsoft (NASDAQ: MSFT), Apple, and Nvidia.  It has crushed the S&P 500 over the long term, gaining 342% over the last decade compared to 145% for the index.  The technology sector has grown in value by so much that it now makes up 29.6% of the S&P 500.",
            "date": "2025-04-06T11:00:00Z",
            "sentiment-score": 0.7720577493309975
        },
        {
            "id": "aaad0b5c-b63c-36e6-be26-edfd1f1a73d0",
            "summary": "AI-oriented companies appear to be performing “overwhelmingly” well, Gabelli Portfolio Manager John Felton recently told Schwab Network. Among the companies well-positioned to benefit from the latter trend are Microsoft (MSFT) and Oracle (ORCL), he suggested. A “Disconnect” Between the Performance and Stock Prices of AI Names Although AI-oriented stocks in general and the sector’s “high […]",
            "date": "2025-04-07T17:55:40Z",
            "sentiment-score": 0.1445121169090271
        },
        {
            "id": "fd2a3268-ed82-3ccb-8cb0-976a95e18581",
            "summary": "NOW's deal to acquire Logic.ai enhances its CRM capabilities with AI-driven solutions, but forex headwinds and a challenging macroeconomic environment raise concerns.",
            "date": "2025-04-07T19:00:00Z",
            "sentiment-score": 0.8924161288887262
        },
        {
            "id": "3e96208b-fc13-3029-aff3-d06f2607e93b",
            "summary": "Amazon recently closed its TikTok Shop clone. Buying TikTok would give the company’s social-commerce business a shot in the arm.",
            "date": "2025-04-08T07:00:00Z",
            "sentiment-score": 0.06744823418557644
        },
        {
            "id": "f1e372d9-b365-38a6-a420-ba9e52f152cf",
            "summary": "Oracle is worried tariffs will impact its mega data center for OpenAI.",
            "date": "2025-04-07T14:15:06Z",
            "sentiment-score": -0.9417441384866834
        },
        {
            "id": "38229d51-fc28-30b6-9f02-bd22b39d6e04",
            "summary": "ClearBridge Investments, an investment management company, released its “ClearBridge Value Strategy” first quarter 2025 investor letter. A copy of the letter can be downloaded here. In the first quarter, the strategy underperformed its Russell 1000 Value benchmark, driven by detractors in the energy and financials, overcame contributions from overweight to energy and underweight to IT. […]",
            "date": "2025-04-09T12:56:19Z",
            "sentiment-score": -0.7481894008815289
        },
        {
            "id": "9d0981d9-b2c3-364b-926f-80c5659723a6",
            "summary": "Oracle confirmed a second massive data breach The hacker gained access to sensitive information, including usernames, passwords, and encrypted passwords The FBI and cybersecurity firm CrowdStrike Holdings are investigating Oracle Corp. (NYSE:ORCL) has told customers a hacker has broken into its computer system and stolen client log-in credentials, Reuters reported recently. The incident marks the second cybersecurity breach the company has come forward about in the last month. According to insid",
            "date": "2025-04-09T14:00:46Z",
            "sentiment-score": -0.7558230701833963
        },
        {
            "id": "82340f41-6bf6-39b0-8c79-12bdc44fc540",
            "summary": "The average brokerage recommendation (ABR) for Oracle (ORCL) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effectiveness of this highly sought-after metric questionable. So, is it worth buying the stock?",
            "date": "2025-04-09T13:30:16Z",
            "sentiment-score": 0.0040123313665390015
        },
        {
            "id": "f2e641be-6eeb-3036-ba59-77c2a5fec532",
            "summary": "Zacks.com users have recently been watching Oracle (ORCL) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.",
            "date": "2025-04-09T13:00:15Z",
            "sentiment-score": 0.014877126552164555
        },
        {
            "id": "d5bf55b6-c047-33c3-93c1-90961dfaa33c",
            "summary": "Oracle (NYSE:ORCL) recently announced a significant partnership with Google Cloud, introducing a new partner program to bolster their cloud database offerings. Despite such positive strategic developments, Oracle's share price witnessed a 12% decline over the past week, a movement closely paralleling the 12% drop in the broader market indices like the S&P 500. Global market turmoil, including trade wars and tariff uncertainties, overshadowed recent corporate achievements, suggesting that the...",
            "date": "2025-04-09T17:47:07Z",
            "sentiment-score": -0.8132453002035618
        },
        {
            "id": "0a9973ff-7e57-399a-90db-751b33e56ef8",
            "summary": "Oracle (ORCL) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues.",
            "date": "2025-04-09T15:30:04Z",
            "sentiment-score": 0.005083848722279072
        }
    ]
}