{
    "ticker": "ORCL",
    "total_news": 20,
    "average_sentiment": -0.2612667676527053,
    "weighted_average_sentiment": -0.32311081428018107,
    "average_daily_sentiments": [
        -0.9573291894048452,
        -0.36148266517557204,
        0.433686240343377,
        -0.4910948740111457,
        0.06744823418557644,
        0.031728035770356655,
        -0.07759589469060302
    ],
    "news": [
        {
            "id": "6155b2e5-fb5b-347d-a61a-97fd52eadc6f",
            "summary": "Investing.com -- The latest wave of U.S. tariffs rattled markets, hitting software stocks with declines ranging from low single digits to more than 10% in smaller-cap names. But according to Bernstein, the reaction may be more panic than substance.",
            "date": "2025-04-06T10:30:05Z",
            "sentiment-score": -0.9272495387122035
        },
        {
            "id": "c71c89f0-dfcd-399c-89bf-eebacba622c5",
            "summary": "Microsoft (NASDAQ: MSFT), Apple, and Nvidia.  It has crushed the S&P 500 over the long term, gaining 342% over the last decade compared to 145% for the index.  The technology sector has grown in value by so much that it now makes up 29.6% of the S&P 500.",
            "date": "2025-04-06T11:00:00Z",
            "sentiment-score": 0.7720577493309975
        },
        {
            "id": "aaad0b5c-b63c-36e6-be26-edfd1f1a73d0",
            "summary": "AI-oriented companies appear to be performing “overwhelmingly” well, Gabelli Portfolio Manager John Felton recently told Schwab Network. Among the companies well-positioned to benefit from the latter trend are Microsoft (MSFT) and Oracle (ORCL), he suggested. A “Disconnect” Between the Performance and Stock Prices of AI Names Although AI-oriented stocks in general and the sector’s “high […]",
            "date": "2025-04-07T17:55:40Z",
            "sentiment-score": 0.1445121169090271
        },
        {
            "id": "fd2a3268-ed82-3ccb-8cb0-976a95e18581",
            "summary": "NOW's deal to acquire Logic.ai enhances its CRM capabilities with AI-driven solutions, but forex headwinds and a challenging macroeconomic environment raise concerns.",
            "date": "2025-04-07T19:00:00Z",
            "sentiment-score": 0.8924161288887262
        },
        {
            "id": "3e96208b-fc13-3029-aff3-d06f2607e93b",
            "summary": "Amazon recently closed its TikTok Shop clone. Buying TikTok would give the company’s social-commerce business a shot in the arm.",
            "date": "2025-04-08T07:00:00Z",
            "sentiment-score": 0.06744823418557644
        },
        {
            "id": "f1e372d9-b365-38a6-a420-ba9e52f152cf",
            "summary": "Oracle is worried tariffs will impact its mega data center for OpenAI.",
            "date": "2025-04-07T14:15:06Z",
            "sentiment-score": -0.9417441384866834
        },
        {
            "id": "38229d51-fc28-30b6-9f02-bd22b39d6e04",
            "summary": "ClearBridge Investments, an investment management company, released its “ClearBridge Value Strategy” first quarter 2025 investor letter. A copy of the letter can be downloaded here. In the first quarter, the strategy underperformed its Russell 1000 Value benchmark, driven by detractors in the energy and financials, overcame contributions from overweight to energy and underweight to IT. […]",
            "date": "2025-04-09T12:56:19Z",
            "sentiment-score": -0.7481894008815289
        },
        {
            "id": "9d0981d9-b2c3-364b-926f-80c5659723a6",
            "summary": "Oracle confirmed a second massive data breach The hacker gained access to sensitive information, including usernames, passwords, and encrypted passwords The FBI and cybersecurity firm CrowdStrike Holdings are investigating Oracle Corp. (NYSE:ORCL) has told customers a hacker has broken into its computer system and stolen client log-in credentials, Reuters reported recently. The incident marks the second cybersecurity breach the company has come forward about in the last month. According to insid",
            "date": "2025-04-09T14:00:46Z",
            "sentiment-score": -0.7558230701833963
        },
        {
            "id": "82340f41-6bf6-39b0-8c79-12bdc44fc540",
            "summary": "The average brokerage recommendation (ABR) for Oracle (ORCL) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effectiveness of this highly sought-after metric questionable. So, is it worth buying the stock?",
            "date": "2025-04-09T13:30:16Z",
            "sentiment-score": 0.0040123313665390015
        },
        {
            "id": "f2e641be-6eeb-3036-ba59-77c2a5fec532",
            "summary": "Zacks.com users have recently been watching Oracle (ORCL) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.",
            "date": "2025-04-09T13:00:15Z",
            "sentiment-score": 0.014877126552164555
        },
        {
            "id": "d5bf55b6-c047-33c3-93c1-90961dfaa33c",
            "summary": "Oracle (NYSE:ORCL) recently announced a significant partnership with Google Cloud, introducing a new partner program to bolster their cloud database offerings. Despite such positive strategic developments, Oracle's share price witnessed a 12% decline over the past week, a movement closely paralleling the 12% drop in the broader market indices like the S&P 500. Global market turmoil, including trade wars and tariff uncertainties, overshadowed recent corporate achievements, suggesting that the...",
            "date": "2025-04-09T17:47:07Z",
            "sentiment-score": -0.8132453002035618
        },
        {
            "id": "0a9973ff-7e57-399a-90db-751b33e56ef8",
            "summary": "Oracle (ORCL) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues.",
            "date": "2025-04-09T15:30:04Z",
            "sentiment-score": 0.005083848722279072
        },
        {
            "id": "8b5cd3fe-2e33-3058-80ee-27e0d396cfcb",
            "summary": "Artificial intelligence (AI) stocks haven't been performing well on the market in 2025 amid the tariff-fueled turmoil that threatens to send the U.S. economy into a recession.  Share prices of cloud infrastructure provider Oracle (NYSE: ORCL) are down nearly 20% so far in 2025 as of this writing, while data streaming platform provider Confluent (NASDAQ: CFLT) has dipped more than 23%.  Both companies saw an uptick in their financial performances thanks to AI adoption, but the generally negative stock market sentiment is taking its toll.",
            "date": "2025-04-12T08:10:00Z",
            "sentiment-score": -0.9573291894048452
        },
        {
            "id": "1ae0b4ca-8d4e-39dd-9419-7d41799b6094",
            "summary": "Plaintiffs claimed the tech company’s commission structure for sales workers violated state wage laws, among other allegations.",
            "date": "2025-04-11T16:50:00Z",
            "sentiment-score": -0.8802275573834777
        },
        {
            "id": "1feee77a-2184-395d-8273-a53f9897c32f",
            "summary": "GOOGL unveils Ironwood Tensor Processing Unit, Cloud Wide Area Network, and Gemini 2.5 AI model to power next-generation enterprise AI and quantum breakthroughs.",
            "date": "2025-04-11T15:25:00Z",
            "sentiment-score": 0.1572622270323336
        },
        {
            "id": "5e87eddc-0f9b-3a6f-87d9-f830020ee9a6",
            "summary": "We recently published a list of Top 12 Tech Stocks to Buy According to Billionaire Ken Fisher. In this article, we are going to take a look at where Oracle Corporation (NYSE:ORCL) stands against other top tech stocks to buy according to Billionaire Ken Fisher. Under the umbrella of Fisher Asset Management, Billionaire Ken Fisher […]",
            "date": "2025-04-10T21:46:41Z",
            "sentiment-score": 0.011625628918409348
        },
        {
            "id": "daead1f4-9933-3782-96bf-23d4b23b683a",
            "summary": "Advanced Micro Devices is benefiting from an expanding usage of its fifth-generation EPYC processors.",
            "date": "2025-04-10T16:49:00Z",
            "sentiment-score": 0.8557468517683446
        },
        {
            "id": "0edfb9fe-89b4-3454-9afc-9dc4bd3a5006",
            "summary": "President Trump's announcement of tariffs on imports from countries worldwide has rocked the stock market -- and the tech-heavy Nasdaq Composite (NASDAQINDEX: ^IXIC) has led the decline, crashing more than 20% from its most recent high.  Why are tech stocks being hit so hard?  All this has prompted investors to worry about tech earnings ahead, fleeing shares of these companies.",
            "date": "2025-04-09T22:10:00Z",
            "sentiment-score": -0.949106028303504
        },
        {
            "id": "7d12e6b0-00ff-4109-af66-10b3c5b8c126",
            "summary": "The tech industry tried to cozy up to the Trump Administration in the hopes that it could avoid getting caught in the crossfire of his policy moves. But they couldn't dodge his tariffs.",
            "date": "2025-04-09T19:29:14Z",
            "sentiment-score": -0.2778167128562927
        },
        {
            "id": "ae42b341-bbc4-3237-9393-84b6452fce89",
            "summary": "ORCL faces dual security breaches as capital spending surges. With slowing growth and damaged trust, investors may want to reconsider positions despite AI ambitions.",
            "date": "2025-04-09T19:00:00Z",
            "sentiment-score": -0.8996466603130102
        }
    ]
}