{
    "ticker": "PEP",
    "total_news": 20,
    "average_sentiment": -0.05466495908331126,
    "weighted_average_sentiment": -0.12437810235828885,
    "average_daily_sentiments": [
        0,
        -0.44019133737310767,
        -0.17647336446680129,
        0.06826708884909749,
        -0.032794756907969715,
        0.013124494813382626,
        0.13759199483320117
    ],
    "news": [
        {
            "id": "e0777baa-dfcc-3fb6-b56b-d53a635bc0cd",
            "summary": "Dividend King Coca-Cola (NYSE: KO) is a consumer staples giant that fits that bill.  Coca-Cola owns one of the most recognized brands in the world, with lots going for it.  There's a reason why Warren Buffett has owned Coca-Cola within Berkshire Hathaway for decades.",
            "date": "2025-04-06T08:05:00Z",
            "sentiment-score": 0.07874560775235295
        },
        {
            "id": "c4d565ac-fc75-37d0-9c84-b00e978c4098",
            "summary": "Coca-Cola (NYSE: KO) and PepsiCo (NASDAQ: PEP) have a long-standing rivalry as each has battled for the hearts, minds, and wallets of consumers.  Stock analysis may not have the entertainment value of the companies' commercials, but which one, Coca-Cola or PepsiCo, deserves your investment dollars?  Coca-Cola started selling its namesake brand in 1886, and it remains a pure beverage company.",
            "date": "2025-04-06T16:35:00Z",
            "sentiment-score": 0.029210410080850124
        },
        {
            "id": "bbdbc18a-a9a1-3a18-9cd4-bbd85b47f9a5",
            "summary": "We recently published a list of 11 Best Counter Cyclical Stocks to Buy According to Analysts. In this article, we are going to take a look at where PepsiCo, Inc. (NASDAQ:PEP) stands against other best counter cyclical stocks to buy according to analysts. Counter cyclical stocks stand out because they tend to perform well during […]",
            "date": "2025-04-06T21:08:12Z",
            "sentiment-score": 0.30481996666640043
        },
        {
            "id": "9c13626a-dd8b-3c32-9449-e4c49cc321b0",
            "summary": "Coca-Cola, Hyatt, Sealed Air, Starbucks and Wyndham recently reached agreements with shareholder advocates. Proposals remain pending at Amazon, Home Depot, Kraft Heinz, Mondelez, PepsiCo and Wendy’s.",
            "date": "2025-04-07T10:48:00Z",
            "sentiment-score": 0.06590215675532818
        },
        {
            "id": "22d303a3-0154-3752-91fe-ea3fd0e06a61",
            "summary": "The debut of the healthier offering, which targets building immunity and healthy bones, comes as the category continues to lose sales.",
            "date": "2025-04-07T09:00:00Z",
            "sentiment-score": -0.8796823937445879
        },
        {
            "id": "bc5f7cf2-3a6a-3050-9a6f-a5511cb16737",
            "summary": "Coca-Cola (KO) stock hit a 52-week peak of $73 a share last Thursday and is sitting on +9% gains this year compared to the S&P 500's 14% decline.",
            "date": "2025-04-07T19:25:00Z",
            "sentiment-score": 0.8531537214294076
        },
        {
            "id": "b89e252a-705c-3384-8d07-b485c34ff42a",
            "summary": "CVS Health Inc (NYSE:CVS) on Tuesday named Brian Newman as executive vice president and chief financial officer designate, effective April 21. He will succeed current chief financial officer Tom Cowhey, who will transition as a strategic advisor to president and chief executive officer David Joyner, effective May 12. Newman was most recently executive vice president and chief financial officer of United Parcel Service Inc (NYSE:UPS). Also Read: FTC Pauses Lawsuit Against CVS, Cigna, UnitedHealth",
            "date": "2025-04-08T12:24:11Z",
            "sentiment-score": -0.01149020716547966
        },
        {
            "id": "1c643ac0-14c8-34ee-b340-add3e551c41a",
            "summary": "Pre-game concerts are coming to the biggest stages in European women’s soccer from next season as part of a Pepsi sponsorship announced on Tuesday.  UEFA said a five-year renewal with PepsiCo will see kickoff shows at each final in the Women’s Champions League through 2030 and at the 2029 European Championship.  The men’s Champions League final has had concerts since Alicia Keys performed before the 2016 final at San Siro in Milan.",
            "date": "2025-04-08T10:58:03Z",
            "sentiment-score": 0.0783292162232101
        },
        {
            "id": "7687faed-9dd8-3941-b83d-3ed6bd8cca21",
            "summary": "Coca-Cola, PepsiCo, Berkshire Hathaway and Blackrock have been highlighted in this Investment Ideas article.",
            "date": "2025-04-08T08:42:00Z",
            "sentiment-score": 0.006119249388575554
        },
        {
            "id": "05baf09e-6a08-375a-88c9-4877ec9db8a4",
            "summary": "Stock market sell-offs can be challenging for investors.  Market volatility can make it tough to make new investments and keep the ones you already have due to the fear that they could lose value.  One dividend stock I've been buying during the current market sell-off is PepsiCo (NASDAQ: PEP).",
            "date": "2025-04-08T08:14:00Z",
            "sentiment-score": -0.24375481344759464
        },
        {
            "id": "36c8a342-e01d-3498-b0d5-4cb2ea71eccb",
            "summary": "We recently published a list of 10 Defensive Stocks Billionaire Ken Fisher is Betting On. In this article, we are going to take a look at where PepsiCo, Inc. (NASDAQ:PEP) stands against other defensive stocks billionaire Ken Fisher is betting on. Ken Fisher, an American billionaire investor, author, and financial analyst, founded and runs Fisher Asset Management. […]",
            "date": "2025-04-08T22:14:42Z",
            "sentiment-score": 0.006822770461440086
        },
        {
            "id": "0e5a5fb9-62f0-303a-937a-c60398a77f8a",
            "summary": "Greg Lyons, who left the beverage giant late last month, will join the sandwich chain on the tail of a recent creative agency switch-up.",
            "date": "2025-04-09T10:15:00Z",
            "sentiment-score": 0.0038709091022610664
        },
        {
            "id": "97389525-bc2c-4183-9320-98dd1630dacf",
            "summary": "Constellation Brands CEO Bill Newlands warns of the impact to his company's business from the Trump administration's policies.",
            "date": "2025-04-11T16:43:33Z",
            "sentiment-score": -0.9115050071850419
        },
        {
            "id": "67c2e025-fbdd-37d8-804a-d1d02d3cadfb",
            "summary": "We recently published a list of 10 Best Food Stocks to Buy According to Billionaires. In this article, we are going to take a look at where PepsiCo, Inc. (NASDAQ:PEP) stands against other best food stocks to buy according to billionaires. A significant contributor to the global economy, the food business has changed over time […]",
            "date": "2025-04-11T18:50:48Z",
            "sentiment-score": 0.03112233243882656
        },
        {
            "id": "d3c4df71-e9d0-3c1d-a397-3c6c81b4ab0f",
            "summary": "In the closing of the recent trading day, PepsiCo (PEP) stood at $144.12, denoting a -1.01% change from the preceding trading day.",
            "date": "2025-04-10T21:45:13Z",
            "sentiment-score": 0.37914211116731167
        },
        {
            "id": "753681d5-4330-3edc-a424-b96b6719560a",
            "summary": "Over the past six months, PepsiCo’s shares (currently trading at $144.53) have posted a disappointing 16.5% loss while the S&P 500 was down 7.7%. This might have investors contemplating their next move.",
            "date": "2025-04-10T09:03:33Z",
            "sentiment-score": -0.9531689817085862
        },
        {
            "id": "230d8f44-bb97-3380-9102-9e5461a617f1",
            "summary": "Procter & Gamble, Novo Nordisk, PepsiCo, Genie Energy and Canterbury Park are included in this Analyst Blog.",
            "date": "2025-04-10T09:00:00Z",
            "sentiment-score": 2.2049061954021454e-05
        },
        {
            "id": "e6dcec52-dc88-3aeb-be82-2e06e4f4ef5b",
            "summary": "PepsiCo (NasdaqGS:PEP) recently faced increased investor attention due to an activist proposal urging the company to address its use of flexible plastic packaging. This, along with the company's ongoing discussions about acquiring the soda brand Poppi, could have influenced its stock movements. Despite a strong earnings report and increased dividends, PepsiCo's stock was flat over the last quarter, diverging from broader market trends. Meanwhile, major indexes saw significant gains following...",
            "date": "2025-04-10T00:00:26Z",
            "sentiment-score": -0.13188863638788462
        },
        {
            "id": "65d8d4c5-b7a5-35e7-a692-19fcd2d8888f",
            "summary": "Coca-Cola (NYSE: KO) is a very well-run company, highlighted by its status as a Dividend King.  Yes, it is a reliable and safe dividend stock, but it probably isn't worth chasing an overvalued stock if you are trying to find a safe haven during the current market storm.  You'll be far better off looking at dividend stocks that are more attractively priced like Realty Income (NYSE: O), Hershey (NYSE: HSY), and Coca-Cola competitor PepsiCo (NASDAQ: PEP).",
            "date": "2025-04-09T22:05:00Z",
            "sentiment-score": 0.18799659376963973
        },
        {
            "id": "ef3a2b57-ad61-3a74-86c1-ac21c5e68268",
            "summary": "Today's Research Daily features new research reports on 16 major stocks, including The Procter & Gamble Company (PG), Novo Nordisk A/S (NVO) and PepsiCo, Inc. (PEP), as well as two micro-cap stocks Genie Energy Ltd. (GNE) and Canterbury Park Holding Corporation (CPHC).",
            "date": "2025-04-09T20:51:00Z",
            "sentiment-score": 0.012933763675391674
        }
    ]
}