{
    "ticker": "PM",
    "total_news": 10,
    "average_sentiment": 0.14056879952549933,
    "weighted_average_sentiment": 0.14001551514002877,
    "average_daily_sentiments": [
        0,
        0.18944460122535625,
        0.018698709396024544,
        0.44757487438619137,
        0.014377608895301819,
        0.15965279005467892,
        0
    ],
    "news": [
        {
            "id": "d73585a5-cb01-351c-a5f0-507785553abf",
            "summary": "We recently published a list of Jim Cramer Reveals Stocks Benefiting From Tariff Selloff & Discusses These 8 Stocks. In this article, we are going to take a look at where Philip Morris International Inc. (NYSE:PM) stands against other stocks that Jim Cramer discusses. In his appearance on CNBC’s Squawk on the Street on Thursday, […]",
            "date": "2025-04-07T18:40:22Z",
            "sentiment-score": 0.003952357918024063
        },
        {
            "id": "91762df4-54b3-30d7-b1b6-c71f3b1ed194",
            "summary": "Funds are buying Netflix and Philip Morris amid the Trump tariff stock market meltdown. Both stocks are near all-time highs.",
            "date": "2025-04-07T18:56:42Z",
            "sentiment-score": 0.31535322219133377
        },
        {
            "id": "a626b1fc-f2d7-3cb9-8ad4-648e98d1d652",
            "summary": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores.",
            "date": "2025-04-08T13:50:02Z",
            "sentiment-score": 0.014377608895301819
        },
        {
            "id": "845073f1-655a-382e-a045-9fc919613de8",
            "summary": "Philip Morris International, S&P Global, and Walmart are all resilient investments.",
            "date": "2025-04-09T08:05:00Z",
            "sentiment-score": 0.44757487438619137
        },
        {
            "id": "d5b6933e-ab79-319f-a726-8dc3ca9dc8ed",
            "summary": "We recently published a list of Jim Cramer Reveals Stocks Benefiting From Tariff Selloff & Discusses These 8 Stocks. In this article, we are going to take a look at where Philip Morris International Inc. (NYSE:PM) stands against other stocks that Jim Cramer discussed. In his appearance on CNBC’s Squawk on the Street on Thursday, […]",
            "date": "2025-04-11T19:11:28Z",
            "sentiment-score": 0.0029271841049194336
        },
        {
            "id": "394d27e3-83c0-3e18-96a1-3556550f6593",
            "summary": "In a sliding market, Philip Morris has defied the odds, trading up to $152.02 per share. Its 26.6% gain since October 2024 has outpaced the S&P 500’s 9.9% drop. This was partly due to its solid quarterly results, and the performance may have investors wondering how to approach the situation.",
            "date": "2025-04-11T09:06:45Z",
            "sentiment-score": 0.75989571493119
        },
        {
            "id": "23981aaa-a0da-363e-8a46-adfab258da0a",
            "summary": "At the same time, investors might want to be a little cautious given the uncertainty over the effects that the Trump administration's on-again, off-again tariffs might have on the global economy.  As the leading e-commerce retailer in the world, Amazon (NASDAQ: AMZN) will no doubt be affected by tariffs.  In May, the Trump Administration will also close the \"de minimus\" loophole that these companies have used to avoid duties.",
            "date": "2025-04-11T08:20:00Z",
            "sentiment-score": -0.19448909536004066
        },
        {
            "id": "90e86694-a478-38cc-b6aa-fc2113235c6f",
            "summary": "Dividend-paying stocks can allow investors to build a cash pile quickly. After all, isn't payday the best?",
            "date": "2025-04-10T20:58:00Z",
            "sentiment-score": 0.04864148888736963
        },
        {
            "id": "8c09a029-1e26-37ae-947e-6e8756283fae",
            "summary": "Andvari Associates, an investment management firm, released its first-quarter 2025 investor letter. A copy of the letter can be downloaded here. In the first quarter the fund returned 7.2% net of fees compared to the SPDR S&P 500 ETF’s 4.3% decline. In addition, you can check the fund’s top 5 holdings to find out its […]",
            "date": "2025-04-10T15:48:20Z",
            "sentiment-score": 0.004625424742698669
        },
        {
            "id": "05138c7f-a44c-3cd1-97cc-f565445c43f2",
            "summary": "We came across a bullish thesis on Philip Morris International Inc. (PM) on Substack by Hidden Market Gems. In this article, we will summarize the bulls’ thesis on PM. Philip Morris International Inc. (PM)’s share was trading at $151.80 as of April 9th. PM’s trailing and forward P/E were 25.26 and 21.41 respectively according to Yahoo Finance. […]",
            "date": "2025-04-10T13:04:35Z",
            "sentiment-score": 0.002829214558005333
        }
    ]
}