{
    "ticker": "TXN",
    "total_news": 15,
    "average_sentiment": -0.22392009599134327,
    "weighted_average_sentiment": -0.2917229043846221,
    "average_daily_sentiments": [
        -0.9409362822771072,
        -0.41361594100349713,
        0.4155863574706018,
        0.04714140947908163,
        -0.9270340260118246,
        0.2395124607719481,
        0
    ],
    "news": [
        {
            "id": "0c638a92-167b-34a4-8c64-701ec80a8202",
            "summary": "STM vs. TXN: Which Stock Is the Better Value Option?",
            "date": "2025-04-07T15:40:06Z",
            "sentiment-score": 0.0010835789144039154
        },
        {
            "id": "3f1ad6b7-1787-3c94-ac68-c61e0e2209ca",
            "summary": "Shareholders of Texas Instruments would probably like to forget the past six months even happened. The stock dropped 22.9% and now trades at $156. This might have investors contemplating their next move.",
            "date": "2025-04-08T09:10:53Z",
            "sentiment-score": -0.9270340260118246
        },
        {
            "id": "52ca8cf2-84a4-3d68-abfa-879024d86caa",
            "summary": "The latest trading day saw Texas Instruments (TXN) settling at $154, representing a +1.72% change from its previous close.",
            "date": "2025-04-07T22:00:18Z",
            "sentiment-score": 0.4779413426294923
        },
        {
            "id": "95c89766-d48b-37df-ba03-e5d537f49904",
            "summary": "And we take a look at Texas Instruments and Taiwan Semiconductor.",
            "date": "2025-04-09T13:46:00Z",
            "sentiment-score": 0.018895171117037535
        },
        {
            "id": "c0642db8-694e-3db0-9505-8370b0b671ef",
            "summary": "Key Insights Institutions' substantial holdings in Texas Instruments implies that they have significant influence over...",
            "date": "2025-04-09T13:00:21Z",
            "sentiment-score": 0.07538764784112573
        },
        {
            "id": "cb1cd3cb-dc03-3dd4-ab3d-ba93d26b6fd5",
            "summary": "Brad Smith examines the trending stories on today's Market Minute. Gold (GC=F) climbs, reaching new highs. US chipmakers (SMH) like Intel (INTC) and Texas Instruments (TXN) fall as China hits the US with a 125% tariff based on manufacturing origin. Morgan Stanley (MS) earnings beat expectations, boosted by Elon Musk selling X, according to Bloomberg. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-11T16:17:04Z",
            "sentiment-score": 0.651188638061285
        },
        {
            "id": "dfb9acb0-968e-353f-b0d7-1fc1eeeab681",
            "summary": "We recently published a list of 10 Firms Suffer Amid Optimistic Market Environment. In this article, we are going to take a look at where Texas Instruments Incorporated (NASDAQ:TXN) stands against other firms that suffer amid optimistic market environment. Wall Street’s main indices recovered losses on Friday, as investors repositioned portfolios while digesting the ongoing trade […]",
            "date": "2025-04-12T06:48:24Z",
            "sentiment-score": -0.9409362822771072
        },
        {
            "id": "9affb7d9-065c-3f95-9f1c-2ea4dc33bc1c",
            "summary": "Chipmakers on Edge as China's Tariff Response Zeroes In on U.S. Foundries",
            "date": "2025-04-11T21:12:32Z",
            "sentiment-score": -0.8464953545480967
        },
        {
            "id": "aa3ad730-ab0e-36d4-a17c-47047c2b77c9",
            "summary": "Shares of analog chip manufacturer Texas Instruments (NASDAQ:TXN) fell 8.3% in the morning session after China Semiconductor Industry Association issued an emergency directive detailing new methods for verifying the origin of imported chips. According to reports, the location of the wafer fabrication plant would define the origin of imports when tariffs are applied. This meant that companies with manufacturing facilities in the US might be severely affected by the escalating US-China trade tensi",
            "date": "2025-04-11T19:49:22Z",
            "sentiment-score": -0.9565072786062956
        },
        {
            "id": "08318e5d-856a-30b6-8793-97e58fb4b2f8",
            "summary": "Innovative Eyewear (LUCY) shares plunged 53% amid heavy trading after the company said Friday it is",
            "date": "2025-04-11T18:29:11Z",
            "sentiment-score": -0.9475924111902714
        },
        {
            "id": "3ad88207-f5b9-34e7-8179-068fe562a0ea",
            "summary": "The major U.S. equities indexes edged higher at midday Friday after wavering between losses and gains throughout the morning, as investors digested a slew of bank earnings and China hiked tariffs on U.S. goods.",
            "date": "2025-04-11T16:19:09Z",
            "sentiment-score": 0.7828886974602938
        },
        {
            "id": "cb249203-10c5-3f5a-99e2-91b8db3d414e",
            "summary": "Shares of chip maker Texas Instruments have dropped since President Donald Trump unveiled a barrage of tariffs on “Liberation Day.”",
            "date": "2025-04-11T15:05:00Z",
            "sentiment-score": -0.9535689731128514
        },
        {
            "id": "00f71223-6673-3e4c-bd4c-60509da699c0",
            "summary": "Hitting a new 52-week low can be a pivotal moment for any stock. These floors often mark either the beginning of a turnaround story or confirmation that a company faces serious headwinds.",
            "date": "2025-04-11T13:01:08Z",
            "sentiment-score": -0.6252249050885439
        },
        {
            "id": "6c6f23a7-3557-3720-bac3-0fd1b3d58b80",
            "summary": "Zacks.com users have recently been watching Texas Instruments (TXN) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.",
            "date": "2025-04-10T13:00:10Z",
            "sentiment-score": 0.015894162468612194
        },
        {
            "id": "5ff3721f-4dd7-3bf0-b726-ecfd9ca0bccd",
            "summary": "Texas Instruments (TXN) was a big mover last session on higher-than-average trading volume. The latest trend in earnings estimate revisions might not help the stock continue moving higher in the near term.",
            "date": "2025-04-10T12:08:00Z",
            "sentiment-score": 0.8152785524725914
        }
    ]
}