{
    "ticker": "WFC",
    "total_news": 25,
    "average_sentiment": -0.18348638508468867,
    "weighted_average_sentiment": -0.16617325439143021,
    "average_daily_sentiments": [
        0.9043130469508469,
        -0.4373787181037996,
        0,
        -0.2750723312298457,
        -0.07951153703033924,
        -0.20610042987391353,
        0
    ],
    "news": [
        {
            "id": "b084849b-e49e-3bb5-a3b4-05368aaf441b",
            "summary": "JPMorgan, Wells Fargo, Bank of America and Morgan Stanely are part of Zacks Earnings Preview.",
            "date": "2025-04-07T09:19:00Z",
            "sentiment-score": 0.004779371432960033
        },
        {
            "id": "12e12061-aa7b-382d-9692-67547f65fad1",
            "summary": "(Bloomberg) -- Chinese shares plunged and sovereign yields neared an all-time low as investors braced themselves for the fall-out of a spiraling trade conflict between the world’s two largest economies.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsWhat Would ‘Transportation Abundan",
            "date": "2025-04-07T08:30:36Z",
            "sentiment-score": -0.06332938373088837
        },
        {
            "id": "2bfd5409-d150-3ba0-b7b1-6a8624079f85",
            "summary": "Madison Mills takes a closer look at the top stories as part of today's Market Minute. Big bank stocks, including JPMorgan (JPM) and Wells Fargo (WFC), are moving higher after an initial fall as analysts recalibrate their outlooks to account for mounting recession fears. Bitcoin (BTC-USD) is selling off as other crypto-related names, including Robinhood (HOOD), Strategy (MSTR), and Coinbase (COIN), are mixed today. Spirit Airlines (SAVEQ) stock is in focus after CEO Ted Christie stepped down. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-07T15:22:35Z",
            "sentiment-score": 0.02369101718068123
        },
        {
            "id": "290da19c-ec6d-38b5-b69c-84890756068d",
            "summary": "The outlook for US banks under the Trump administration was initially fueled by expectations of lighter regulation and increased dealmaking. However, it has since been dampened by recent market realities and recession fears. Yahoo Finance Markets and Data Editor and Stocks in Translation podcast host Jared Blikre appears on Catalysts to discuss how major big banks, including Wells Fargo (WFC) and Goldman Sachs (GS), have lost ground amid rising inflation and recession concerns. Catch more Stocks in Translation here, with new episodes every Tuesday and Thursday. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here.",
            "date": "2025-04-07T17:30:00Z",
            "sentiment-score": -0.24394161254167557
        },
        {
            "id": "d419d0f4-cd47-33da-baf5-2e667605f46a",
            "summary": "Financial stocks, like Goldman Sachs (GS), Jefferies (JEF), and Evercore (EVR), are in focus after Morgan Stanley downgraded its outlook for several names in the sector. Yahoo Finance Banking Reporter David Hollerith sits down with Julie Hyman and Trader Talk podcast host Kenny Polcari to check in on the financial sector ahead of earnings. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
            "date": "2025-04-07T21:05:21Z",
            "sentiment-score": -0.05908446945250034
        },
        {
            "id": "df35f89c-f76b-3aa4-91b0-9cccf3b9e279",
            "summary": "(Bloomberg) -- Emerging-market assets slumped, erasing gains for the year as fallout from President Donald Trump’s trade policies continued to upend global markets on Monday. Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpTrump Order on CDFI Fund Risks Aid for Small Businesses, Hous",
            "date": "2025-04-07T20:56:06Z",
            "sentiment-score": -0.8987175021320581
        },
        {
            "id": "5c044606-b8d6-37af-afbb-23270a2c15aa",
            "summary": "(Bloomberg) -- US equity rebounded from a three-day selloff as dip buyers emerged after fears of a trade-war induced recession wiped out more than $5 trillion of stock-market value.Most Read from BloombergThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideHousing Agency Aims to Relocate Its DC HeadquartersTrump Order on CDFI Fund Risks Aid for Small Businesses, HousingBoston Mayor Wu Embraces Trump Resistance as Campaign",
            "date": "2025-04-08T13:31:10Z",
            "sentiment-score": 0.17353442683815956
        },
        {
            "id": "36ddb57b-e322-3ef6-b98b-f9e4a25746ab",
            "summary": "We recently published a list of Jim Cramer’s Game Plan: 10 Stocks in Focus. In this article, we are going to take a look at where Wells Fargo & Company (NYSE:WFC) stands against other stocks in Jim Cramer’s focus. On Friday, Jim Cramer, the host of Mad Money, commented on the current state of the […]",
            "date": "2025-04-08T14:32:52Z",
            "sentiment-score": -0.022066851146519184
        },
        {
            "id": "6a158617-b48a-3d9e-b9be-a00b68ccd155",
            "summary": "(Bloomberg) -- Stocks surged at the fastest pace since 2022 and bonds fell after Treasury Secretary Scott Bessent fueled hopes of trade deals, marking a dramatic shift in Wall Street sentiment following a selloff that chopped trillions of dollars off global markets.Most Read from BloombergThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideHousing Agency Aims to Relocate Its DC HeadquartersTrump Order on CDFI Fund Risks A",
            "date": "2025-04-08T14:21:24Z",
            "sentiment-score": -0.0007973313331604004
        },
        {
            "id": "b57bf65b-4de0-326b-b96a-a95bb209ecc6",
            "summary": "WFC's Q1 results are likely to reflect the benefits of decent loan demand. Yet, weak asset quality and rising costs are expected to have hurt.",
            "date": "2025-04-08T15:31:00Z",
            "sentiment-score": -0.9471876015886664
        },
        {
            "id": "92b3e312-2c37-32f7-8f4d-9a7d4688f8e1",
            "summary": "Market Domination host Julie Hyman goes over the day's trending stories on this segment of Market Minute. Wells Fargo (WFC) stock pops after Piper Sandler upgraded the company to Overweight from Neutral, citing an attractive entry point. Charles Schwab (SCHW) is gaining after Morgan Stanley upgraded the company to Overweight from Equal Weight. Boeing (BA) is in focus after reporting strong first quarter delivery numbers that marked the company's best three months since the fourth quarter of 2023. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-08T18:21:15Z",
            "sentiment-score": 0.39895967207849026
        },
        {
            "id": "220299cc-6c5a-3d39-a26e-23823347d7e6",
            "summary": "Many Wells Fargo & Company ( NYSE:WFC ) insiders ditched their stock over the past year, which may be of interest to...",
            "date": "2025-04-09T12:00:23Z",
            "sentiment-score": -0.7532683871686459
        },
        {
            "id": "9eeeb70a-4a36-3460-aa56-174cd3b4e291",
            "summary": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today’s research calls that investors need to know, as compiled by The Fly. Top 5 Upgrades: Melius Research upgraded Dollar General (DG) to Buy from Hold with a $110 price target. While the company had its own “self-inflicted” challenges and competitive challenges over the last 12 months, the firm believes it likely will benefit from a worsening macro environment and a lack of tariff exposure",
            "date": "2025-04-09T13:35:20Z",
            "sentiment-score": 0.8677340056747198
        },
        {
            "id": "93d8baf2-aa25-3b1b-abe4-8c6a60a77359",
            "summary": "Josh Lipton goes over some of the top trending stories on this segment of Market Minute. Apple (AAPL) stock rebounds after previous losses, though shares are down over 20% over the past five days. Oil futures (CL=F) are sliding due to the escalating trade war as China announced retaliatory tariffs of 84% on US goods, effective April 10th. Bank stocks, including JPMorgan (JPM), Wells Fargo (WFC), and Citigroup (C) are under pressure after JPMorgan Chase CEO Jamie Dimon warned that a US recession is likely. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-09T17:19:38Z",
            "sentiment-score": -0.939682612195611
        },
        {
            "id": "f1ebe554-e4eb-32b8-a06d-f84ffea09e23",
            "summary": "As part of today's Market Minute, Madison Mills recaps the top stories on Wall Street in just 60 seconds. JPMorgan Chase (JPM) earnings beat expectations, but CEO Jamie Dimon says the US economy faces \"considerable turbulence.\" BlackRock's (BLK) net income fell with CEO Larry Fink warning a US recession is \"very close.\" Wells Fargo (WFC) also announced a decline in net income as CEO Charlie Scharf calling for a \"timely\" resolution to the trade war. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "date": "2025-04-11T15:22:48Z",
            "sentiment-score": -0.9256976619362831
        },
        {
            "id": "1480a2ef-34ec-34cf-a4a3-30c8f552bd8a",
            "summary": "Despite a decline in net interest income, Wells Fargo & Co (WFC) reports a 16% increase in diluted earnings per share and returns $4.8 billion to shareholders.",
            "date": "2025-04-12T07:00:42Z",
            "sentiment-score": 0.8958571134135127
        },
        {
            "id": "4416b0d6-22d5-3af7-bd54-b4142925194e",
            "summary": "(Bloomberg) -- Wall Street’s gyrations shook markets anew, with stocks erasing losses to notch their best week since 2023. The rally came as a rout in bonds and the dollar abated, following a few chaotic days that underscored fears foreign investors are beating a retreat from American assets.Most Read from BloombergThe Secret Formula for Faster TrainsIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapMidtown Office Building Evacuated on Concerns of Wall CollapseNYC Tourist Helicopter Cr",
            "date": "2025-04-11T21:27:04Z",
            "sentiment-score": 0.04850633442401886
        },
        {
            "id": "b099dfb9-9e18-3eb2-86f1-158ba48ebc24",
            "summary": "We recently published a list of the 11 Cheap NYSE Stocks to Invest in According to Hedge Funds. In this article, we are going to take a look at where Wells Fargo & Company (NYSE:WFC) stands against other cheap NYSE stocks. On March 26, Jack Caffrey of JPMorgan Asset Management provided an analysis of market […]",
            "date": "2025-04-11T20:36:35Z",
            "sentiment-score": 0.0067125968635082245
        },
        {
            "id": "d569afda-6bbf-3713-aceb-176be2a23d69",
            "summary": "The major indexes made robust progress Friday afternoon following Thursday's big losses. Nvidia climbed as Tesla fell.",
            "date": "2025-04-11T20:32:32Z",
            "sentiment-score": 0.7227031132206321
        },
        {
            "id": "3e7f78c2-b027-38c1-959a-52358c9e6d61",
            "summary": "Shares of Wells Fargo dropped by as much as 3% on Friday after the bank’s net interest income, or NII, declined and fell short of analysts’ expectations.  Wells Fargo’s NII—revenue generated from interest payments, less what customers are paid back—for the first quarter was $11.5 billion, down 6% from a year earlier.  NII is core to Wells Fargo’s business, driving roughly half of its overall revenue last year.",
            "date": "2025-04-11T17:24:28Z",
            "sentiment-score": -0.9589273352175951
        },
        {
            "id": "20c725ea-96b9-3ea1-8778-5834ef2fc19c",
            "summary": "Wells Fargo (NYSE:WFC) recently reported its first quarter 2025 earnings, highlighting a decline in net interest income, yet an increase in net income and improved EPS figures. Despite the company's positive earnings per share results, its stock fell 4% over the past week. This decline contrasts with the broader market, where indexes saw gains amid volatility due to trade tariff developments. Factors such as Wells Fargo's lower interest income might have added weight to the company's stock...",
            "date": "2025-04-11T17:19:52Z",
            "sentiment-score": -0.9444607850164175
        },
        {
            "id": "60d123e3-8e6c-3148-8b87-68c00b04f6e9",
            "summary": "JPMorgan Chase’s Jamie Dimon and BlackRock’s Larry Fink both said the turbulence wasn’t like prior financial crises.",
            "date": "2025-04-11T16:42:00Z",
            "sentiment-score": -0.3537067398428917
        },
        {
            "id": "ed8b2741-df20-384b-930e-82ab5d98beab",
            "summary": "(Bloomberg) -- A struggle by investors to predict President Donald Trump’s mercurial policies set trading records at Wall Street banks in the first quarter. But as industry leaders looked ahead, they had no great answers and scant optimism for what’s to come.Most Read from BloombergThe Secret Formula for Faster TrainsMidtown Office Building Evacuated on Concerns of Wall CollapseIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapNYC Tourist Helicopter Crashes in Hudson River, Killing Six",
            "date": "2025-04-11T15:58:23Z",
            "sentiment-score": -0.669733190909028
        },
        {
            "id": "3abb2f2d-70ea-34cb-a0a3-7cb44d9af56b",
            "summary": "Executives from across the banking industry spoke on Friday about the uncertainty surrounding the Trump administration's tariffs, the stock market, and the possibility of a recession.",
            "date": "2025-04-11T15:38:03Z",
            "sentiment-score": -0.8618047945201397
        },
        {
            "id": "bf13c781-e074-3520-839d-2c8a0c3cee55",
            "summary": "Says had ‘solid’ Q1 results. Says continued to take ‘disciplined approach’ to expenses. Says consumer losses were ‘relatively stable’. Says risk and control work remains top priority. Says ‘remains confident’ to complete work needed to close other consent orders. Says continues to increase collaboration between bankers, advisors. Says seen more clients investing in alternative products. Says focused on expanding commercial banking business. Says consumers have remained ‘resilient’. Says overall",
            "date": "2025-04-12T14:15:28Z",
            "sentiment-score": 0.9127689804881811
        }
    ]
}