{
    "ticker": "XOM",
    "total_news": 28,
    "average_sentiment": -0.08237155678216368,
    "weighted_average_sentiment": -0.08108323856228683,
    "average_daily_sentiments": [
        0,
        -0.2216631016427917,
        0.6032212752227982,
        -0.25209488486871123,
        -0.12076564678656203,
        0.4104323792271316,
        -0.9355728719383478
    ],
    "news": [
        {
            "id": "0575d4c0-4c09-3cbf-82f2-1676fc0da261",
            "summary": "The move may come as a surprise, given that the U.S. benchmark oil price, West Texas Intermediate, is $69.36 per barrel compared to an average of $76.63 in 2024.  Here's why ExxonMobil (NYSE: XOM), Chevron (NYSE: CVX), and ConocoPhillips (NYSE: COP) stand out as three balanced dividend stocks to buy now.  ExxonMobil, Chevron, and ConocoPhillips all have clear paths toward delivering strong free cash flow (FCF) even at current oil prices.",
            "date": "2025-04-05T22:05:00Z",
            "sentiment-score": 0.8437841180711985
        },
        {
            "id": "da79411c-e3d6-3648-bdbc-5f0d1f6736e1",
            "summary": "ExxonMobil (NYSE: XOM) recently gave investors a glimpse into its upcoming first-quarter earnings report.  A combination of higher oil and natural gas prices and improving oil refining margins helped fuel the increased profitability.  Crude prices have crumbled due to concerns about how higher tariffs will impact the global economy.",
            "date": "2025-04-06T16:17:00Z",
            "sentiment-score": -0.9399335039779544
        },
        {
            "id": "c3090b59-d849-39cd-bf0a-c78b7888c646",
            "summary": "We recently published a list of Starter Stock Portfolio 12 Safe Stocks to Buy. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other best beginner stocks. The US stock market has experienced a turbulent first quarter of 2025, marked by increased volatility and negative returns […]",
            "date": "2025-04-06T20:54:15Z",
            "sentiment-score": -0.9312122398987412
        },
        {
            "id": "0f33cee2-e749-3dd5-8f44-88d18b065064",
            "summary": "Companies in The News Are: BIDU, AVGO, XOM, NKE",
            "date": "2025-04-07T13:16:00Z",
            "sentiment-score": -0.005009595304727554
        },
        {
            "id": "b3843604-8935-3c41-bf22-e8277fa27b15",
            "summary": "UBS analyst Josh Silverstein lowered the firm’s price target on Exxon Mobil (XOM) to $135 from $146 and keeps a Buy rating on the shares. The firm sees Energy viewed as a recession downside play, the analyst tells investors in a research note. UBS lowered its price target reflecting increased uncertainty around economic activity and commodity prices. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See the top stocks recommended by a",
            "date": "2025-04-08T13:52:39Z",
            "sentiment-score": -0.6859756670892239
        },
        {
            "id": "2c86b46e-7850-3a34-baf6-c4bacd6eed97",
            "summary": "Exxon Mobil (XOM) closed at $102.94 in the latest trading session, marking a -1.34% move from the prior day.",
            "date": "2025-04-07T21:45:14Z",
            "sentiment-score": 0.8258743537589908
        },
        {
            "id": "03b4ab0f-8e8f-3f38-b5dc-dd6b537fc27e",
            "summary": "We recently published a list of 11 Best American Energy Stocks to Buy Now. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other best American energy stocks to buy now. On Friday, April 4, oil futures reached multiyear lows following China’s response to the tariffs imposed […]",
            "date": "2025-04-08T14:23:04Z",
            "sentiment-score": -0.9361496884375811
        },
        {
            "id": "5932f807-0a14-3157-b92a-acc381ee2a6d",
            "summary": "Can Chevron and ExxonMobil sail through the current turbulent tariff-induced business environment?",
            "date": "2025-04-08T13:39:00Z",
            "sentiment-score": 0.11510265432298183
        },
        {
            "id": "36d11ab2-677a-3e49-88c5-ecf048d22aba",
            "summary": "ExxonMobil stock's potential cash flow and dividend growth make it a buy.",
            "date": "2025-04-08T16:24:17Z",
            "sentiment-score": 0.7189523931592703
        },
        {
            "id": "5ee7161c-84e8-3693-9fc7-74f65138588e",
            "summary": "CVX is set to begin a seabed survey to link Cyprus' Aphrodite gas field to Egypt, boosting regional energy ties.",
            "date": "2025-04-08T14:42:00Z",
            "sentiment-score": 0.8994458597153425
        },
        {
            "id": "e4eadf50-3daa-3028-850e-30361dd3c7cb",
            "summary": "SSL vs. XOM: Which Stock Is the Better Value Option?",
            "date": "2025-04-08T15:40:08Z",
            "sentiment-score": 0.003245837986469269
        },
        {
            "id": "b7fa6848-cba0-3259-8071-6d2fc53b42dc",
            "summary": "Energy stocks were lower late Tuesday afternoon, with the NYSE Energy Sector Index falling 3% and th",
            "date": "2025-04-08T19:42:10Z",
            "sentiment-score": -0.9599809171631932
        },
        {
            "id": "ecda9868-9da8-3747-86ad-5bf93357b6d7",
            "summary": "AFRM and RH have been highlighted as Zacks Bull and Bear of the Day.",
            "date": "2025-04-09T08:14:00Z",
            "sentiment-score": 0.2394199762493372
        },
        {
            "id": "5bae32d9-43f4-3c2f-8ce7-5a437f2fbce0",
            "summary": "Oil price plunges below $60, dragging oil majors like XOM, CVX, and SHEL lower. Trade war tariffs and OPEC+ supply surge shake up global energy markets.",
            "date": "2025-04-09T10:33:00Z",
            "sentiment-score": -0.921746707521379
        },
        {
            "id": "308b2429-f840-35e3-be2e-acd086649016",
            "summary": "XOM, SHEL, RES, EQNR and MTDR emerge as the energy headline makers during the week.",
            "date": "2025-04-09T12:09:00Z",
            "sentiment-score": 0.08093082718551159
        },
        {
            "id": "3ec2c0a2-f6cd-3b90-895a-b2e7635c1ac6",
            "summary": "(Bloomberg) -- Oil plunged to a four-year low as an intensifying trade war endangered energy demand, with a fresh wave of US and Chinese levies menacing the global economy.Brent futures tumbled below $60 a barrel for the first time since 2021 as natural gas, copper and other commodities also slid. West Texas Intermediate futures traded near $57 a barrel. Shares of BP Plc, Shell Plc, Exxon Mobil Corp. and Chevron Corp. slumped.Crude futures maintained losses as official US data showed domestic in",
            "date": "2025-04-09T14:40:46Z",
            "sentiment-score": -0.9479939443990588
        },
        {
            "id": "fec161a4-84b1-3154-abd5-1622bab5a0e6",
            "summary": "The average brokerage recommendation (ABR) for Exxon (XOM) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effectiveness of this highly sought-after metric questionable. So, is it worth buying the stock?",
            "date": "2025-04-09T13:30:14Z",
            "sentiment-score": 0.01663944311439991
        },
        {
            "id": "9f964551-ed32-3b24-b9c7-a6d366a91d08",
            "summary": "Exxon (XOM) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
            "date": "2025-04-09T13:00:13Z",
            "sentiment-score": 0.02018109615892172
        },
        {
            "id": "bcbf34d4-e429-3459-8d71-5869e3843bef",
            "summary": "Madison Mills and Yahoo Finance Executive Editor Brian Sozzi outline what's driving interest in some of the trending tickers on Yahoo Finance's platform. Citi analysts cut their Nvidia (NVDA) price target to $150 per share, citing reduced chip sales in 2025 and 2026 due to the trade war. Jefferies analysts outline their top defensive retail and consumer-facing picks, including Uber (UBER), Exxon (XOM), McDonald's (MCD), and Netflix (NFLX). Logitech (LOGI) withdraws its full-year 2026 guidance, citing tariff uncertainty. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
            "date": "2025-04-11T15:02:02Z",
            "sentiment-score": -0.9343402707017958
        },
        {
            "id": "286f2275-39ca-33d9-ad32-a8859bfb7310",
            "summary": "We recently published a list of the 11 Cheap NYSE Stocks to Invest in According to Hedge Funds. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other cheap NYSE stocks. On March 26, Jack Caffrey of JPMorgan Asset Management provided an analysis of market trends […]",
            "date": "2025-04-11T20:41:21Z",
            "sentiment-score": 0.007961319759488106
        },
        {
            "id": "6714afdf-7fe0-35f4-9cff-3ff7964d49f0",
            "summary": "WASHINGTON (Reuters) -The U.S. Federal Trade Commission took a step toward potentially reversing bans on certain oil executives joining the boards of Chevron and Exxon Mobil that the Biden administration made a condition that allowed them to acquire two other oil producers.  Exxon, which acquired Pioneer Natural Resources last year, had agreed to bar former Pioneer CEO Scott Sheffield from its board.  Chevron, which agreed to buy Hess in 2023, consented to a similar order keeping that company's CEO, John Hess, off its board.",
            "date": "2025-04-11T18:38:20Z",
            "sentiment-score": -0.6301111988723278
        },
        {
            "id": "6ef4988e-5432-38f1-80b6-10e38cd7db1e",
            "summary": "Companies in The News Are: KMX, AAPL, CL, XOM",
            "date": "2025-04-11T13:19:00Z",
            "sentiment-score": 0.0035934410989284515
        },
        {
            "id": "a34f98a3-d5f6-4d3b-a0a9-9a3d7940c1d1",
            "summary": "A bearish call that is staying in place.",
            "date": "2025-04-11T12:40:02Z",
            "sentiment-score": -0.039957113564014435
        },
        {
            "id": "46a1ae6c-8bf9-391a-a29a-01b592251835",
            "summary": "One of PBR's brightest spots is its robust production outlook.",
            "date": "2025-04-11T12:20:00Z",
            "sentiment-score": 0.9042688896879554
        },
        {
            "id": "0eba32c0-6cad-37da-bbfc-f016b24629f0",
            "summary": "Oil prices (CL=F, BZ=F) are down double digits since the start of 2025 as US President Trump's trade war fuels worries about the global economy. Tortoise senior portfolio manager and managing director Rob Thummel sits down with Madison Mills and Wolfe Research chief economist Stephanie Roth to examine the oil market and what it signals about the global economy. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
            "date": "2025-04-11T10:00:40Z",
            "sentiment-score": -0.8630567789077759
        },
        {
            "id": "45d15f23-4e4f-3bab-b267-5e5b83ca2110",
            "summary": "Oil is back to $60. Tracey Ryniec, Zacks Value Stock Strategist, looks at the earnings outlook for 3 big oil companies.",
            "date": "2025-04-10T23:09:00Z",
            "sentiment-score": -0.022777270525693893
        },
        {
            "id": "bfd5103e-6f43-3bff-a2b6-acf04680d2f1",
            "summary": "OMV (OMVKY) saw its shares surge in the last session with trading volume being higher than average. The latest trend in earnings estimate revisions could translate into further price increase in the near term.",
            "date": "2025-04-10T15:13:00Z",
            "sentiment-score": 0.9151214128360152
        },
        {
            "id": "c884b92f-6d3b-3ae4-98aa-cf14182c30b3",
            "summary": "CVX plans to use triple-frac in more than half of its Permian wells in 2025, reducing costs by 12% and accelerating output to boost production levels.",
            "date": "2025-04-10T09:55:00Z",
            "sentiment-score": 0.9173196833580732
        }
    ]
}